[{"has_chat":"true","link":"jobs/packlane.html","location":"Remote or Berkeley, CA","published":"Feb 26","id":1,"title":"Packlane Customer Service Representative","body":"\nCustomer service is often taken for granted. “Just do your job,” they say. “That’s what we’re paying you for,” they say. Not here. At Packlane, we see it as an art form. Because great service—where details matter most, problems get solved (not deflected), and relationships are built—is magical. We know that without the right person representing us on the frontlines, we don’t stand a chance. Our customers come to us because they want the best for their business. And the best starts with you.\n\n**What you’ll do:**\n\n- Show off your proficient, positive, and proactive personality in every communication with our customers—not just on email, but also on live chat, where thinking-on-your-feet is key.\n- Be a steadfast Know-It-All when it comes to order status, product info, technical issues, pricing and more. And if you don’t know it all, you’ll know how to track it down. Fast.\n- Keep our customers’ accounts up to date, managing refunds or credits when necessary.\n- Become our CSSME—Customer Service Subject Matter Expert. In other words, know your stuff, write it down, and make sure it goes viral.\n- Remember that part about solving (not deflecting) problems? Yeah, that.\n\n\n### REQUIREMENTS\n**Who You Are:**\n\n- Detail obsessed. Like housecleaning with a toothbrush obsessed.\n- An unapologetic people person. Hugging optional, of course.\n- Reliable. Accountable. Dependable. And all the other good -bles. You know what they are.\n- A communicator at heart, who appreciates how the right words can soothe even the surliest souls.\n- Familiar with printing processes and Adobe Creative Suite, if you really want to blow our minds.\n\n### BENEFITS\nWork from anywhere! This is a full-time, remote position.","publish_date":"2016-02-26"},{"has_chat":"true","feature":"true","link":"jobs/formlabs-lead.html","location":"Boston, MA","published":"Feb 22","id":2,"title":"Formlabs Professional Support Lead","body":"\nTo reinvent an industry, you have to build the best team. **Join Formlabs** if you want to bring ground-breaking professional 3D printers to the desktop of every designer, engineer, researcher, and artist in the world.\n\nOur primary goal is to give our customers the best tools with an amazing experience. We’re looking for a visionary that can lead a team to ensure the highest level of service for our growing professional user base: the individual users and the larger organizations that have opted for our Pro Service Plan.\n\nIf you love building relationships and redefining the customer experience, we want you on the Form Team as the **Professional Support Lead**.\n\n### The job:\n- Develop new channels and resources for a rapidly growing customer base\n- Create excellent support content and continually improve our support systems\n- Educate customers on new ways to get more from their printers\n- Keep customers ridiculously happy with a true white glove experience\n- Print in 3D to your heart’s content\n\n### You:\n- Have an excellent track record of building and managing a product or service\n- Champion technical solutions alongside engineers, designers, and fabricators\n- A visionary, with a love for getting on the phone to consult customers on their needs\n- Have developed curriculum and/or taught complex technical issues\n- Enjoy dismantling, troubleshooting, and playing with electronics\n- Care about going the extra mile to meet each customer’s needs\n- Possess exceptional written and verbal communication skills\n- Have worked on the front lines of customer service\n- Easily adopt cloud-based business systems (Salesforce, Zendesk)\n- Can build and excite a team to consistently deliver high quality service\n\n### Bonus skills:\n- Experience with 3D printing, modeling and digital fabrication tools\n- Experience providing technical support for hardware products\n- Multi-lingual: fluency in German or French","publish_date":"2016-02-22"},{"has_chat":"true","feature":"true","link":"jobs/formlabs.html","location":"Boston, MA","published":"Feb 22","id":3,"title":"Formlabs Customer Support Engineer","body":"\nTo reinvent an industry, you have to build the best team. **Join Formlabs** if you want to bring ground-breaking professional 3D printers to the desktop of every designer, engineer, researcher, and artist in the world.\n\nOur primary goal is to give our customers the best tools with an amazing experience. At Formlabs, that means answering every question, no matter how small, and building amazing support material to empower our users to innovate and create.\n\nIf you love new technology and are a natural problem-solver and a great communicator, we want you on the Form Team as a **Customer Support Engineer**.\n\n### The job:\n- Remotely identify and resolve technical issues with both software and hardware\n- Create excellent support content and continually improve our support systems\n- Keep customers ridiculously happy\n- Print in 3D to your heart’s content\n\n### You:\n- Feel amazing when you can identify the cause of a challenging problem\n- Can teach complex technical issues to any audience\n- A critical thinker, with an ability to quickly diagnose and resolve technical issues\n- Can easily adopt cloud-based business applications (Zendesk, Salesforce)\n- Power through task lists at lightning speed\n- Enjoy dismantling, troubleshooting, and playing with electronics\n- Care about going the extra mile to find or create the best solution\n- Possess exceptional written and verbal communication skills\n\n### Bonus skills:\n- Experience with 3D modeling, printing and digital fabrication\n- Experience providing technical support for hardware products\n- Creating and writing troubleshooting guides\n- Engineering or craft background, building and repairing electrical/mechanical systems\n- Familiarity with ticket or case management systems (Zendesk)","publish_date":"2016-02-22"},{"has_chat":"true","feature":"true","link":"jobs/haikulearning.html","location":"Tucson, AZ","published":"Feb 19","id":4,"title":"Haiku Learning Support Specialist","body":"\n### What is Haiku Learning?\n\nHaiku Learning is about community, and that includes our company’s community of creators, evangelists and visionaries. Right now we’re looking for a talented communicator and process-driven people-person who is passionate about great software, smart teamwork, and doing good in the world. We are a technology company that is passionate about the technology, but even more passionate about making tools that transform learning.\n\nWhy Haiku Learning is one of the best places to work on the planet:\n\n- You get to promote learning spaces that change lives.\n- You get to work with teachers and education technologists - some of the smartest, most amazing people from the leading schools and educational programs in the world.\n- You have flexibility to live your life. We know you have hobbies, interests, and families. We want you to love what you do, but not live what you do.\n\nIf you like people, are passionate about education, and want to help build the learning spaces of tomorrow, we want to hear from you.\n\n### Role Summary\n\nSupport Specialist are in charge of making sure every support request is met with positive energy and attention. Support Specialists should have a good eye for detail and are excellent writers who want to make sure people are taken care of. They are sleuths and investigators: Think Sherlock (with social skills).\n\nAs a First-Line-of-Defense Support Specialists, your primary role is to be responsive to customers via phone and our support ticketing system. You will also be investigating problems customers encounter to see if you can identify bugs and other issues. Support Specialists follow up internally as well as externally to communicate findings and solutions. \n\nThe expectation of the job is that you will be working 40 hours per week. You will be part of our support rotation on some weekends and holidays, and your weekly hours will be flexed to compensate for these duties. Your exact schedule will be determined by you and your supervisor.\n\n### Support Desk \n- Provide general support, lightweight integrations support, and general troubleshooting\n- Respond to support tickets, phone calls, and emails\n- Provide weekend Helpdesk support on a rotating basis\n- Follow up on existing tickets in a timely manner\n- Maintain active dialogue with users on open tickets\n- Report bugs and propose fixes to the Technical Lead or Technical Services Team\n- Understand and follow internal processes for support emergencies\n- Give suggestions for internal support processes and tool improvements\n\n### Product Quality Assurance & Technical Investigation\n- Work with Technical Lead to provide higher-level support for complex issues, including deep investigation, bug replication, and troubleshooting as needed \n- Participate in pre-launch Happy Hours (Quality Assurance Testing)\n- Participate in post-launch QA and customer follow-up process\n- Make tickets for fixes, changes, and enhancements\n- Work with Support Technical Lead to prioritize issues and follow up on critical bugs\n\n### Other Responsibilities\n- Attend weekly departmental meetings\n- Be responsive to our internal teams via chat, video, and email during working hours\n- Help keep Knowledgebase articles and videos accurate, up to date, and cross-referenced\n- Collaborate with Community Care team on general and shared duties\n- Collaborate with Support Team to triage tickets and escalate problems as needed\n- Complete other tasks and projects as requested by Team Manager\n\n### Skills & Proficiences\n- Strong technical skills with the ability to troubleshoot and clearly communicate solutions both orally and in writing\n- Familiarity with Google Apps and ticket tracking applications not required, but is a plus\n\n### Requirements\n- Bachelors degree, or comparable experience in customer support","publish_date":"2016-02-19"},{"has_chat":"true","link":"jobs/omni.html","location":"Seattle, WA","published":"Feb 17","id":5,"title":"Omni Phone Support Human","body":"\n<p>The Omni Group is expanding our band of Support Humans (also known as our Tech Support team). We’re looking for candidates who are great at cheerfully helping customers with our OS X and iOS products on the phone, as well as via email, Twitter, and on our forums. Support Humans work together as a team and with customers to answer questions, solve problems, and (whenever possible) have a surprisingly pleasant conversation about software.</p>\n\n<h3>Job Activities</h3>\n\n<ul>\n<li>You’ll be working with customers who call in or otherwise contact us and need technical help with our Mac and iOS products. If you know the answer to their question, great! If you don’t, gather as much information as you can and work with the other folks here to figure it out so you can get back to them and help.</li>\n<li>We’re looking for candidates who have a positive attitude, great phone skills, and who are good at thinking their way through problems on a computer they can’t actually see. We don’t have those binders of troubleshooting scripts some other companies use; your imagination will be one of your most important tools in this job.</li>\n<li>You need to enjoy learning about technology; even if you know a lot, you’re going to learn more once you start working with us.</li>\n</ul>\n\n<h3>Compensation and Benefits</h3>\n\n<ul>\n<li>We have great customers that love our apps and push them to their limits. Support Humans get the satisfaction of earning their gratitude by helping them out.</li>\n<li>We believe that being friendly is at least as important as being smart when it comes to making great software. When you need help with a problem here, you probably know who to ask and you can assume they’ll be happy to talk about it. </li>\n<li>At Omni, we may not always agree on the best way to solve the problems we work on, but we pride ourselves on all being on the same team. This is not a workplace where people can further themselves by tearing you down.</li>\n<li>Support Humans are explicitly included in the process of creating of our products; they’re a valuable source of insight into the needs and concerns of our customers.</li>\n<li>Competitive total compensation package: base salary in the mid-$40k range, a 401k with matching, and the potential for profit sharing based on company profitability.</li>\n<li>Fully paid health/dental/vision for you and your dependents.</li>\n<li>Biweekly massages.</li>\n<li>Free meals prepared by our Executive Chef and the rest of his team. Your SOs are welcome to eat here or you can pack dinner up to take home to your family. </li>\n<li>Lots of other good stuff, which you can read about elsewhere on this website.</li>\n</ul>\n\n<h3>How to Get This Job</h3>\n\n<strong>To be considered for this job, the following things <em>must</em> be true:</strong>\n\n<ul>\n<li>You live in the Seattle area and are able to work with us in our Seattle office, a little bit north of downtown. We’re not looking for remote employees, and we’re not looking to relocate anyone to fill this position. Apologies in advance, but we won’t be making any exceptions on this.</li>\n<li>You are empathetic, patient, and have a positive attitude, even when helping a customer who is having a very bad day.</li>\n<li>You have strong problem-solving, communication, and customer service skills. You can think your way through problems and enjoy helping our customers solve them. (Even if the problems aren’t well-defined, even if the usual solutions aren’t working, and even if it’s the fifth person you’ve helped solve that problem today.) </li>\n<li>You also have the ability to speak up, ask questions, and absorb technical information. You’ll be well supported while you’re learning about our applications, but you need to be the kind of person that asks for help when they need it.</li>\n<li>You are comfortable using and solving problems with Macs, iOS devices, and the apps that run on them. If you’re the person that your relatives ask for help with their Apple Store purchases, that’s a good sign.</li>\n<li>If you’re not actually an animal person, you should be able to tolerate them in the workplace. Employees bring their dogs to the office on a daily basis.</li>\n</ul>\n\n<h3>Special Bonus Lightning Round Extras</h3>\n\n<strong>The following things aren’t requirements, but would be nice to mention if they apply to you:</strong>\n\n<ul>\n<li>Previous phone-based tech support experience would be a big plus. General phone-based customer service experience or in-person tech support experience would also be plusses.</li>\n<li>Experience using Terminal commands and/or the ability to comfortably hand-edit XML, HTML, or JavaScript would be another huge plus. </li>\n<li>Read or speak a language other than English? We’re listening. :-)</li>\n<li>An <em>ideal</em> candidate would have some experience with our applications. If you haven’t ever used them, go to our website and read about them. If they seem interesting to you, this is a good sign. If you have access to a Mac, download them and play with them. </li>\n</ul>\n\n<p>To apply, send an email to&nbsp;<a href=\"mailto:resumes@omnigroup.com\">resumes@omnigroup.com</a>; include the exact phrase “Phone Support Human” in the subject line. Include a copy of your résumé in text, HTML, RTF or PDF form.</p>\n\n<p><strong>Please note:</strong> if you send your resume as a Word document, you will not be considered for the position. No phone calls or visits to the office, please.</p>\n\n<p>Every applicant that sends in a resume before <strong>February 22nd</strong> will receive a set of sample support questions to work on; applicants will have until <strong>February 28th</strong> to submit responses. Those answers are by far the most important factor we’ll use when selecting applicants to invite in for interviews.</p>\n\n<p>Our goal with this hire is to find coworkers that will impress our customers by solving problems better and faster than they expect, that will suggest ways to improve our products so a problem that occurred today is solved tomorrow, and who we’ll enjoy working alongside in this important, meaningful, and deeply silly industry we’ve chosen to devote our careers to.</p>\n\n### About Omni\n<p>The Omni Group is a rewarding but nontraditional place to work, and our compensation packages reflect that. We offer the usual range of traditional benefits to employees:</p>\n- Competitive salaries, based on experience.\n- Bonuses, based on our revenues and profitability for the year.\n- Stock options. (Note that we are not aiming to become publicly traded.)\n- 401(k), with some company matching, again depending on our revenues and profitability for the year.\n- Full health coverage.\n- Vision and dental coverage.\n<p>But when we founded this business we knew that we were going to spend a ton of time here, so basic survival dictated that it should be fun as well as easy to work in. To those ends, we also have some less traditional benefits:</p\n- Omni has a professional chef and assistants with the power of a restaurant-grade kitchen at their disposal. Dinner is at five o’clock every weeknight; your SO and kids are welcome, too. If you find eating at the office to be impractical, feel free to pack some food up to take home with you.\n- Personal hardware purchase budget. Omni provides everything you need to get your job done in the office, but if you need an extra 30” display at home we can help with that too.\n- Professional development budget, which covers conferences, training, or materials that you can convince us will help further your work-related skills.\n- Corporate matching of personal contributions to 501(c) non-profits, up to a limit.\n- A theater, and other media amenities. Miss a WWDC session? Watch it on our hugenormous projector. Fail to watch indie movies when they first came out? Check them out from our movie library!\n- A whole mess of console video game systems, both current and old-school. There is a dedicated A/V system for the games, so someone can watch Game of Thrones while others play Rock Band. And of course, we have a large suite of board games, D&D goodies, pinball, and other classic paraphernalia.\n- On-site massages.\n\n<p>But, don’t get the impression we just goof around: it takes a lot of hard work to make our products a joy for our customers. Doing what we do, and doing it the way we choose to, is not easy. Luckily, we all love doing what we do, and we hope you will too.</p>\n<p>Omni is located in rainy Seattle, possibly the most beautiful city in North America. The air here is still clean, the people still friendly, local brands are still more popular than national brands, and music festivals still feel like they are for the people.</p>","publish_date":"2016-02-17"},{"link":"jobs/appointlet.html","location":"Remote or Portland, OR","published":"Feb 12","id":6,"title":"Appointlet Customer Success Manager","body":"\nAppointlet is a Portland, OR based SaaS startup that is making life easier for sales teams by eliminating the back-and-forth of scheduling calls and video conferences with customers & prospects. If you've ever seen a \"Schedule Demo\" button on a website or in emails, we want to be that button.\n\nWe provide our customers with a widget that let’s their prospects easily book a time to be given a product or service demo. After the visitor books a time, it’s added to the company’s calendar so they can focus on selling.\n\nOur software is small, but the impact it has on our customers is huge.\n\nWho this is for:\n\nThis position is for someone that…\n\n- Has excellent communication skills, both verbal and written.\n- Is extremely patient and nice, even when the customer isn’t.\n- Knows (generally) how the SaaS industry works.\n- Loves solving problems. Every customer is different so being able to meet their specific needs and go above and beyond to provide them with additional value is a must.\n- Doesn’t want to work for a corporate machine. There are two of us, so you’ll be the third.\n- Is self-motivated and able to stay productive without supervision.\n- Wants reasonably flexible hours and a laid back work environment.\n\nWhat you'll do:\n\n- Be on the front-line replying to customers in Intercom.io and on the phone.\n- Explain the benefits of Appointlet to visitors and help on-board them when they sign up.\n- Maintaining our knowledge base by adding/updating guides and frequently asked questions.\n- Researching and implementing techniques to improve customer retention.\n- Forming relationships with our bigger customers and checking in on them.\n- Experiment: this is a startup so you’ll likely get your hands dirty in a little bit of everything.","publish_date":"2016-02-12"},{"has_chat":"true","link":"jobs/vend.html","location":"Auckland, New Zealand","published":"Feb 12","id":7,"title":"Vend Customer Insights Analyst","body":"\nJust in case this is the first time you’ve visited our website, Vend is an award winning, web based, point of sale software for retail.  We’re chucking out crusty old cash registers and replacing them with iPads, touch screens and beautiful software, all of this to make life easier for our retailers.  Vend is a fast-growing tech start-up, since launching in 2010 we’ve now got 10,000+ customers all over the world with more than 170 employees shared between our Auckland, Melbourne, Toronto, London & San Francisco offices.\n\nOur cloud-based retail point of sale platform is replacing crusty old cash registers and giving our retailers the tools they need to grow their businesses. We’re shaking things up and pushing out innovations, creating huge demand for our SaaS solution all over the world. With strategic relationships with the likes of Apple and Xero, we’re footing it with the big guys.\n\nThis role is part of our Customer Success team which works with 1000s of customers over 1000s of interactions daily. You will analyse all these interactions and turn that data into clear, concise, and actionable insights, allowing us to do two things:\n\n1. Create new initiatives that will improve the customer experience.\n2. Enable our customer support teams to improve the way they interact with customers.\n\nWe’re looking for an analyst with data or business intelligence skills that can work specifically with our customer support team, while collaborating with our business intelligence and strategy teams as well!\n\n### WHAT WILL YOU BE WORKING ON? WELL, YOU'LL BE...\n- Working closely with our customer support  team on things like ad hoc data requests, dashboards, reports, alerts and real time performance metrics, that will help support our strategy and business metrics (the terms SLAs, volume coverage and productivity really get you excited).\n- Collaborating with our business intelligence team, doing things like identifying opportunities for improved data efficiency in customer success.\n- Generally collecting and analysing high quality data, providing us with actionable information for our customer support (and non-customer support) teams.\n- Developing new insights to help us make the best decisions and develop new customer success initiatives, improving processes and enabling innovation.\n- Using data to help drive up our key customer success metrics (like NPS and customer health scores!).\n\n### DOES THIS SOUND LIKE YOU?\n- You’re accurate, with an eye for detail.\n- You’ve got analytical horsepower with experience in customer analytics, business intelligence, data mining and/or research analytics building decision making models.\n- You’ve got ideally one year of experience working with data analytics or data insights in some capacity, dealing with and analysing high volumes of data.\n- You can tell a meaningful story from quantitative and qualitative analysis and you can transform data sets into actionable insights for people who aren’t as data savvy as you!\n- You’ve got a Bachelor’s degree in a number heavy topic, or relevant work experience. You’re a whizz with numbers!\n- You love digging into large data sets using MS Excel, DB querying, pivot tables, macros & BI tools.\n- Ideally, you’ll also have experience working with customers in or with customer support teams.\n\nWhat can you expect from us? Well, we could tell you. But a better way is to show you! Check out #weworkatvend on Instagram for some snaps of what we get up to here. Get in touch, apply now - an opportunity like this rarely comes up so we'd hate for you to miss out :)","publish_date":"2016-02-12"},{"has_chat":"true","feature":"true","link":"jobs/wildbit-beanstalkapp.html","location":"Philadelphia or Remote","published":"Feb 12","id":8,"title":"Wildbit Customer Success - Beanstalkapp","body":"\nWe’re looking for someone who understands that customer success is a focus on customers, not on ourselves. At Wildbit, our focus is entirely on enabling teams to build and launch their own products and services. Our success team handles our customers needs proactively (success) and reactively (support) across our three products (Beanstalk, DeployBot, and Postmark).\n\nYou’ll be working with our customer success team helping new customers get up to speed quickly, educating developers on industry best practices, and helping our team identify where we can better meet the needs of our customers. This means creating content & user guides, talking to customers over various channels (email, support, chat, phone, etc), analyzing behaviors, and keeping our developers & designers up to speed at all times.\n\nMost of all, this job is about empowering developers to do their best work. And to have fun doing it!\n\n### Requirements:\n- solid writing skills\n- empathy for novice developers\n- a desire to teach\n- a background in web development\n- a solid understanding of version control (Git & Subversion) and development practices \n- experience in measuring and tracking your own results\n- for this position, we’re looking for people able to work the following hours: **8–4 GMT and 8–4 PST**\n\n### Nice to haves:\n- Experience in customer success/product management\n- Experience in customer support\n- Experience supporting or building a SAAS product\n\n### Benefits:\n- Chef-prepared family lunches (in Philly office)\n- Full health benefits\n- Company-paid retreats\n- Computer setup of your choice, renewed every 2 years\n- 25 paid days off per year\n- Quarterly profit sharing\n- Attend conferences\n- Quiet Fridays\n- 40 hour work week with flexible hours","publish_date":"2016-02-12"},{"has_chat":"true","feature":"true","link":"jobs/wildbit-postmarkapp.html","location":"Philadelphia or Remote","published":"Feb 12","id":9,"title":"Wildbit Customer Success - Postmarkapp","body":"\nWe’re looking for someone who understands that customer success is a focus on customers, not on ourselves. At Wildbit, our focus is entirely on enabling teams to build and launch their own products and services. Our success team handles our customers needs proactively (success) and reactively (support) across our three prodcuts (Beanstalk, DeployBot, and Postmark).\n\nYou’ll be working with our customer success team helping new customers get up to speed quickly, educating developers on industry best practices, and helping our team identify where we can better meet the needs of our customers. This means creating content & user guides, talking to customers over various channels (email, support, chat, phone, etc), analyzing behaviors, and keeping our developers & designers up to speed at all times.\n\nMost of all, this job is about empowering developers to do their best work. And to have fun doing it!\n\n### Requirements:\n- solid writing skills\n- empathy for novice developers\n- a desire to teach\n- a solid understanding of transactional email and email technologies (SPF, DKIM, DMARC)\n- experience in measuring and tracking your own results\n-  for this position, we’re looking someone able to work the following hours: **8–4 PST**\n\n### Nice to haves:\n- previous experience in customer success/product management\n- previous experience in customer support\n- previous experience supporting or building a Saas product\n\n### Benefits:\n- Chef-prepared family lunches (in Philly office)\n- Full health benefits\n- Company-paid retreats\n- Computer of your choice, renewed every 2 years\n- 25 paid days off per year\n- Quarterly profit sharing\n- Attend conferences\n- Quiet Fridays\n- 40 hour work week with flexible hours","publish_date":"2016-02-12"},{"feature":"true","link":"jobs/activecampaign.html","location":"Chicago, IL","published":"Feb 11","id":10,"title":"ActiveCampaign Director of Support","body":"\nActiveCampaign is a quickly growing SaaS company. We’ve built an integrated marketing & sales platform for companies of all sizes. We are known for being the easiest to use solution on the market and offering the best customer support experience.\n\nWe are looking for someone to improve upon our overall customer support experience while building out our support team to meet the demands of our increasing growth.\n\n### WHAT YOUR DAY COULD CONSIST OF:\n- Working with and developing our support team members on a group and individual basis\n- Identifying trending issues and working with product & development teams on solutions\n- Building out processes to improve our customer experience & ensuring processes are being utilized\n- Prospecting, interviewing, and on-boarding new hires\n- Creating strategy for growing the support team and areas of focuses\n- Assisting with defining and working towards quarterly goals for improving our customer experience\n\n### WHAT IS NEEDED:\n- Previous experience building out and managing a support team (preferably for a SAAS company)\n- Experience with recruiting and hiring for a support team\n- A passion for data analysis and processes\n- Knowledge of email marketing & marketing automation\n\n<!--[if(lte IE 8)]>\n\t\t\t\t<img style=\"width:150px\" class=\"ie meta_logo\" src=\"http://metacommunications.com/wp-content/themes/meta2015/images/fallback/logo_meta_stacked_white.png\">\n\t\t\t<![endif]-->","publish_date":"2016-02-11"},{"has_chat":"true","link":"jobs/partnerhero.html","location":"Anywhere (remote is okay!)","published":"Feb 9","id":11,"title":"PartnerHero Japanese Localization Associate (remote)","body":"\nThe company, a PartnerHero client, manages a platform or marketplace for online learning. Unlike academic MOOC programs driven by traditional collegiate coursework, the company provides a platform for experts of any kind to create courses which can be offered to the public, either at no charge or for a tuition fee. The company provides tools which enable users to create a course, promote it and earn money from student tuition charges.\n\nPartnerHero is looking for highly motivated candidates with a passion for localization and customer support. In this role, you will be part of a global team dedicated to supporting our client on an array of interesting issues. In a department that encourages innovation and forward thinking, you will be providing support to our global clients focusing mainly on culturizing the product to the Japanese community.\n\nOur mission is to provide customers with an optimal support experience driven by passion and expertise. We place the highest value on every customer interaction and approach each inquiry with urgency, care and the desire to further strengthen the existing relationship.\n\nThe Japanese Localization Associate will work with the company’s Japanese Country Manager. You will be required to translate and adapt a product or content to the Japanese locale and market. Translation is only one of several elements of the process. In addition to translation and support, it may also include:\n- Adapting graphics to target markets\n- Answering customer support emails, and solving their problems\n- Modifying content to suit the tastes and consumption habits of other markets\n- Adapting design and layout to properly display translated text\n- Converting to local requirements (such as currencies and units of measure)\n- Using proper local formats for dates, addresses, and phone numbers\n- Addressing local regulations and legal requirements\n\n### REQUIREMENTS\n- Outstanding written and verbal/written communications skills in Japanese and English\n- You are a native Japanese or have superior knowledge of Japanese culture\n- Strong analytical, problem solving and troubleshooting skills\n- A passion for delighting customers and solving their problems\n- Openness to work flexible hours if required, including weekends and holidays\n- Ability to work effectively in a fast-paced, innovative environment demonstrating high energy, a sense of urgency, and decisiveness\n- Polite, thoughtful and friendly attitude\n- Team player with an ability to operate at all levels in a matrixed organization\n- Attentiveness and empathy for customers\n- Technologically savvy\n- A curiosity about how things work, and a thirst to learn new things\n- Ability to learn and adapt to new systems and processes\n- Prior customer service & support experience a plus","publish_date":"2016-02-09"},{"link":"jobs/supercell-specialist.html","location":"Helsinki, Finland","published":"Feb 1","id":12,"title":"Supercell Player Support Outsourcing Specialist (Japan)","body":"\nJapan is a country with a long and rich tradition in the video game industry, home to some of the most beloved brands in the world – and to some of the most passionate players of our games.\n\nWe are looking for a Player Support Outsourcing Specialist to join our team in Helsinki and to work with our partners in Japan to ensure the best support experience for our players. Working in our multicultural team you will be the voice of our players in Japan, manage the relationship with our local partner and build a bridge between the eastern and western cultures.\n\nThe person we are looking for is a gamer with a strong background in customer support or vendor management and a unicorn-like personality who wants to push the boundaries of support for mobile games and beyond.\n\nYou are self-driven and hands-on? You can take decisions on a day-to-day basis independently? You don’t mind getting your hands dirty and address our players on individual level? Great, we have a team structure with minimal hierarchy and no red tape where the only limits to what’s achievable are set by your imagination.\n\nIf you want to make a difference for millions of fellow players in Japan, this might be the right place for you.\n\n### RESPONSIBILITIES\n- Become an expert at Supercell games and our internal tools\n- Directly manage our BPO partner in Japan\n- Use data in your day-to-day management to achieve the best results\n- Collaborate closely with other internal stakeholders\n- Be the voice of our players in Japan\n- Apply your knowledge to current and new Player Support projects\n- Support the Japanese localization of our games as required\n\n### REQUIREMENTS\n- Native or bi-lingual Japanese skills\n- Excellent verbal and written English skills\n- Previous experience in a customer support or vendor management (3-5 years) role\n- Team player with strong problem solving and conflict management skills\n- Empathic and culturally aware\n- Passion for video games and mobile applications\n- Ability to travel frequently (other Supercell offices and partners)\n\n### NICE TO HAVES\n- Passion for one or multiple Supercell games\n- Experience working in multicultural environments\n\n### SUPERCELL OFFERS\n- A first-row view into one of the most successful game companies in the world\n- Opportunity to work with a team of gaming veterans, top talent, and passionate gamers\n- Easy-going, enthusiastic, open and at the same time a very results-driven culture\n- Competitive compensation\n- Smartphone, tablet, laptop/workstation of your own choice\n- Industry leading benefits\n- Amazing co-workers ","publish_date":"2016-02-01"},{"has_chat":"true","link":"jobs/base.html","location":"Mountain View, CA","published":"Jan 28","id":13,"title":"Base CRM Product Support Specalist","body":"\nWe’re looking for a Product Support Specialist in our Mountain View office. You will be the first point of contact for our users and help serve as the voice of the company. We’re looking for smart, engaging, and dynamic people who learn quickly and have a passion for technology. \n\nIf you’re looking to kickstart your career by joining one of the fastest-growing startups in the Valley, we want to hear from you!\n\n### EXPECTATIONS\n- Assist current and potential Base users in understanding the product, its features and how it can best be used to grow their business.\n- Provide product demonstrations and webinars for prospective and current users to help them understand how to get the most out of Base.\n- Manage and resolve support requests over the phone or email.\n- Update or create support articles for new features.\n- Work with users to identify, troubleshoot and resolve issues as well as collect feedback.\n- Work side-by-side with our Product Engineering team to improve Base.\n- Provide a positive, personalized experience to each customer who reaches out to us.\n\n### REQUIREMENTS\n- MOST IMPORTANT—You possess strong written and verbal communication skills.\n- You're a self starter and are driven to conquer projects outside of your core responsibilities.\n- You’re analytically-minded, and are able to prioritize workloads and adjust as situations change.\n- You enjoy helping others and appreciate the challenge of solving technology related problems.\n- You're excited about learning and technology in a rapidly growing environment.\n- You engage well with others and remain calm under pressure.\n\n### BONUS SKILLS YOU MAY HAVE\n- Experience using Microsoft Excel\n- Experience using a CRM solution and an understanding of the SaaS marketspace\n- Knowledge of various mobile platforms: iOS, Android, and Windows Mobile\n- Familiarity with RESTful API, Chrome Dev Tools, and various web technologies","publish_date":"2016-01-28"},{"has_chat":"true","feature":"true","link":"jobs/ipsy-content.html","location":"San Mateo, CA","published":"Jan 27","id":14,"title":"ipsy Customer Care Content Manager","body":"\nipsy is committed to providing excellent service to our active community. We’re seeking a Customer Care Content Manager who create and optimize top-notch content (both text and visual) for our customers and employees. You will focus on scaling our online help center to maximize customer engagement and education, enhance accessibility, and reduce inbound volume through effective self-help material. You will also be responsible for creating and maintaining standard response templates, write responses for large-scale and sensitive issues in collaboration with other managers and stakeholders, and maintain our support team’s internal knowledge base.\n\n### Content Manager Profile:\n- Innovative and Analytical: You are a wordsmith, data-driven, and passionate about developing creative solutions.\n- Organized and Articulate: You are comfortable owning an array of detailed responsibilities. You communicate effectively across multiple mediums (written, oral, visual).\n- Proactive and Adaptable: You thrive in a challenging, collaborative environment and respond to changes with a flexible attitude.\n\n### Key Responsibilities:\n- Write and edit community help center (FAQs), customer outreach emails, and response templates for our support agents\n- Maintain content for our internal knowledge base, as well as style and tone resources for our agents\n- Optimize help center content using data analysis in order to improve the customer experience and reduce contacts\n- Identify opportunities for context-sensitive content across customer service channels, anticipate where customers may need support, and define information delivery strategies\n\n### Qualifications:\n- Bachelor’s degree\n- At least 3 years of experience in content management, preferably in a customer service capacity\n- Experience defining, tracking, and reporting metrics on the effectiveness of content\n- Basic understanding of Google Analytics\n- Excellent eye for detail\n- Understanding of and appreciation for best-in-class customer experience\n- Empathetic, authentic, and straightforward writing style\n- Strong leadership skills and ability to take initiative\n- Capable of managing a large volume and variety of work\n- Knowledge of HTML and/or CSS a plus\n- Basic graphic design and/or Adobe Photoshop skills a plus\n\n### About us:\nipsy is the world’s largest and most passionate beauty community. The community is centered around a beauty sampling service called the Glam Bag and premier content produced by ipsy and its partner creators. Since being founded in 2011 by top YouTube creator Michelle Phan, the company has grown dramatically. On the sampling front, ipsy ships to over 1.5 million subscribers every month; on the owned content side, ipsy reaches over 20 million people every month through stylist videos and social posts.\n\nipsy has built a results-oriented team packed with seasoned beauty, e-commerce, tech, and studio professionals in offices in the Bay Area, NYC, and LA. The company has received over $100M in growth capital from premier investors including TPG, Sherpa and top industry insiders. Watch a video about working at ipsy here and consider joining our growing team!","publish_date":"2016-01-27"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Jan 26","id":15,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2016-01-26"},{"has_chat":"true","feature":"true","link":"jobs/songkick-intern.html","location":"Brooklyn, NY or Los Angeles, CA","published":"Jan 25","id":16,"title":"Songkick Customer Support Intern","body":"\n### Who we are:\nSongkick is the largest concert discovery service and artist-to-fan ticketing platform in the world. Our goal is to help artists sell more tickets directly to their fans and fix the central problem at the heart of the concert industry – that 50% of tickets go unsold. Working with over 500 artists and ticketing thousands of events worldwide each year, we’re working to make every show a sellout.\n\nSongkick delivers personalized alerts for upcoming concerts to its 10 million monthly unique fans, making it easy for these fans to track their favorite artists so they never miss them live.\n\nOur company has also powered worldwide programs for some of the world’s biggest artists, including Alicia Keys, Arcade Fire, Imagine Dragons, Blake Shelton, and Paul McCartney, creating the ultimate artist experience by linking fans through innovative ticketing technology and marketing solutions.\n\nWith offices strategically positioned in London, Los Angeles, Nashville, and New York, Songkick combines technology and expertise to make the concert experience better for artists and fans alike.\n\n### What we’re looking for:\nWe have an opening for an ambitious Graduate to join us at Songkick’s New York or LA offices. This is an opportunity to work with our Customer Support team for a 2 month paid internship.\n\nWe're after someone who is driven by helping people, making them happy and most importantly, someone who understands how much it means to see your favorite band live. You’ll be on the front line helping the music industry and music fans to get the most out of Songkick.\n\nWe pride ourselves in providing exceptional support for our users, and having accurate and exhaustive concert listings – your role will be crucial to making sure that this high standard is maintained!\n\nWe handle 90% of our support over email, so you need to be fast on your fingers and comfortable with coming across friendly and helpful through this communication channel. The successful candidate is a wordsmith extraordinaire. If you’re a stickler for grammar, get all OCD about using the same word too many times, and know exactly how many exclamation marks set the tone of an email, you’re in the right place!\n\nAlongside providing top quality support, you’ll be helping out the fulfilment department with dispatching tickets, assisting the office manager when required, and taking on small projects within other areas of the company. We make sure that interns at Songkick get a thorough insight into the whole business operation, so you’ll be sitting in on meetings and have the opportunity to talk directly to other departments that you’re interested in learning more about.\n\n### Responsibilities:\n- Be on the front-line replying to customers in Desk, the platform we use to handle our support enquiries\n\n- Liaise directly with our contacts at music labels and agencies on a daily basis to help them with their listings and using the site\n\n- Moderate concerts and festivals, spotting trends in the data and proactively care-taking the most popular events\n\n- Write blog posts and contribute to other social media projects\n\n- Assist with adding/editing ticket inventory within our system\n\n- Help out at community events\n\n- Occasionally, you’ll get pulled off-project to support other areas of the business including Office Management, Business Development and User Experience\n\n### Requirements:\n- A Bachelor’s Degree from a four-year college or university\n\n- Energetic, passionate, and driven individual who can easily collaborate with others\n\n- Sensitive to varied customer personalities\n\n- Flawless writing skills\n\n- Conscientious, with excellent attention to detail\n\n- Strong work ethic and sense of ownership\n\n- At ease when communicating with others, whether that’s via email, phone or face to face\n\n- Flexible and adaptable in a fast workplace environment\n\n- Comfortable taking initiative and making decisions independent of others\n\n- Familiar with using Macs and Google Docs\n\n### Big plus if you have:\n- Knowledge of ticketing and/or live music experience\n\n- Knowledge of social media use for customer service\n\n- Previous experience with a customer help system\n\n- Previous work/internship in a technology or startup environment\n\n### Compensation:\nHourly wage (min. wage)","publish_date":"2016-01-25"},{"has_chat":"true","feature":"true","link":"jobs/songkick.html","location":"Brooklyn, NY or Los Angeles, CA","published":"Jan 25","id":17,"title":"Songkick Customer Support","body":"\n### Who we are:\nSongkick is the largest concert discovery service and artist-to-fan ticketing platform in the world. Our goal is to help artists sell more tickets directly to their fans and fix the central problem at the heart of the concert industry – that 50% of tickets go unsold. Working with over 500 artists and ticketing thousands of events worldwide each year, we’re working to make every show a sellout.\n\nSongkick delivers personalized alerts for upcoming concerts to its 10 million monthly unique fans, making it easy for these fans to track their favorite artists so they never miss them live.\n\nOur company has also powered worldwide programs for some of the world’s biggest artists, including Alicia Keys, Arcade Fire, Imagine Dragons, Blake Shelton, and Paul McCartney, creating the ultimate artist experience by linking fans through innovative ticketing technology and marketing solutions.\n\nWith offices strategically positioned in London, Los Angeles, Nashville, and New York, Songkick combines technology and expertise to make the concert experience better for artists and fans alike.\n\n### What we’re looking for:\nWe're after someone who is driven by helping people, making them happy and most importantly, someone who understands how much it means to see your favorite band live.\n\nWe handle 90% of our support over email, so you need to be fast on your fingers and comfortable with coming across friendly and helpful through this communication channel. The successful candidate is a wordsmith extraordinaire. If you’re a stickler for grammar, get all OCD about using the same word too many times, and know exactly how many exclamation marks set the tone of an email, you’re in the right place!\n\nWe pride ourselves in providing exceptional support for our users so we need someone who is a great problem-solver and is creative about going above and beyond to make things right.\n\nHe or she will communicate with our users in a manner that reflects positively on the company, increasing our fan base and raising awareness of the Songkick brand.\n\n### Responsibilities:\n- Be on the front-line replying to customers in Desk, the platform we use to handle our support enquiries\n\n- Take ownership of tour campaigns from a customer support perspective: be a point person with our Artist Services team, assist with testing of new ticket stores and own the feedback loop for customer issues\n\n- Get to know the Songkick product and eco-system inside-out - you’ll need to be as comfortable guiding a confused user through our onboarding process as you are in handling complaints and refund requests\n\n- Be a brand ambassador - you’ll be representing the company on a daily basis, every interaction is an opportunity to impress, engage and grow our user base\n\n- Feel comfortable handling the phone and personally interacting with customers when necessary\n\n- Provide support to other team members if asked - we’re a start-up which means that we all muddle in and help each other when required. Occasionally you’ll get pulled off to work on other projects.\n\n- Writing and sending informative emails to our customers regarding their ticket orders\n\n- Helping to improve on and develop both our internal help documents, and our external FAQ pages\n\n- If you’re interested, there is also scope to get involved in helping out on our social media channels, marketing efforts and community projects\n\n### Requirements:\n- A Bachelor’s Degree from a four-year college or university\n\n- 1-3 years’ experience in a related field, including internships – previous work in a technology or startup environment a strong plus\n\n- Energetic, passionate, and driven individual who can easily collaborate with others\n\n- Sensitive to varied customer personalities\n\n- Flawless writing skills\n\n- Strong work ethic and sense of ownership\n\n- At ease when communicating with others, whether that’s via email, phone or face to face\n\n- Dedicated to team and personal success\n\n- Flexible and adaptable in a fast workplace environment\n\n- Comfortable taking initiative and making decisions independent of others\n\n### Big plus if you have:\n- Knowledge of ticketing and/or live music experience\n\n- Knowledge of social media use for customer service\n\n- Previous experience with a customer help system\n\n### Compensation:\n- Competitive salary\n\n- Employee stock options\n\n- Employer-matched 401(k) plan\n\n- Generous paid time off\n\n- Above-market medical, dental, vision and life insurance","publish_date":"2016-01-25"},{"feature":"true","link":"jobs/shopify.html","location":"Anywhere in British Columbia, Canada","published":"Jan 21","id":18,"title":"Shopify Customer Success Agent (aka: Guru)","body":"\nGooo-Rooo?\n\nShopify is a leading cloud-based, multichannel commerce platform designed for small and medium-sized businesses. Merchants can use the software to design, set up and manage their stores across multiple sales channels, including web, mobile, social media, brick-and-mortar locations, and pop-up shops. Shopify currently powers over 200,000 businesses in approximately 150 countries, including: Tesla Motors, Budweiser, Google, Wikipedia, LA Lakers, GoldieBlox, and many more.\n\nAbout the Role:\n\nThe Guru team at Shopify supports shop owners around the clock on the telephone, email and chat. With over 200,000 shops, we are looking for talented people to join our growing remote Guru team.\n\nOur Gurus are well equipped to handle any questions that our merchants might have. Sales, online marketing, billing, technical issues, third party apps and design are just some examples of the types of questions you will get. Check out our 1000+ pages of support documentation for a taste of what you will be asked: http://docs.shopify.com/\n\nThis role is very challenging and incredibly fast paced, yet rewarding. You’ll get hands-on experience working with online businesses.\n\nThere are no scripts; we want you to be yourself and work with the merchant to find solutions and help them grow their business.\n\nIt is a full-time position with 40 hours/week and some work on the weekends.\n\nAbout you:\n\nThis is an entirely remote position, so you’ll be working from home. You will need a DSL or Cable internet connection.\n\nYou are available for non standard (9-5) hours with weekend work. Everyone joining in British Columbia covers 4pm - 12 am PT.\n\nYou are passionate about customer success and helping the team.\n\nYou have a great sense of humour, have a strong desire to learn, and are a great communicator.\n\nYou are detail oriented.\n\nYou are proactive and own issues from beginning to end.\n\nMost importantly, you are resourceful and really enjoy problem solving.","publish_date":"2016-01-21"},{"has_chat":"true","feature":"true","link":"jobs/articulate.html","location":"Telecommute (U.S. only)","published":"Jan 18","id":19,"title":"Articulate Senior Technical Support Engineer","body":"\n<p>Do you want to help customers solve their most challenging technical problems at an organization that invests in making customer support amazing? If so, we’d love to hear from you! We’re looking for a Senior Technical Support Engineer to join our fantastic team.</p><p><strong>You’re an ideal candidate if:</strong></p><p>You’re a sharp, knowledgeable technician with charisma and a genuine love for people that lets you disarm your angriest customer. You’re a recognized leader and escalation point for our support, sales, and community teams. You’re passionate about owning and resolving cases yourself, but humble enough to know when to ask for help. And you’re flexible, collaborative, open to feedback, proactive, and able to manage projects from start to finish.</p><p><strong>Your responsibilities:</strong></p><ul><li>Take on our customers’ most challenging technical problems after Tier 1 and Tier 2 have exhausted all other options</li><li>Delight the customer, and remind them why they chose Articulate</li><li>Coach and lead other team members, always demonstrating patience and empathy</li><li>Be proactive and deadline-driven, manage your time well, be organized, and propose creative solutions</li><li>Reproduce and isolate bugs before involving QA</li><li>Write high-quality bug reports</li><li>Help the engineering team prioritize bugs</li><li>Test products when asked, and act as a customer advocate</li><li>Participate in occasional (no more than quarterly) after-hours support for customers in other time zones</li><li>Write detailed client instructions and contribute toward the Articulate knowledge base</li><li>Use Salesforce to record, track, and close cases</li><li>Be so knowledgeable, versatile, and humble that you can back up every other role on the team</li></ul><p><strong>Your ideal skills/experience:</strong></p><ul><li>5 years of technical support experience with desktop software applications and web tools</li><li>Extensive experience troubleshooting Windows, Office, and a wide variety of Windows applications; experience with Articulate software is a plus, but not a must</li><li>Hands-on experience creating and editing multimedia, including audio, video, and images</li><li>Innate understanding of web technologies, including all major browsers, FTP, email delivery, Adobe Flash, accessibility tools, and challenges such as low bandwidth, proxies, filters, and firewalls</li><li>No fear of logs—you can jump in and attempt to decipher any log file from any application</li><li>Basic understanding of HTML and of the AICC, SCORM, and Tin Can API specifications</li><li>Unafraid of jumping into tense situations, with a love for turning frustrated customers into successful advocates</li><li>You love to help everyone: customers, peers, and the neighbor down the street</li><li>Excellent oral and written communication skills; able to convey complex concepts concisely and clearly to customers with professionalism, empathy, and excellent grammar and spelling</li><li>Experience working from home or in an environment with a lot of autonomy</li></ul><p><strong>Work life:</strong></p><p>Articulate is a highly successful company with an empowering work culture. We give you autonomy over when, where, and how you work. We value productivity and results, not corporate B.S. And we keep our eyes fixed on our customers, helping them succeed in every way we can. We also believe that, to reach our diverse audiences, we need different viewpoints and voices in our midst. We welcome and celebrate differences and are committed to building a diverse team.</p><p><strong>About Articulate:</strong></p><p>Articulate is a nimble software company focused on building incredible e-learning software, community, and content. We have 48,000+ B2B customers, including 93 of the Fortune 100 companies and 19 of the 20 top-ranked universities. Our customers trust us because they know we’re just as passionate about them as they are about us. Learn more about what it’s like to work at Articulate at www.articulate.com/careers.</p><p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>","publish_date":"2016-01-18"},{"link":"jobs/fleetio.html","location":"Birmingham, AL / Remote","published":"Jan 13","id":20,"title":"Fleetio Customer Experience Rep","body":"\n<p>As a Customer Experience Rep for <a href=\"https://www.fleetio.com/\">Fleetio</a>, your job is to support our customers and enable their success. This is a demanding but rewarding role that requires a broad skill set. You’ll be directly responsible for keeping Fleetio’s&nbsp;customers happy and productive. You will also work with the product teams to test new features and provide feedback based on customer conversations.</p>\n<p>Companies around the world rely on Fleetio to manage their fleet operations. Your job is to ensure that Fleetio’s customers have the best customer service experience possible.</p>\n<p>We take customer service seriously. This is a position we consider essential to the company’s success. Be sure to mention coffee in your cover letter so we know you actually read this.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Handle inbound customer requests via email and phone (90% email, 10% phone)</li>\n<li>Quickly resolve customer inquiries with helpful, personalized responses</li>\n<li>Identify, reproduce and document bugs for the product teams</li>\n<li>Assist the product teams by testing new features and bug fixes</li>\n<li>Spot trends in customer issues and communicate to product teams</li>\n<li>Write documentation and contribute content to our <a href=\"http://help.fleetio.com/\">Help Center</a></li>\n<li>Create screencasts (video tutorials) for specific features and functionality</li>\n<li>Monitor and report on support metrics and KPIs and suggest improvements</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Ability to work 8am – 5pm, CT, Monday through Friday</li>\n<li>Genuine empathy for customers, and desire to make them feel happy and understood</li>\n<li>Passion for exceptional customer service and appreciation for its role in a company’s success</li>\n<li>Excellent writing and communication skills</li>\n<li>Resourceful and determined, yet not afraid to ask for help</li>\n<li>Natural troubleshooting skills</li>\n<li>Serious attention to detail</li>\n<li>Excited by technology and its ability to make you more productive</li>\n<li>Prior experience doing email-centric customer support for a web application is highly desirable</li>\n<li>College degree or equivalent professional experience preferred</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>100% coverage of health and dental insurance</li>\n<li>401(k)</li>\n<li>Competitive salary and meaningful equity</li>\n<li>Open PTO policy</li>\n<li>Mac laptop and whatever tools you need</li>\n</ul>","publish_date":"2016-01-13"},{"link":"jobs/supercell.html","location":"Helsinki, Finland","published":"Jan 11","id":21,"title":"Supercell Player Support Specialist","body":"\n<p>Want to work in one of the most disruptive Customer Support organizations on the planet? Then maybe it’s time for you to get ready for the north and join us here in our HQ in Helsinki, Finland.</p>\n<p>We are looking for a Player Support Specialist to reinforce our multicultural team. The person we are looking for is a gamer with a strong background in customer support and a unicorn-like personality who wants to push the boundaries of support for mobile games and beyond.</p>\n<p>You are self-driven and hands-on? You can take decisions on a day-to-day basis independently? You don’t mind getting your hands dirty and address our players on individual level? Great, we have a team structure with minimal hierarchy and no red tape where the only limits to what’s achievable are set by your imagination. If you want to make a difference for millions of players around the globe every single day, this might be the right place for you.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Become an expert at Supercell games and our internal tools</li>\n<li>Be a point-of-contact for escalations, content questions and ad-hoc decisions and requests for our local outsourcing partners and our other offices</li>\n<li>Use data to support the development of processes and policies</li>\n<li>Support the internal live game liaisons with their day-to-day requests</li>\n<li>Apply your knowledge to current and new Player Support projects</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Excellent verbal and written English skills</li>\n<li>Previous experience (2–3 years) in a customer support role</li>\n<li>Team player with strong problem solving and conflict management skills</li>\n<li>Empathic and culturally aware</li>\n<li>Passion for video games and mobile applications</li>\n<li>Ability to travel frequently (other Supercell offices and partners)</li>\n</ul>\n<h3>Nice to Haves</h3>\n<ul>\n<li>Fluent in French, Italian, German, Spanish, Portuguese, Japanese, Chinese, Korean, Turkish, Arabic, Dutch, Russian, Finnish or Klingon</li>\n<li>Passion for one or multiple Supercell games Experience working in multicultural environments</li>\n</ul>\n<h3>Supercell Offers</h3>\n<ul>\n<li>A first-row view into one of the most successful game companies in the world</li>\n<li>Opportunity to work with a team of gaming veterans, top talent, and passionate gamers</li>\n<li>Easy-going, enthusiastic, open and at the same time a very results-driven culture</li>\n<li>Competitive compensation</li>\n<li>Smartphone, tablet, laptop/workstation of your own choice</li>\n<li>Industry leading benefits</li>\n<li>Amazing co-workers</li>\n</ul>","publish_date":"2016-01-11"}]