[{"link":"jobs/learndash.html","location":"U.S. (Remote)","published":"Jul 26","id":1,"title":"LearnDash Customer Service Specialist","body":"\nDo you enjoy the satisfaction of helping someone solve a problem?\n\nAre you the \"go-to\" person for tech support from friends and family?\n\nWould you like to get paid to help people?\n\nWe are seeking a passionate and friendly person to join our team as a Customer Service Specialist where you'll get the opportunity to make a real impact on people's lives and businesses.\n\nGreat performance is rewarded with increases in both responsibility and compensation. Expenses paid travel & education opportunities also provided for those interested!\n\n\n### CUSTOMER SERVICE SPECIALIST RESPONSIBILITIES:\n\nProvides technical support and guidance to users by researching and answering questions; troubleshooting problems; maintaining & updating documentation; addressing pre-sales inquires.\n\n\n### CUSTOMER SERVICE SPECIALIST DUTIES:\n\n- Provides answers to clients by identifying problems; researching answers; guiding client through corrective steps.\n- Improves client references by writing and maintaining documentation.\n- Participates in development of client training programs by identifying learning issues and recommending improvements.\n- Improves system performance by identifying problems; recommending changes.\n- Updates job knowledge by participating in educational opportunities; maintaining personal networks.\n- Responds to pre-sales inquiries.\n- Avoids legal challenges by monitoring compliance with terms of service agreements.\n\n### SKILLS & QUALIFICATIONS\n\nStrong WordPress Competency is a Must, Customer Service Acumen, Basic Proficiency of CSS & HTML, Basic PHP Proficiency Preferred.\n\nBachelors Degree Preferred but not required given relevant experience.","publish_date":"2017-07-26"},{"link":"jobs/airtime.html","location":"Brooklyn, NY","published":"Jul 25","id":2,"title":"Airtime Community Moderator, Second Shift","body":"\nWe’re looking for a Community Moderator. This is a full-time position based in Brooklyn, NY reporting into the Airtime Marketing team.\n\nIn this role, you’ll wear many hats. Flexibility and a willingness to quickly move between projects and tasks are key. We’re looking for a people person who is all about helping others. You must also be comfortable with moderating content that may be sexual, violent, or disturbing in nature.\n\n### Primary responsibilities:\n- Support -- replying to our users’ customer service inquiries and filing bug reports.\n- Content moderation -- investigating and actioning reports of inappropriate content.\n- You’ll also have the opportunity to follow your interests with project work in this role, in addition to the two ticket-focused tasks above. You may be working with the User Insights team to create surveys, schedule interviews, and craft other outgoing communications for users. You may work to create new spaces on our app around your own personal interests, whether that’s knitting, watching Empire, skydiving, sandwiches, Drake, otters, anything! Sky’s the limit.\n\n### REQUIREMENTS:\n- Excellent judgment.\n- Gumption.\n- Comfort viewing content that may be inappropriate for our users.\n- Strong writing skills.\n- A passion for problem-solving.\n- Availability to work evenings (4PM -12AM EST) Wednesday - Sunday.\n\n### PLUSSES:\n- Prior experience working in a customer support or Trust & Safety role.\n- Joining Airtime means exposure to the inner workings of a fast-paced startup. You’ll be part of a motivated team of innovators who’ve previously worked for companies like Netflix, WeWork, and Facebook.\n\n### BENEFITS & PERKS\n- Competitive compensation\n- $0-premium health, dental, & vision insurance\n- $100/mo pre-tax flex money\n- Equipment - whatever you need to succeed\n- Flexible time-off beyond the company-wide holiday periods\n- Annual offsites, monthly team outings and team lunches\n- Occasional travel between the Silicon Valley and New York City offices\n- Snacks & coffee & beer & WeWork benefits galore!\n- Dog friendly!","publish_date":"2017-07-25"},{"link":"jobs/expensify-london.html","location":"London","published":"Jul 25","id":3,"title":"Expensify Success Coach","body":"\nAs a Success Coach, you’ll support customers day in and day out, with the understanding that a product-driven company grows nowhere without a happy customer base. You’re on the front lines to interact with our customers via email and chat predominantly, but we also sprinkle in phone calls and the occasional in-person visit.\n\n### About The Job\n\nAs a Success Coach, you’ll focus on making sure that our customers are successful in using Expensify. You’ll do this by applying a deep understanding of our customers, their processes, our product and the systems with which we integrate. Our customers come in all shapes and sizes and we do our best to make them as happy as possible (read: phenomenal support is the name of the game). When our product changes, you’ll be the point of contact for our customers via email, in product announcements, phone calls and (occasional) in-person visits.\n\n### About You\nJoining our team means you enjoy a fast-paced and challenging work environment. You thrive as an individual contributor and you know how to get shit done. Still wondering whether this is the right role for you? The most successful candidates can:\n\n- Manage time and prioritize efficiently. Things change all the time, especially with the product.\n- Learn from peers across teams in an informal fashion. After all, no one is an expert at Expensify and we're all learning things as we go.\n- Do what it takes to bring the most value to the company everyday, even if that value is created in a repetitive and not so glamorous way. #oneteamonedream\n- Say “no” and communicate that things won’t always change “now”. This helps to keep our product simple and user-friendly.\n- Deftly articulate complex thoughts. One moment you may be having a technical discussion with an engineer about a bug or product flow that’s confusing for our customers, before quickly moving on to working directly with a non-technical customer to fix a problem.\n- Bonus: Some general understanding of the accounting process, Not required!\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n- Describe a memorable experience - whether at work or in your personal life - working with a client/customer. What issue did they face, and and how you were able to address their concerns? If you weren't successful addressing their concerns, why not?\n- Pretend you had a month to do whatever you wanted. What would you do? And would this be sufficient time to accomplish the goals you set out to achieve?\n- If you were tasked with analyzing customer behavior and recommending product-driven solutions, how would you approach that problem?\n- What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n- How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.\n\nResume not your thing? That’s great, we don’t really read them anyways! Forward your responses to the questions to jobs@expensify.com. We're excited to hear from you!","publish_date":"2017-07-25"},{"feature":"true","link":"jobs/wistia.html","location":"Cambridge, MA","published":"Jul 25","id":4,"title":"Wistia Director of Customer Happiness","body":"\nWistia is your friendly neighborhood video platform. Create, host, share, and measure beautiful videos like the human you are. We work hard to find easy, delightful solutions to complicated problems. The Customer Happiness Team embodies this work by tackling the issues our customers encounter with elegance and grace; we build relationships with our customers, who are marketing, sales, support, video production, and HR teams from companies of all shapes and sizes. \n\nAs the Director of Customer Happiness, you'll report to the COO and be responsible for leading our team of Customer Champions. While the Champs take care of reactive email support, they also impact the customer experience in other creative ways, like creating and managing self-service resources and improving the customer experience by triaging and fixing issues in the product. Put simply, you'll enable a deeply creative team to provide our customers with exceptionally creative support.\n\n### Your Typical day includes:\nSurprise! There <i>is</i> no typical day. That said, you'll often find yourself working closely with the team discussing things like:\n\n- How to improve our reactive support strategy by utilizing data and creativity\n- Team projects beyond the inbox, which are designed to positively impact the customer experience and help Wistians grow\n- How to support Customer Champions growth and development, a core part of the employee experience\n\n### This job might be for you if you have\n- Strong empathy for customers and excitement for growth\n- A love for digging deep into problems of all kinds, and for making processes as effective, intuitive and streamlined as they can be\n- Demonstrated desire for continuous learning & development\n- Enthusiastic and creative leadership skills, with the ability to inspire others\n- Top notch communication and presentation powers\n- Proven expertise managing people and teams\n- Several years' experience leading customer-facing organizations, ideally in a Saas business\n- Experience scaling an organization and expanding overall customer experience\n\n### Upon coming on board, you can expect to: \n\n### First three months:\n- Gain an understanding of Wistia’s business, goals, and strategic objectives.\n- Learn not only the fundamentals of Wistia’s products and the range of our customers’ goals and use cases, but also how those things manifest themselves in support.\n- Learn how to navigate an evolving organization to collaborate and get things done.\n- Immerse yourself in the Customer Happiness team, learning its strengths and its opportunities for improvement and increased success.\n- Develop initiatives that can meaningfully impact Wistia's support experience\n- Develop an understanding of the customer support experience by getting first hand experience in our inbox and working directly with customers.\n\n### Three to twelve months:\n- Identify and manage initiatives to achieve consistent excellence in key metrics, including reducing customer contact rate, and increasing customer satisfaction scores and support-specific NPS\n- Ensure our support approach represents our values and mission to make business more human, and constantly elevate the level of customer experience\n- Explore new avenues for customer support (today, we primarily focus on email)\n- Work closely with the product, engineering, marketing and sales teams to translate customer feedback into strategic initiatives\n- Develop Customer Champs, set clear expectations and success benchmarks for growth, and curate the resources and support to help them learn, improve, and succeed\n\n### Your success will be measured by:\n- The metrical proxies of Customer Happiness: customer satisfaction ratings from support interactions, and support-specific NPS.\n- Making the best support be no support, aka lowering contact rate (the percentage of our customers who need reactive support in any period).\n- The consistent delivery, by the whole Customer Happiness team, of an effective and efficient support experience that represents Wistia’s values and mission.\n- Leading a team that continually learns and develops, with each Champ moving towards mastery in technical support or customer education, or developing skills to support priority initiatives within Wistia\n- Regular improvement in the Customer Happiness team’s internal employee NPS.\n\nIf this sounds exciting to you, we hope you'll get in touch! We're profitable, growing, and have raised only seed money, so we have the luxury of being able to invest in whatever will best serve the long-term value of the company. We know the biggest investment we can make is in our employees, so we provide:\n\n- A competitive salary and stock options package\n- 401k with 3% company contribution, regardless of whether you make contributions\n- Flexible hours\n- Fully paid healthcare coverage for you and your family (including dental) and a healthcare FSA\n- Up to 12 weeks paid family leave\n- Untracked vacation and sick leave (Most employees take about four weeks of vacation)\n- Transportation subsidies\n- Financial support for continuing education, professional development and sponsorship for conferences\n- A convenient office just south of Central Square in Cambridge, MA. We're right on the Red Line, surrounded by great restaurants, parks, and even a dog park.\n- Plenty of office snacks and beverages, and a weekly catered team lunch.\n- Annual winter ski trip (with plenty of non-skiing activities)\n- Annual summer pond festival (lounging, water skiing, volleyball, etc)\n\nWe are working hard to make Wistia an inclusive and diverse place where everyone feels <b>happy, fulfilled, respected, comfortable, and welcome</b>. We want you to have fun here! Come join us and let’s build a great company and product together.A competitive salary and stock options package","publish_date":"2017-07-25"},{"feature":"true","link":"jobs/fleetio.html","location":"Birmingham, AL or REMOTE","published":"Jul 13","id":5,"title":"Fleetio Senior Support Specialist","body":"\nAs a Sr. Customer Support Specialist at Fleetio, your job is to support customers who use our software and ensure they have the best customer service experience possible. You’ll be directly responsible for keeping our customers happy and productive.\n\nThis role includes responding directly to customer questions on frontline support as well as troubleshooting escalated technical issues and potential software bugs. You'll triage incoming escalations and perform due diligence to ensure steps to reproduce, then work with the Product Management and Engineering teams to convert valid escalations into bugs/tasks for the product backlog. You will also enforce accountability between Support, Product, and Engineering teams on escalations, lobbying on customers' behalf and keeping them in the loop.\n\nYou'll also be responsible for producing and maintaining articles in our Help Center. This includes technical documentation, FAQs for common issues and training guides. You will even produce screencast videos to better explain how certain features work.\n\nCompanies around the world rely on Fleetio to manage their fleet operations and monitor their drivers. We take customer service seriously and consider this role essential to the company’s success. Be sure to mention coffee in your application so we know you actually read this.\n\n### Responsibilities\n- Handle inbound customer requests via email and phone (90% email, 10% phone).\n- Troubleshoot issues that require technical knowledge to solve, including mobile app issues, integration issues, and data import errors.\n- Triage escalations and ensure detailed steps to reproduce, then work with the Product Management and Engineering teams to convert valid escalations into bugs/tasks for the product backlog.\n- Assist the Product and Engineering teams by testing new features and bug fixes.\n- Spot trends and provide metrics on customer’s issues and bugs that help make informed, data-driven decisions around product enhancements and features.\n- Write documentation and contribute high-quality content to our Help Center and internal knowledge base.\n- Create screencast videos for specific features and functionality.\n\n### You’ll also:\n- Serve as a mentor and help guide to other Fleetio team members.\n- Develop deep product knowledge and serve as a technical expert on Fleetio’s product offerings.\n- Help design product-based training for Support including functionality overviews, common issues, and troubleshooting techniques.\n- Advocate for new tools to facilitate troubleshooting & support.\n\n### REQUIREMENTS\n- Ability to work 9am - 6pm, CT, Monday through Friday\n- Genuine empathy for customers, and desire to make them feel happy and understood\n- Passion for exceptional customer service and appreciation for its role in a company’s success\n- Excellent writing and communication skills\n- Great interpersonal and teamwork skills; you’re naturally a helper\n- Resourceful and determined, yet not afraid to ask for help\n- Natural troubleshooting skills, deep analytics and research skills, and excellent creative and critical-thinking skills\n- Deep curiosity and strong problem-solving skills\n- Moderate to advanced technical aptitude, excited by technology and its ability to make you more productive, and a desire to continue to expand your technical knowledge\n- General understanding of how web apps and mobile apps work\n- Some HTML experience\n- Prior experience doing email-centric customer support for a web application is desirable\n- College degree or equivalent professional experience preferred\n\n### BENEFITS\n- 100% coverage of health and dental insurance\n- 401(k)\n- Meaningful company equity\n- Book program and professional development budget\n- Mac laptop and whatever tools you need","publish_date":"2017-07-13"},{"has_chat":"true","link":"jobs/customerio.html","location":"Remote","published":"Jul 12","id":6,"title":"Customer.io Technical Support Engineer (Deliverability Specialist)","body":"\nHello, future addition to Customer.io! We’re looking forward to getting to know you better, but you probably want to know what you’re getting yourself into. You can check out our careers page, or read on.\n\nAt Customer.io, our mission is helping businesses talk like people. Today, we do this with messaging software that allows businesses with large user-bases to send targeted, more relevant communication at scale.\n\n### A day in the life of a Deliverability Specialist\nA Deliverability Specialist at Customer.io helps new and existing customers get up and running in our product, diagnose tricky situations related to email deliverability, and achieve their business goals. Our customers are core to everything we do (it’s in our name!) and a Deliverability Specialist on our Technical Support Team has contact with more customers than anyone else in the company.\n\n### What skills will you bring to the table?\nFirst and foremost, we’re looking for someone with experience diagnosing and solving email deliverability issues. We’re also looking for some customer support experience, responding mainly via email within a remote/async environment. Ideally you’ve worked with or supported email marketing/business communication tools, too. You should be comfortable with basic programming concepts (API, variables, if-else statements, loops, etc.). You’re willing to work in US Eastern hours on a regular basis.\n\n### Your contributions to the team will include:\n- being the expert on the team for any deliverability questions or problems our customers may have\n- identifying ways deliverability rates can be higher including working with partner sites and services to mitigate the risk of any future blacklisting.\n- establishing tools that can monitor the list of our IP addresses to proactively head off any blacklist issues.\n- building processes and procedures to ensure the entire team can work seamlessly to help our customers when deliverability issues arise.\n\nBeyond your focus on deliverability, you’ll develop deep product, systems and customer knowledge by supporting our customers via email.  You’ll also work on internal and external documentation and have regular touch points with our Product and Development teams to discuss feature requests, usability issues and user scenarios. You’ll bring your passion for customers and their problems to advocate for product improvements and provide insight that will help us make sure we build the right thing.\n\nIn the long run there are opportunities to apply that to automate processes and create internal tools or to join our Customer Success team which helps our high revenue customers make the most of our product. We have many new features to build and ideas to implement, so there will be plenty of exciting challenges ahead.\n\nToday the Technical Support team is powered by Help Scout for tickets, Github Issues for bug tracking and Zapier to help automate some of our support processes.\n\nAlthough, we mostly interact with each other through Basecamp and Slack and value focused work, we’re not afraid to jump on a Screenhero pairing session or a video call to clarify customer scenarios or share tips on how to troubleshoot issues better.\n\n \n\n### You’ll be joining a team of 4 including:\n<b>Wendy Teo</b> - Director of Technical Support - lovingly referred to as unicorn because she’s fantastic AND elusive (we rarely get to see her whole face)\n\nAnd our Technical Support Engineers:<br/> \n<b>Brandi Young</b> - resident Texan, considers eminem her guilty pleasure and is perfectly introverted and awkward.\n\n<b>Wiley Jenkins</b> - from coffee stand to tech, and most recently, Customer.io; Wiley will make you smile.\n\n<b>Dan Schales</b> - Star Wars expert, enjoying family life in Washington State; Dan’s the support(man).\n\nThe folks above are an incredible group, and we’re excited for you to meet them. If you’re still reading this, then you’ll share some qualities with them like:\n\n- You love technical problem solving\n- You enjoy helping others with your technical knowledge and take pride in your work.\n- You see every support ticket as an opportunity to improve the customer experience.\n- You take ownership of delivering results and get satisfaction from getting things done.\n- You’re passionate about learning new things.\n- You’re not afraid to ask questions if you’re confused about how something works.\n- You understand written communication is not always perfect and assume the best intentions during interactions with customers and your team. Empathy is one of your strongest attributes.\n \n### Why should you work with Customer.io?\nWe want to enable you to do your best work, and this is how we aim to do that—\n\n<b>Salary:</b> We’re offering $70,000 USD for this position in the company.\n\n<b>Equity:</b> You’ll own a piece of the company. It's not a get-rich-quick deal, but if you stay around for a while, we're planning to be a long-lasting company, and your piece of it may be a nice bonus.\n\n<b>Big impact:</b> Our team is small, but growing quickly. The work you do will materially impact how successful we are as a company, both with our product and our culture.\n\n<b>Great tools:</b> Everyone in the company has a budget for a great computer, motorized standing desk, Steelcase Leap office chair, external monitor, and anything else you'd like to get your job done.\n\n<b>Health benefits:</b> We pay 100% of your premiums for medical, dental and vision.\n\n<b>Paid Parental & Medical Leave</b> - including adoption\n\n<b>Retreats:</b> We want everyone in our company to connect in person whenever possible, so we get everyone together once a year. We've had retreats in Barcelona, Romania, and Hunter Mountain, NY. We’re going to Iceland in September!\n\n<b>Vacation:</b> Rest and recuperation are important. We offer unlimited paid time off with a two week minimum per year.\n\n### Diversity at Customer.io\nAt Customer.io, we’re committed to building a diverse environment, and encourage minority applicants. So far, we have team members in Scotland, Germany, Canada, and all over the US. Our CEO and CTO grew up in Singapore and Arkansas respectively, but met in New York City. Our company culture is always evolving; people from different backgrounds bring valued perspective and thoughtfulness to the work that we do and the culture we foster.\n\nCustomer.io provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Customer.io complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Basically, we follow the law, but also like you for who you are!\n\n### Intrigued? Talk to us!\nApply below with your resume, and make sure you tell us why you’re interested in the position! We’ve added a few questions that will also help us understand how you think.","publish_date":"2017-07-12"},{"feature":"true","link":"jobs/solarwinds-cloud.html","location":"Austin, TX","published":"Jun 16","id":7,"title":"SolarWinds Cloud (Librato, Papertrail, & Pingdom) Product Advocate / Technical Account Manager","body":"\nAs a Product Advocate, you’ll use technical experience, product knowledge, and sales skills to help every customer get the most value from SolarWinds’ Monitoring Cloud (SaaS) products:\n\n- Librato (infrastructure monitoring): https://www.librato.com/\n- Papertrail (log-centric troubleshooting): https://papertrailapp.com/\n- Pingdom (Web performance): https://www.pingdom.com/\n- TraceView (application performance monitoring) : https://traceview.solarwinds.com/\n\nIf you’ve made a restaurant reservation, collaborated in a text chat room, or purchased a plane ticket, you probably used a service which depends on SolarWinds Monitoring Cloud.\n\n### Why is this role important?\n\nYour customers, many of whom are fellow engineers, will come to see you as a trusted peer. You’ll be instrumental in figuring out what types of technical account management actually help, why, and how to scale it. This is an incredibly fast-growing market. As the SolarWinds Monitoring Cloud thrives and expands in the coming years, you’ll have contributed significantly to that growth.\n\n### Why is this position unique?\n\nBig company benefits and customer base, startup flexibility. As Product Advocate, you’ll:\n\n- be the primary contact for your customers, not just a sales engineer. If you’re equally adept at cloning a git repo as you are at explaining why a product is valuable enough to pay for, this role is for you.\nhave an unusual amount of control over which actions may be worth your time. We’ll be brainstorming, selecting, and testing these together.\n- see the impact of your work every day – not in 0.1% of customers, but in 10% or 30% of customers. If something is demonstrably effective, you’ll help implement or share it widely.\n- sell products that you’d actually use yourself. Life is too short to represent a product you don’t care about.\n- sell products which already have thousands of satisfied customers.\n- interact with customers using newer technologies like Docker, Go, React, and Kubernetes as well as established products like PostgreSQL, nginx, and Heroku.\n\n### Qualifications\n\n- Technical expertise, so you can be useful to software developers and systems engineers. Perhaps you’ve been a sales engineer, customer success engineer, technical account manager or thrived in a “dev bootcamp” program. Maybe you’re writing code now and want a change.\n- Able to confidently explain that something costs money (and why!), and ideally, past experience in a sales role. If you have a demonstrated interest in business (like sales, entrepreneurship, or finance), even as a hobby, we want to hear.\n- You’re great at explaining complex ideas in writing. This position is 80% email or text, 20% interactive (voice or video)\n- Able to confidently give a screenshare-style product demo that attendees enjoy\n- You value the chance to help define the process. In past roles, maybe you’ve had strong opinions about how sales could do a better job or how you could do a better job if you were the sales rep.\n- Nice to have: Experience interacting with engineers on a daily basis (such as by selling a product to engineers or supporting a product used by engineers), and/or working with a distributed team (such as in Slack)\n\n### Examples of technical expertise\n\nPart of this job is identifying customer-specific use cases and opportunities where these products can be more helpful and thus get used more. These are usually technical conversations. To add value, you’ve probably done at least 1 of these 5 tasks or something very similar:\n\n- modified a Ruby, Python, Unix shell, or other script/code to do what you want or run correctly (or, of course, written your own)\n- cloned a git repo and committed a change\n- used a somewhat advanced command-line tool like tcpdump, strace, ntop, iptables, or awk\n- booted a Docker container or EC2/Xen instance\n- configured a daemon like rsyslog or sshd\n\n### Want to stand out?\n\nSign up for a SolarWinds Monitoring Cloud product (like Librato, Papertrail, or Pingdom), then write an email or record a screencast demo for an imaginary customer. In the email or screencast, explain why this product is a better fit than competitors.","publish_date":"2017-06-16"}]