[{"feature":"true","link":"jobs/expensify-london.html","location":"London","published":"Mar 18","id":1,"title":"Expensify Success Coach","body":"\n### Your Mission, Should You Choose to Accept:\n\nExpensify prides itself on solving real-world problems with a team of top-notch product experts. We are reinventing the way people look at expense reports by automating not just the expense report, but the entire business trip. Joining our team means you are helping us fight the good fight against expense reports that suck!\n\n### About The Job\n\nAs a Success Coach, you’ll focus on making sure that our customers are successful in using Expensify. You’ll do this by applying a deep understanding of our customers, their processes, our product and the systems with which we integrate. Our customers come in all shapes and sizes and we do our best to make them as happy as possible (read: phenomenal support is the name of the game). When our product changes, you’ll be the point of contact for our customers via email, in product announcements, phone calls and (occasional) in-person visits.\n\n### About You\n\nJoining our team means you enjoy a fast-paced and ever changing work environment. You’re fearless and relish in big challenges, working within the grey and making it concrete and clear. You’re entrepreneurial, you love developing relationships with others and helping them solve complex problems -- all with the ease of a trapeze artist! You’re a digital maven and love interacting with customers through email, in-product, and sometimes over the phone. Because Expensify is a simple product that connects to a variety of deceptively complex financial systems, you’re also someone who is comfortable wading in the complicated waters of accounting and simplifying it for our customers.\n\n### For the best possible fit, we are looking for someone who can:\n- Deftly articulate complex thoughts. One moment you may be having a technical discussion with an engineer about the product implications of a new feature, before quickly moving on to working directly with a non-technical customer to fix a problem. The ideal candidate will be able to clearly articulate themselves in each scenario.\n- Maintain customer relationships and problem solve on their behalf by providing clear and friendly written (and verbal) communication.\n- Manage time and prioritize efficiently. Things move quickly in this environment and it’s crucial that you are able to react to new information and re-prioritize accordingly.\n- Learn from peers across teams in an informal fashion. After all, no one is an expert at Expensify and we're all learning things as we go. We also love anyone who's able to effectively train colleagues as we grow the team.\n- Do what it takes to bring the most value to the company day to day, even if it may be sometimes repetitive and not so glamorous. #oneteamonedream\n- Support customers day in and day out, with the understanding that a product-driven company grows nowhere without a happy customer base. Make no mistake, this role is squarely grounded in support, no matter the customer size.\n- Say “no” and communicate that things won’t always change “now”. This helps to keep our product simple and user-friendly, but it is only possible with in-depth product knowledge and a deep understanding of the problem that the customer is trying to solve.\n- Bonus: Some general understanding of the accounting process, Not required!\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n- Describe a memorable experience - whether at work or in your personal life - working with a client/customer. What issue did they face, and and how you were able to address their concerns? If you weren't successful addressing their concerns, why not?\n- Pretend you had a month to do whatever you wanted. What would you do? And would this be sufficient time to accomplish the goals you set out to achieve?\n- If you were tasked with analyzing customer behavior and recommending product-driven solutions, how would you approach that problem?\n- What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n- How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.\n\nResume not your thing? That’s great, we don’t really read them anyways! Forward your responses to the questions to jobs@expensify.com. We're excited to hear from you!","publish_date":"2017-03-18"},{"feature":"true","link":"jobs/expensify-portland.html","location":"Portland, OR","published":"Mar 18","id":2,"title":"Expensify Success Coach","body":"\n### Your Mission, Should You Choose to Accept:\n\nExpensify prides itself on solving real-world problems with a team of top-notch product experts. We are reinventing the way people look at expense reports by automating not just the expense report, but the entire business trip. Joining our team means you are helping us fight the good fight against expense reports that suck!\n\n### About The Job\n\nAs a Success Coach, you’ll focus on making sure that our customers are successful in using Expensify. You’ll do this by applying a deep understanding of our customers, their processes, our product and the systems with which we integrate. Our customers come in all shapes and sizes and we do our best to make them as happy as possible (read: phenomenal support is the name of the game). When our product changes, you’ll be the point of contact for our customers via email, in product announcements, phone calls and (occasional) in-person visits.\n\n### About You\n\nJoining our team means you enjoy a fast-paced and ever changing work environment. You’re fearless and relish in big challenges, working within the grey and making it concrete and clear. You’re entrepreneurial, you love developing relationships with others and helping them solve complex problems -- all with the ease of a trapeze artist! You’re a digital maven and love interacting with customers through email, in-product, and sometimes over the phone. Because Expensify is a simple product that connects to a variety of deceptively complex financial systems, you’re also someone who is comfortable wading in the complicated waters of accounting and simplifying it for our customers.\n\n### For the best possible fit, we are looking for someone who can:\n- Deftly articulate complex thoughts. One moment you may be having a technical discussion with an engineer about the product implications of a new feature, before quickly moving on to working directly with a non-technical customer to fix a problem. The ideal candidate will be able to clearly articulate themselves in each scenario.\n- Maintain customer relationships and problem solve on their behalf by providing clear and friendly written (and verbal) communication.\n- Manage time and prioritize efficiently. Things move quickly in this environment and it’s crucial that you are able to react to new information and re-prioritize accordingly.\n- Learn from peers across teams in an informal fashion. After all, no one is an expert at Expensify and we're all learning things as we go. We also love anyone who's able to effectively train colleagues as we grow the team.\n- Do what it takes to bring the most value to the company day to day, even if it may be sometimes repetitive and not so glamorous. #oneteamonedream\n- Support customers day in and day out, with the understanding that a product-driven company grows nowhere without a happy customer base. Make no mistake, this role is squarely grounded in support, no matter the customer size.\n- Say “no” and communicate that things won’t always change “now”. This helps to keep our product simple and user-friendly, but it is only possible with in-depth product knowledge and a deep understanding of the problem that the customer is trying to solve.\n- Bonus: Some general understanding of the accounting process, Not required!\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n- Describe a memorable experience - whether at work or in your personal life - working with a client/customer. What issue did they face, and and how you were able to address their concerns? If you weren't successful addressing their concerns, why not?\n- Pretend you had a month to do whatever you wanted. What would you do? And would this be sufficient time to accomplish the goals you set out to achieve?\n- If you were tasked with analyzing customer behavior and recommending product-driven solutions, how would you approach that problem?\n- What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n- How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.\n\nResume not your thing? That’s great, we don’t really read them anyways! Forward your responses to the questions to jobs@expensify.com. We're excited to hear from you!","publish_date":"2017-03-18"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Mar 6","id":3,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2017-03-06"},{"has_chat":"true","feature":"true","link":"jobs/cartstack.html","location":"Remote","published":"Mar 2","id":4,"title":"CartStack Customer Support / Success Hero","body":"\nAs a customer support hero, problem-solving, clear-communication, and empathy are your strongest traits! You will be the voice of CartStack's support channels in your quest to WOW customers by exceeding their expectations :)\n\nCartStack is a growing SaaS startup that offers a cart abandonment solution for e-commerce websites. Our mission is simple…. Be known as the most powerful cart recovery solution in the world! \n\n### Responsibilities you will own:\n- Respond to and resolve customer questions via livechat and email (and every once in awhile, phone)\n- Review new customer's websites to make sure our tracking code (javascript snippet) is integrated properly\n- Pro-actively helping new trialers get onboarded with their new accounts\n- Assist in developing first-class content for our help docs website\n- Review existing customer accounts for any issues or possible account optimizations\n- Reach out to customers about referrals and testimonials\n- Come up with and execute random acts of kindness for our customers :)\n\nThis is a contract to full-time hire position. We would like you to start out with a 90 day contact and if we are a good fit for each other, we'll move into a W2 position + benefits. \n\n### REQUIREMENTS\n- You must be self-motivated, detail-oriented, empathetic, and passionate about about helping people\n- 1 + years of customer support experience (Bonus if it's for a SaaS company!)\n- Foundational understanding of HTML and basic JavaScript\n- Experience working in a remote environment\n- College educated\n- Fantastic writer and communicator\n- Access to high-speed internet\n\n### BENEFITS\n- Remote work and flexible schedule\n- We genuinely care about our employees/contractors and their happiness in their every day work\n- Chance to step in and have a big impact on a growing SaaS company\n- A fun, relaxed company culture (Skype happy hours every month!)\n- Annual team trip\n- We focus on learning and personal/career growth ($100/mo budget for learning / books / courses)\n- Competitive compensation (w/ opportunity for growth related bonuses)\n- When you transition to a full-time employee you would receive health and dental insurance + some other perks\n\nSo, sound like an awesome fit for you? If so, we'd love to hear from you!","publish_date":"2017-03-02"},{"link":"jobs/door-to-door-organics.html","location":"Louisville, CO","published":"Mar 1","id":5,"title":"Door to Door Organics Customer Care Representative","body":"\nWe are seeking full-time and part time Customer Care Representatives to join our highly-valued Customer Care Team. This team member will be friendly and energetic and able to act as the voice of the company in high-stress situations. The right candidate must be extremely motivated, friendly and personable while maintaining flexibility, solving problems quickly, and staying organized under pressure.\n\n### Qualifications:\n- Provides a WOW customer service experience with every interaction\n- Improves company operations by providing customer service input and recommendations to the Customer Care Team Lead\n- Meets and exceeds regular customer service standards\n- Proactively respond to customer service trends\n- Able to make decisions quickly in a fast paced, dynamic environment\n- Excellent oral and written communication skills\n- Demonstrate high proficiency in Microsoft Office, CRM tools, and able to learn new technology systems quickly and with ease while on the job\n- Able to work in a fast paced environment\n- Strong interpersonal skills\n\n### Candidate Requirements:\n- Bachelor's degree or equivalent professional experience\n- Able to work flexible hours including nights and weekends\n- Passionate about helping customers live better and simpler lives\n- 3+ years of experience in a customer service role\n\n### What makes you the right candidate?\nYou LOVE serving others and maintain a passion for great food with local, organic and sustainable foods routinely part of your grocery shopping requirements.\n\nYou aren't afraid to jump into the unknown to fix a problem, and you're good at finding the right resources to help figure it out on the fly.\n\nYou think online shopping is an obvious solution for groceries, and are excited not only to work for Door to Door Organics,, but to shop at Door to Door Organics, too!\n\n### Interested? Please submit:\nA copy of your resume.\nA cover letter explaining why you want to work for Door to Door Organics.\nA brief description of the most difficult customer you served and how you made them happy.","publish_date":"2017-03-01"},{"link":"jobs/github-enterprise-support-au.html","location":"Remote- Australia","published":"Feb 23","id":6,"title":"GitHub Enterprise Support Agent (Remote- Australia)","body":"\nMore and more companies are using GitHub Enterprise, so the support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. We're looking for Enterprise Support Agents to join our Asia Pacific Support team. This role is remote, but candidates must be currently be located in Australia, Japan, or New Zealand and possess legal working authorization.\n\nThe position reports to an Enterprise Support Manager and works closely with other teams and leaders across the company.\n\nGitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events.\n\n### Responsibilities\n- Take in-bound phone support requests\n- Triage incoming support tickets\n- Work collaboratively with other support teams\n- Manage communication around customer tickets\n- Troubleshoot and help solve highly complex support tickets\n- Escalate issues to other support engineers and managers as applicable\n- Work with our Engineering team to prioritize issues and development\n- Work with our Documentation team to improve customer-facing resources\n\n### You Must Have\n- Current legal working authorization and currently residing in one of the following countries: Japan, Australia or New Zealand\n- Knowledge of Linux servers\n- General understanding of how modern web applications work\n- Enthusiasm for working directly with customers\n- Ability to clearly write and orally communicate technical information\n- Ability to review and understand code (Ruby / Bash)\n- Must have a workspace conducive to answering phone calls\n- Prior experience providing technical support\n- Excellent problem solving skills\n- Strong empathy for GitHub users and GitHub Support\n- Stellar English and grammar skills\n\n### Bonus points if you have\n- Technical experience (QA, documentation, systems administration, etc.)\n- Familiarity with Git and GitHub","publish_date":"2017-02-23"},{"link":"jobs/github-enterprise-support-eu.html","location":"Remote- Europe","published":"Feb 23","id":7,"title":"GitHub Enterprise Support Agent (Remote- Europe)","body":"\nMore and more companies are using GitHub Enterprise, so the support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. We're looking for Enterprise Support Agents to join our Europe Support team. This role is remote, but candidates must be currently be located in Austria, Croatia (also called Hrvatska), Denmark, France, Germany, Ireland, Netherlands, Spain, Sweden, Switzerland, or United Kingdom and possess legal working authorization.\n\nThe position reports to an Enterprise Support Manager and works closely with other teams and leaders across the company.\n\nGitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events.\n\n### Responsibilities\n- Take in-bound phone support requests\n- Triage incoming support tickets\n- Work collaboratively with other support teams\n- Manage communication around customer tickets\n- Troubleshoot and help solve highly complex support tickets\n- Escalate issues to other support engineers and managers as applicable\n- Work with our Engineering team to prioritize issues and development\n- Work with our Documentation team to improve customer-facing resources\n\n### You Must Have\n- Current legal working authorization and currently residing in one of the following countries: Austria, Croatia (also called Hrvatska), Denmark, France, Germany, Ireland, Netherlands, Spain, Sweden, Switzerland, or United Kingdom\n- Knowledge of Linux servers\n- General understanding of how modern web applications work\n- Enthusiasm for working directly with customers\n- Ability to clearly write and orally communicate technical information\n- Ability to review and understand code (Ruby / Bash)\n- Must have a workspace conducive to answering phone calls\n- Prior experience providing technical support\n- Excellent problem solving skills\n- Strong empathy for GitHub users and GitHub Support\n- Stellar English and grammar skills\n\n### Bonus points if you have\n- Technical experience (QA, documentation, systems administration, etc.)\n- Familiarity with Git and GitHub","publish_date":"2017-02-23"},{"has_chat":"true","link":"jobs/ginger-labs.html","location":"San Francisco, FiDi","published":"Feb 18","id":8,"title":"Ginger Labs Customer Experience Agent (iOS/Mac)","body":"\nNotability is used by millions of people around the world for capturing and reviewing information on iOS and Mac. We want you to help us deliver Notability to more people, across more platforms, and make it even easier and more fun to use.\n\nWe are looking for a Customer Experience Agent to provide technological expertise and educational support to our customers. You are an optimistic and attentive teammate who listens to customers, figures out what really matters, and you are resourceful enough to troubleshoot problems and get things done. An excellent communicator and lifelong learner, you see documentation and metrics as a way to recognize patterns and improve processes. You want to make people unexpectedly happy and leave them better than you found them.\n\nYou are an optimistic and attentive teammate who listens to customers, figures out what really matters, and focuses on finding solutions. An excellent communicator and lifelong learner, you see documentation and metrics as a way to recognize patterns and improve processes. You want to make people unexpectedly happy and leave them better than you found them.\n\n### Responsibilities:\n- Serve as one of the first points of contact for customers’ questions and feedback.\n- Diagnose bugs and elevate them to quality assurance and engineering as needed.\n- Articulate customers’ needs and interests during internal product planning discussions.\n- Write and maintain clear public support content such as FAQs and troubleshooting guides.\n- Identify and act upon opportunities to improve any and all aspects of customer experience.\n- Identify customers whose attention to detail and passion for Notability make them good candidates for our beta testing team.\n- Manage high volume of customer support requests via email and an occasional phone call, using empathy and logical reasoning to help answer questions and troubleshoot problems.\n\n### Desired Skills and Experience:\n- Articulate, personable, and reliable with excellent writing skills and email etiquette.\n- 1-3 years of online customer support experience with previous experience in software a plus.\n- Experience using support services such as Zendesk, Help Scout, Groove, etc.\n- Works well under pressure and tight deadlines within a fast-paced startup.\n- Passionate about technology and providing incredible experiences for customers.\n- Bachelor's degree with a background in a quantitative or computer science.\n- Bonus points for programming experience.","publish_date":"2017-02-18"},{"has_chat":"true","link":"jobs/resinio.html","location":"Remote","published":"Feb 17","id":9,"title":"resin.io Technical Content Lead","body":"\nResin.io provides a software platform that helps developers build, deploy and manage code on connected devices. In short, we make IoT work.\n\nOur technology is open, standards-based and proven in production across a wide range of scenarios from drones, 3D printers, point-of-sale devices, tidal turbines, skyscrapers and more. Our investors include DFJ, Aspect Ventures, GE, and Ericsson.\n\n### ABOUT THIS ROLE\nAs our user base grows and our platform gets more sophisticated, we’re creating a role for a technical content lead to explain what resin.io is and how to use it successfully. You’ll champion our efforts to create understanding about resin.io and lead the charge on technical documentation. You’ll work closely with our design, development, product and support teams to understand and communicate about the platform to our users.\n\n### RESPONSIBILITIES\n- Manage our docs from end to end. Document new features, maintain existing docs, organize the structure and flow of our docs, and ensure accuracy, clarity, and consistency across all of our technical documentation, including GitHub repos.\n- Write content such as blog posts, forum posts, white papers, and website copy to explain our product features, design principles, and architecture to users.\n- Create tutorials, projects, examples, and screen capture videos to demonstrate our platform.\n- Help design the user onboarding experience and ongoing user education programs.\n- Work closely with the product and development teams to understand technical details and their implications for users.\n- Measure our success in helping users understand resin.io, share progress with the team, and find ways to improve.\n\n### REQUIREMENTS\n- Excellent writing and communication skills. You turn complicated technical details into clear and interesting material.\n- Able to dive deep while keeping the big picture in mind. You can create lots of great content while seeing how it fits into our overall story and broader goals.\n- Able to work with developers to gather technical details. Like a journalist, you ask questions to get to what’s most important for users to know.\n- Organized, thorough and pay close to attention to detail. You’re the person who will submit a pull request to fix a typo.\n- Self-motivated and able to set direction and priorities. You can be incredibly productive without much oversight and know where your time is best spent.\n- Skilled at learning and teaching new concepts. You don’t need to be a developer, but you do need to speak the language of software, build a basic understanding of resin.io products, and be able to teach others about our technologies.\n- Able to understand the product from a user’s perspective and explain features in a way that users will appreciate.\n- Fluent in written and spoken English.\n\n### Nice to have:\n- Experience with resin.io-related technologies (e.g. Docker, Linux, IoT devices like the Raspberry Pi).\n- Interest in trying your hand at hardware projects.\n- Experience writing technical docs, blog posts, briefs, and white papers - writing samples welcome!\n- Experience in user-facing roles (e.g. quality assurance, support, development, product, experience design).\n\n### BENEFITS\n- Work with a talented, diverse team\n- Remote-friendly\n- Flexible working hours\n- Flexible vacation policy\n- Annual company gathering at an international location\n- New computer and equipment of your choice\n\n### WORKING AT RESIN.IO\nOur team is distributed around the world, at more than 15 different locations, and embraces a remote-first culture with flexible hours. This means that team members can be highly productive while still maintaining a healthy work-life balance.\n\nYou can expect to work on interesting and increasingly challenging projects here. You’ll also have a say in what you work on and how you achieve your goals.\n\nWe have a culture that assumes positive intent while driving one another towards excellent results. We value direct and open communication. We are also an equal opportunity employer and value diversity. We maintain a work environment in which team members are treated with respect and in which thoughts and ideas can be shared openly.\n\nWe actively seek out candidates with different backgrounds, experiences, abilities and perspectives. If you are not sure if this is the role for you, please ask us.","publish_date":"2017-02-17"},{"has_chat":"true","link":"jobs/seatgeek.html","location":"NYC","published":"Feb 16","id":10,"title":"SeatGeek Customer Experience Specialist","body":"\nDo you love helping people? Are you smart, humorous, and creative? Are communication and working under pressure two of your best skills? If you answered \"yes\" to all of the above, keep reading!\n\nAs a member of our Customer Experience team, you'll be the voice of SeatGeek. You'll interact with customers through phone calls, emails, live chat and social media to resolve their issues and stay in the know about SeatGeek's latest features. We are passionate about providing ridiculously good customer service, and our CX folks are some of the best and brightest in the industry.\n\nRight now - we are looking for CX Specialists who can commit to weekend shifts from 10-6 on Saturday and Sunday. The more flexible your schedule, the better!\n\n### Who you are\n- You have a bachelor's degree.\n- You are genuinely interesting, personable and intelligent. Current members of SeatGeek team include a former beekeeper, opera singer, gourmet hot dog vendor and an Olympic-hopeful fencer.\n- You love live events and understand that purchasing tickets to see your favorite band is not the same as buying a stapler. In other words, you can empathize with SeatGeek customers.\n- Prior experience working in CX. A tech startup is a major plus.\n- You aren't intimidated by numbers and understand the value of using data to make intelligent decisions.\n\n### What you'll do\n- Be the first point of contact for customer questions through phone, email, live chat, and social media (even on the weekends!).\n- Use metrics and consumer insight to help make SeatGeek better.\n- Consistently go above and beyond for our customers (think generous refunds and unexpected gifts, just because!).\n- You are a people person and are known to carry on a conversation with anyone.\n- You are passionate about technology and user experience.","publish_date":"2017-02-16"},{"has_chat":"true","link":"jobs/coinbase.html","location":"San Francisco, California, USA","published":"Feb 10","id":11,"title":"Coinbase Manager, Customer Success","body":"\nOur mission at Coinbase is to create an open financial system for the world. As the Customer Success Manager at Coinbase you will shape what Success means in the future of finance. You will use direct outreach, data analysis, and customer narratives to shape an ideal Coinbase customer experience for millions of users across the globe. You will reach out to our customers to help them get the most out of the product and relay their feedback to the product team. You will research and understand how diverse segments of customers stumble and you’ll devise solutions to suit their needs. As the role evolves, you’ll create and manage a Customer Success Team from the ground up where you’ll act as a force multiplier.\n\n### Responsibilities:\n- Advocate for millions of Coinbase customers by identifying points of friction\n- Track customer engagement and map insights to product actionables\n- Combine hard data and customer narratives to make recommendations with confidence\n- Work with the Customer Support team to provide proactive and reactive support directly to our most valuable customer segments\n- Create, shape, and manage the Customer Success Team to support a new global industry\n \n###Requirements:\n\nYou will have many of these attributes:\n\n- Mastery of empathetic and professional correspondence with high value customers\n- At least 1 year of direct people management experience\n- Use of proactive outreach to drive growth, customer retention, public perception, and product improvements\n- A succinct communication style and action-oriented approach to problem solving\n- An ability to tactfully advocate for Coinbase customers to internal teams\n- Demonstrated ability to manage complex, cross functional projects\n- Experience using business analytics software (Looker, SQL, Delighted, etc.) and journey mapping to identify customer points of friction and develop action plans to address them\n- Experience performing front lines support for a rapidly growing technology or payments company","publish_date":"2017-02-10"}]