[{"feature":"true","link":"jobs/helpscout.html","location":"Remote","published":"Aug 15","id":1,"title":"Help Scout Customer Champion","body":"\n### YOUR IMPACT\nSupport is Help Scout’s bread and butter. We’re pleased to be searching for our sixth, full-time support team member. Our ideal hire is motivated by what we’re doing as a company, and eager to contribute on the front lines.\n\n### ABOUT THE ROLE\n- This is a full-time, remote position. You’re someone who thrives working remotely without much (if any) oversight.\n- You’ll be a product expert in all areas. You’ll spend most of your days sending timely, human replies to questions via email, but you’ll also craft documentation, troubleshoot potential bugs, and collaborate with the rest of the team to be as helpful as possible to our customers.\n- Customer success is a big piece of the pie. You’ll work one-on-one with customers, helping them to get the most out of Help Scout. You might wing unplanned Skype calls and live screen-shares, or schedule meetings to talk about unique use cases.\n- We don’t hold you to empty policies or procedures. We expect you to always act in the best interest of the customer. You’ll be given plenty of autonomy to simply do what’s right, no questions asked. With great power comes great responsibility.\n- We’re sticklers about the customer experience. We’re always refining and polishing the product to perfection. As someone on the front line, your understanding of the product and our customers is incredibly valuable. You’ll regularly chat with the product team to make sure we’re getting it right.\n- Help Scout is focused on the idea of “support-driven growth”, where we emphasize being helpful to our prospects and customers as they pursue their goals. We believe that true sustainable growth for Help Scout is a byproduct of putting our customers and their needs, first. The Support team is one strong part of the Growth team, which means you’ll be actively collaborating with the success, sales and product marketing teams in helping our customers.\n\n### REQUIREMENTS\nWe’re looking for someone who can work hours that overlap with 9a-12p EST. Because we value work-life balance and creating a sustainable position, we prefer if you are geographically located between GMT and CST (so you do not need to zone-shift or work far outside of normal business hours where you live).\n\n### ABOUT YOU\n- You’re passionate about support. Former teammates and managers would call you resilient. You’re in it for the long haul, and you’re not looking for the “next best thing”. This isn’t your first rodeo, nor is it a stepping stone. We’re looking for someone with at least one year of support experience.\n- You are self-sufficient and love the challenge of solving problems and learning new things. You welcome an environment where you can do great work independently.\n- You’re patient and hardy, with an excellent sense of humor. You’re an exceptional listener and educator, and you’re naturally curious with a strong desire to learn.\n- You’re an incredible communicator, fluent in written English. You’re just as comfortable on the phone or in person as you are in an email. Your writing is clear and simple, with a proper dose of empathy.\n- You have rare people skills that allow you to get out in front of problems, and proactively help customers with potential troubles. You’re an empathetic problem solver who goes out of their way to help people always.\n- You have a good ole’ fashioned work ethic, day in and day out. You have grit and take initiative and ownership to see things through to completion. If it needs doing, you do it.\n- You aren’t scared of a challenge. When you don’t know something, you embrace the chance to grow and get better.\n\n### ABOUT US\n- Help Scout is a remote team with employees in eleven countries (eight people in the Boston office). We optimize for excellence over geography and overcome remote challenges through transparency, trust, chat and video conferencing.\n- We’re a customer-driven company and always will be. Everything follows the customer experience, no exceptions.\n- Our company is growing and has aspirations of helping millions of people around the world. Accomplishing our goals will present countless challenges and require you to excel in every aspect of the position. It’s hard work, but the people we’re looking for love exploring and solving hard problems.\n- This is not the typical startup “rocket ship.” We’ll never compromise customers or the experience in favor of growth. Our purpose is to build a profitable company that small businesses love and sustain it. We optimize your career at Help Scout for the long term as well, so keeping a healthy work/life balance is an important priority.\n- We value diversity at Help Scout and welcome all applicants regardless of actual or perceived race, color, ethnicity, sexual identity, gender identity, gender expression, economic status, ability, disability, religious beliefs or disbeliefs, national origin, age, military service eligibility, veteran status, marital status, parental status, or caregiver status.\n\n### BENEFITS\n- Competitive Salary - We pay at or above market salary in most cases and evaluate a lot of research to make sure everyone is paid well. The formula we use to calculate all salaries is public to employees and is improved upon regularly.\n- Work anywhere - Work from our office in Boston or anywhere else, provided you have 4 hours of overlap with the team. We’ll even buy your home office furniture or help you pay for a co-working space.\n- Health and dental insurance - We cover you and your family's health/dental insurance 100%. If you are based in the US, we'll cover you on our Harvard Pilgrim HMO or PPO policies.\n- Long-term/Short-term Disability Insurance & Life Insurance - we cover 100% of the premiums for LT/ST Disability insurance and base Life Insurance. You also have the option to purchase supplementary life insurance through our provider.\n- International Benefit Stipend - If you’re based outside the US, you’ll receive a monthly stipend that goes towards covering medical insurance, long and short-term disability, and accountant costs.\n- Flexible vacation - Take time off when you need it, we trust you.\n- Paid parental leave, including adoption - 12 weeks if you have or adopt a baby, 4 weeks if your partner has a baby.\n- 401k with 1% match- 1% Retirement Plan matching for both US and International Employees\n- Personal development stipend - Up to $1,800 per year to improve your craft\n- Great tools - Each employee receives a Mac laptop and 27'' display (or equivalent). We’ll also purchase any of the software or hardware you need as well as high-end furniture to get your home office started\n- Complete transparency - Everyone has full access to business metrics and financial information about the company.","publish_date":"2017-08-15"},{"link":"jobs/learndash.html","location":"U.S. (Remote)","published":"Jul 26","id":2,"title":"LearnDash Customer Service Specialist","body":"\nDo you enjoy the satisfaction of helping someone solve a problem?\n\nAre you the \"go-to\" person for tech support from friends and family?\n\nWould you like to get paid to help people?\n\nWe are seeking a passionate and friendly person to join our team as a Customer Service Specialist where you'll get the opportunity to make a real impact on people's lives and businesses.\n\nGreat performance is rewarded with increases in both responsibility and compensation. Expenses paid travel & education opportunities also provided for those interested!\n\n\n### CUSTOMER SERVICE SPECIALIST RESPONSIBILITIES:\n\nProvides technical support and guidance to users by researching and answering questions; troubleshooting problems; maintaining & updating documentation; addressing pre-sales inquires.\n\n\n### CUSTOMER SERVICE SPECIALIST DUTIES:\n\n- Provides answers to clients by identifying problems; researching answers; guiding client through corrective steps.\n- Improves client references by writing and maintaining documentation.\n- Participates in development of client training programs by identifying learning issues and recommending improvements.\n- Improves system performance by identifying problems; recommending changes.\n- Updates job knowledge by participating in educational opportunities; maintaining personal networks.\n- Responds to pre-sales inquiries.\n- Avoids legal challenges by monitoring compliance with terms of service agreements.\n\n### SKILLS & QUALIFICATIONS\n\nStrong WordPress Competency is a Must, Customer Service Acumen, Basic Proficiency of CSS & HTML, Basic PHP Proficiency Preferred.\n\nBachelors Degree Preferred but not required given relevant experience.","publish_date":"2017-07-26"},{"link":"jobs/airtime.html","location":"Brooklyn, NY","published":"Jul 25","id":3,"title":"Airtime Community Moderator, Second Shift","body":"\nWe’re looking for a Community Moderator. This is a full-time position based in Brooklyn, NY reporting into the Airtime Marketing team.\n\nIn this role, you’ll wear many hats. Flexibility and a willingness to quickly move between projects and tasks are key. We’re looking for a people person who is all about helping others. You must also be comfortable with moderating content that may be sexual, violent, or disturbing in nature.\n\n### Primary responsibilities:\n- Support -- replying to our users’ customer service inquiries and filing bug reports.\n- Content moderation -- investigating and actioning reports of inappropriate content.\n- You’ll also have the opportunity to follow your interests with project work in this role, in addition to the two ticket-focused tasks above. You may be working with the User Insights team to create surveys, schedule interviews, and craft other outgoing communications for users. You may work to create new spaces on our app around your own personal interests, whether that’s knitting, watching Empire, skydiving, sandwiches, Drake, otters, anything! Sky’s the limit.\n\n### REQUIREMENTS:\n- Excellent judgment.\n- Gumption.\n- Comfort viewing content that may be inappropriate for our users.\n- Strong writing skills.\n- A passion for problem-solving.\n- Availability to work evenings (4PM -12AM EST) Wednesday - Sunday.\n\n### PLUSSES:\n- Prior experience working in a customer support or Trust & Safety role.\n- Joining Airtime means exposure to the inner workings of a fast-paced startup. You’ll be part of a motivated team of innovators who’ve previously worked for companies like Netflix, WeWork, and Facebook.\n\n### BENEFITS & PERKS\n- Competitive compensation\n- $0-premium health, dental, & vision insurance\n- $100/mo pre-tax flex money\n- Equipment - whatever you need to succeed\n- Flexible time-off beyond the company-wide holiday periods\n- Annual offsites, monthly team outings and team lunches\n- Occasional travel between the Silicon Valley and New York City offices\n- Snacks & coffee & beer & WeWork benefits galore!\n- Dog friendly!","publish_date":"2017-07-25"},{"link":"jobs/expensify-london.html","location":"London","published":"Jul 25","id":4,"title":"Expensify Success Coach","body":"\nAs a Success Coach, you’ll support customers day in and day out, with the understanding that a product-driven company grows nowhere without a happy customer base. You’re on the front lines to interact with our customers via email and chat predominantly, but we also sprinkle in phone calls and the occasional in-person visit.\n\n### About The Job\n\nAs a Success Coach, you’ll focus on making sure that our customers are successful in using Expensify. You’ll do this by applying a deep understanding of our customers, their processes, our product and the systems with which we integrate. Our customers come in all shapes and sizes and we do our best to make them as happy as possible (read: phenomenal support is the name of the game). When our product changes, you’ll be the point of contact for our customers via email, in product announcements, phone calls and (occasional) in-person visits.\n\n### About You\nJoining our team means you enjoy a fast-paced and challenging work environment. You thrive as an individual contributor and you know how to get shit done. Still wondering whether this is the right role for you? The most successful candidates can:\n\n- Manage time and prioritize efficiently. Things change all the time, especially with the product.\n- Learn from peers across teams in an informal fashion. After all, no one is an expert at Expensify and we're all learning things as we go.\n- Do what it takes to bring the most value to the company everyday, even if that value is created in a repetitive and not so glamorous way. #oneteamonedream\n- Say “no” and communicate that things won’t always change “now”. This helps to keep our product simple and user-friendly.\n- Deftly articulate complex thoughts. One moment you may be having a technical discussion with an engineer about a bug or product flow that’s confusing for our customers, before quickly moving on to working directly with a non-technical customer to fix a problem.\n- Bonus: Some general understanding of the accounting process, Not required!\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n- Describe a memorable experience - whether at work or in your personal life - working with a client/customer. What issue did they face, and and how you were able to address their concerns? If you weren't successful addressing their concerns, why not?\n- Pretend you had a month to do whatever you wanted. What would you do? And would this be sufficient time to accomplish the goals you set out to achieve?\n- If you were tasked with analyzing customer behavior and recommending product-driven solutions, how would you approach that problem?\n- What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n- How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.\n\nResume not your thing? That’s great, we don’t really read them anyways! Forward your responses to the questions to jobs@expensify.com. We're excited to hear from you!","publish_date":"2017-07-25"},{"feature":"true","link":"jobs/wistia.html","location":"Cambridge, MA","published":"Jul 25","id":5,"title":"Wistia Director of Customer Happiness","body":"\nWistia is your friendly neighborhood video platform. Create, host, share, and measure beautiful videos like the human you are. We work hard to find easy, delightful solutions to complicated problems. The Customer Happiness Team embodies this work by tackling the issues our customers encounter with elegance and grace; we build relationships with our customers, who are marketing, sales, support, video production, and HR teams from companies of all shapes and sizes. \n\nAs the Director of Customer Happiness, you'll report to the COO and be responsible for leading our team of Customer Champions. While the Champs take care of reactive email support, they also impact the customer experience in other creative ways, like creating and managing self-service resources and improving the customer experience by triaging and fixing issues in the product. Put simply, you'll enable a deeply creative team to provide our customers with exceptionally creative support.\n\n### Your Typical day includes:\nSurprise! There <i>is</i> no typical day. That said, you'll often find yourself working closely with the team discussing things like:\n\n- How to improve our reactive support strategy by utilizing data and creativity\n- Team projects beyond the inbox, which are designed to positively impact the customer experience and help Wistians grow\n- How to support Customer Champions growth and development, a core part of the employee experience\n\n### This job might be for you if you have\n- Strong empathy for customers and excitement for growth\n- A love for digging deep into problems of all kinds, and for making processes as effective, intuitive and streamlined as they can be\n- Demonstrated desire for continuous learning & development\n- Enthusiastic and creative leadership skills, with the ability to inspire others\n- Top notch communication and presentation powers\n- Proven expertise managing people and teams\n- Several years' experience leading customer-facing organizations, ideally in a Saas business\n- Experience scaling an organization and expanding overall customer experience\n\n### Upon coming on board, you can expect to: \n\n### First three months:\n- Gain an understanding of Wistia’s business, goals, and strategic objectives.\n- Learn not only the fundamentals of Wistia’s products and the range of our customers’ goals and use cases, but also how those things manifest themselves in support.\n- Learn how to navigate an evolving organization to collaborate and get things done.\n- Immerse yourself in the Customer Happiness team, learning its strengths and its opportunities for improvement and increased success.\n- Develop initiatives that can meaningfully impact Wistia's support experience\n- Develop an understanding of the customer support experience by getting first hand experience in our inbox and working directly with customers.\n\n### Three to twelve months:\n- Identify and manage initiatives to achieve consistent excellence in key metrics, including reducing customer contact rate, and increasing customer satisfaction scores and support-specific NPS\n- Ensure our support approach represents our values and mission to make business more human, and constantly elevate the level of customer experience\n- Explore new avenues for customer support (today, we primarily focus on email)\n- Work closely with the product, engineering, marketing and sales teams to translate customer feedback into strategic initiatives\n- Develop Customer Champs, set clear expectations and success benchmarks for growth, and curate the resources and support to help them learn, improve, and succeed\n\n### Your success will be measured by:\n- The metrical proxies of Customer Happiness: customer satisfaction ratings from support interactions, and support-specific NPS.\n- Making the best support be no support, aka lowering contact rate (the percentage of our customers who need reactive support in any period).\n- The consistent delivery, by the whole Customer Happiness team, of an effective and efficient support experience that represents Wistia’s values and mission.\n- Leading a team that continually learns and develops, with each Champ moving towards mastery in technical support or customer education, or developing skills to support priority initiatives within Wistia\n- Regular improvement in the Customer Happiness team’s internal employee NPS.\n\nIf this sounds exciting to you, we hope you'll get in touch! We're profitable, growing, and have raised only seed money, so we have the luxury of being able to invest in whatever will best serve the long-term value of the company. We know the biggest investment we can make is in our employees, so we provide:\n\n- A competitive salary and stock options package\n- 401k with 3% company contribution, regardless of whether you make contributions\n- Flexible hours\n- Fully paid healthcare coverage for you and your family (including dental) and a healthcare FSA\n- Up to 12 weeks paid family leave\n- Untracked vacation and sick leave (Most employees take about four weeks of vacation)\n- Transportation subsidies\n- Financial support for continuing education, professional development and sponsorship for conferences\n- A convenient office just south of Central Square in Cambridge, MA. We're right on the Red Line, surrounded by great restaurants, parks, and even a dog park.\n- Plenty of office snacks and beverages, and a weekly catered team lunch.\n- Annual winter ski trip (with plenty of non-skiing activities)\n- Annual summer pond festival (lounging, water skiing, volleyball, etc)\n\nWe are working hard to make Wistia an inclusive and diverse place where everyone feels <b>happy, fulfilled, respected, comfortable, and welcome</b>. We want you to have fun here! Come join us and let’s build a great company and product together.A competitive salary and stock options package","publish_date":"2017-07-25"},{"feature":"true","link":"jobs/fleetio.html","location":"Birmingham, AL or REMOTE","published":"Jul 13","id":6,"title":"Fleetio Senior Support Specialist","body":"\nAs a Sr. Customer Support Specialist at Fleetio, your job is to support customers who use our software and ensure they have the best customer service experience possible. You’ll be directly responsible for keeping our customers happy and productive.\n\nThis role includes responding directly to customer questions on frontline support as well as troubleshooting escalated technical issues and potential software bugs. You'll triage incoming escalations and perform due diligence to ensure steps to reproduce, then work with the Product Management and Engineering teams to convert valid escalations into bugs/tasks for the product backlog. You will also enforce accountability between Support, Product, and Engineering teams on escalations, lobbying on customers' behalf and keeping them in the loop.\n\nYou'll also be responsible for producing and maintaining articles in our Help Center. This includes technical documentation, FAQs for common issues and training guides. You will even produce screencast videos to better explain how certain features work.\n\nCompanies around the world rely on Fleetio to manage their fleet operations and monitor their drivers. We take customer service seriously and consider this role essential to the company’s success. Be sure to mention coffee in your application so we know you actually read this.\n\n### Responsibilities\n- Handle inbound customer requests via email and phone (90% email, 10% phone).\n- Troubleshoot issues that require technical knowledge to solve, including mobile app issues, integration issues, and data import errors.\n- Triage escalations and ensure detailed steps to reproduce, then work with the Product Management and Engineering teams to convert valid escalations into bugs/tasks for the product backlog.\n- Assist the Product and Engineering teams by testing new features and bug fixes.\n- Spot trends and provide metrics on customer’s issues and bugs that help make informed, data-driven decisions around product enhancements and features.\n- Write documentation and contribute high-quality content to our Help Center and internal knowledge base.\n- Create screencast videos for specific features and functionality.\n\n### You’ll also:\n- Serve as a mentor and help guide to other Fleetio team members.\n- Develop deep product knowledge and serve as a technical expert on Fleetio’s product offerings.\n- Help design product-based training for Support including functionality overviews, common issues, and troubleshooting techniques.\n- Advocate for new tools to facilitate troubleshooting & support.\n\n### REQUIREMENTS\n- Ability to work 9am - 6pm, CT, Monday through Friday\n- Genuine empathy for customers, and desire to make them feel happy and understood\n- Passion for exceptional customer service and appreciation for its role in a company’s success\n- Excellent writing and communication skills\n- Great interpersonal and teamwork skills; you’re naturally a helper\n- Resourceful and determined, yet not afraid to ask for help\n- Natural troubleshooting skills, deep analytics and research skills, and excellent creative and critical-thinking skills\n- Deep curiosity and strong problem-solving skills\n- Moderate to advanced technical aptitude, excited by technology and its ability to make you more productive, and a desire to continue to expand your technical knowledge\n- General understanding of how web apps and mobile apps work\n- Some HTML experience\n- Prior experience doing email-centric customer support for a web application is desirable\n- College degree or equivalent professional experience preferred\n\n### BENEFITS\n- 100% coverage of health and dental insurance\n- 401(k)\n- Meaningful company equity\n- Book program and professional development budget\n- Mac laptop and whatever tools you need","publish_date":"2017-07-13"}]