[{"has_chat":"true","feature":"true","link":"jobs/issuu.html","location":"Palo Alto, CA","published":"Mar 15","id":1,"title":"issuu Community Manager","body":"\nissuu is the world's leading digital publishing platform. We're looking for a new member to join our fantastic team. With amazing people, unique ideas and stunning technology, we're changing the future of publishing today. Are you the best at what you do? Come join us.\n\n### About this job\nThe marketing team at issuu is seeking a creative, inspired Community Manager to join us and take responsibility for building strong, positive relationships with the growing number of publishers who rely on issuu every day. You enjoy interacting with people online and in the real world, and you have a knack for engaging others with the ideas and content you create and share. You’ll be part of a growing team that collaborates with awesome colleagues in design, support, product and engineering to deliver the world’s best publishing experience for millions of people. This is a full-time position based in issuu’s Palo Alto office. You will report to the VP of Marketing.\n\n### RESPONSIBILITIES\n- Manage issuu social communities across Facebook, Twitter, Pinterest, LinkedIn, Instagram and others\n- Engage with publishers to foster the development of an active community organized around their concerns, interests and opportunities for growth\n- Identify and manage influencer outreach to drive additional visibility for issuu among publishers\n- Lead the creation and management of content and social media campaigns to highlight issuu’s network and global audience\n- Develop an editorial calendar and content strategy for each social channel we participate in\n\n### QUALIFICATIONS\n- 1-3 years of experience managing online communities\n- Excellent communication skills\n- Strong understanding and prior experience with major social media platforms including Facebook, Twitter and Pinterest\n- Great teammate and collaborator, able to work with a diverse and geographically dispersed team\n- Able to be effective in a startup environment: be proactive, creative and innovative\n\n### BENEFITS\n- Competitive compensation package, commensurate with experience\n- Flexible vacation policy\n- Competitive health, dental and vision packages\n- A sleek Mac and a pretty sweet desk setup\n- Walking distance to the Palo Alto Caltrain station and monthly passes for public transportation or parking\n- Catered lunches and team events","publish_date":"2016-03-15"},{"feature":"true","link":"jobs/github-enterprise.html","location":"Remote","published":"Mar 7","id":2,"title":"GitHub Enterprise Support Engineer","body":"\nMore and more companies are using GitHub Enterprise, so the support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. We're looking for Enterprise Support Engineers, in North America, some European territories, Australia, Japan, and New Zealand to support our GitHub Enterprise product installed and managed in the customer's virtualization environment.\n\nYour main responsibility will be to work with our customers to solve support tickets. Tickets are usually opened by internal system administrators, and can include investigating load or networking issues, debugging application errors, and discussing feature requests. You'll also work with our engineering team to prioritize issues and development, and our documentation team to improve customer-facing resources. You don’t need to be a Git expert, but you do need to have technical experience and a passion for helping people.\n\nThe position reports to an Enterprise Support Manager and works closely with other teams and leaders across the company.\n\nGitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events. \n\n### RESPONSIBILITIES\n- Solve complex customer support tickets often involving Linux servers, source code, and web application issues\n- Effectively communicate technical information to customers and engineering groups at GitHub\n- Work proactively with customers on activities such as coordinating upgrades, communicating upcoming features, and ensuring their installation is running smoothly\n- Identify bugs and improvements in the GitHub Enterprise codebase\n- Manage urgent customer outages during business hours\n\n### QUALIFICATIONS\n- General understanding of how modern web applications work\n- Prior experience providing technical support\n- Excellent problem solving skills\n- Familiarity with some flavor of production-level virtual machine (e.g., VMware ESX, Xen, KVM)\n- Enthusiasm for working directly with customers\n- Stellar English and grammar skills\n\n### BONUS POINTS IF YOU HAVE\n- Worked closely with large complex customer accounts\n- Familiarity with Git and GitHub\n- Experience with phone support\n- Ability to look through and understand code (Ruby / Bash)\n- Previous experience as a System Administrator\n\n### WHY YOU SHOULD JOIN\nWorking at GitHub is, to put it simply, a special slice of the universe. We're committed to transparency, collaboration, experimentation, and always staying classy.\n\nBecause of this unique perspective, we've established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.\n\nEnsuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits* are out of this world.\n\nIn a nutshell, we've built and are growing a place where we truly love working, and we think you will too.\n\nGitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there's anything we can do to make the interview process better for you; we're happy to accommodate.\n\n*_Please note that benefits vary by country, if you have any questions don't hesitate to ask your recruiter!_","publish_date":"2016-03-07"},{"feature":"true","link":"jobs/github.html","location":"Remote","published":"Mar 7","id":3,"title":"GitHub Technical Support","body":"\nThe GitHub Technical Support team is looking for full-time team members in our SF office or worldwide! We are particularly in need of folks in Asia-Pacific and Europe. GitHub users work 24/7, so you'll occasionally need to adjust your work week to help cover a weekend or holiday (don't worry! We strongly support flexible schedules that let you to take care of the important things in your life).\n\nWhen GitHub users have questions, they contact Support and we help them as quickly and awesomely as possible. Technical support handles a wide variety of inquiries including questions about Git and GitHub workflows, GitHub Pages, our API, and our desktop applications. Support also works closely with the engineering team to track down bugs and improve our documentation.\n\nThe most important characteristic of our support team is that we love helping developers. GitHub is a place for people to work better, together. Our job is to help. Support treats users the way we'd want someone to treat our friends.\n\nOur support teammates have excellent writing chops: stellar grammar, charming written personality, and the ability to explain complicated things simply. We measure our success in swiftness, accuracy, and clarity.\n\n### YOU MUST HAVE:\n- Stellar English and grammar skills\n- Excellent problem solving skills – you might not know all the answers but you know how to find and communicate the solution\n- A strong sense of empathy – you are attuned to hear the question behind a question\n- Technical experience and exposure to programming\n- Customer service experience\n- A unique writing style and voice\n\n### BONUS IF YOU:\n- Will love developers and GitHub as much as we do\n- Could effortlessly explain how Git works to a non-developer\n- Have remote customer service experience\n\n### WHO WE ARE\nGitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.\n\nWe have a lot of exciting things to do, and we’re looking for the right people to grow with us!\n\n### WHY YOU SHOULD JOIN\n\nWorking at GitHub is, to put it simply, a special slice of the universe. We're committed to transparency, collaboration, experimentation, and always staying classy.\n\nBecause of this unique perspective, we've established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.\n\nEnsuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits* are out of this world.\n\nIn a nutshell, we've built and are growing a place where we truly love working, and we think you will too.\n\nGitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there's anything we can do to make the interview process better for you; we're happy to accommodate.\n\n*_Please note that benefits vary by country, if you have any questions don't hesitate to ask your recruiter!_","publish_date":"2016-03-07"},{"has_chat":"true","link":"jobs/base.html","location":"Mountain View, CA","published":"Mar 3","id":4,"title":"Base CRM Product Support Specialist","body":"\nWe’re looking for a Product Support Specialist in our Mountain View office. You will be the first point of contact for our users and help serve as the voice of the company. We’re looking for smart, engaging, and dynamic people who learn quickly and have a passion for technology. \n\nIf you’re looking to kickstart your career by joining one of the fastest-growing startups in the Valley, we want to hear from you!\n\n### EXPECTATIONS\n- Assist current and potential Base users in understanding the product, its features and how it can best be used to grow their business.\n- Provide product demonstrations and webinars for prospective and current users to help them understand how to get the most out of Base.\n- Manage and resolve support requests over the phone or email.\n- Update or create support articles for new features.\n- Work with users to identify, troubleshoot and resolve issues as well as collect feedback.\n- Work side-by-side with our Product Engineering team to improve Base.\n- Provide a positive, personalized experience to each customer who reaches out to us.\n\n### REQUIREMENTS\n- MOST IMPORTANT—You possess strong written and verbal communication skills.\n- You're a self starter and are driven to conquer projects outside of your core responsibilities.\n- You’re analytically-minded, and are able to prioritize workloads and adjust as situations change.\n- You enjoy helping others and appreciate the challenge of solving technology related problems.\n- You're excited about learning and technology in a rapidly growing environment.\n- You engage well with others and remain calm under pressure.\n\n### BONUS SKILLS YOU MAY HAVE\n- Experience using Microsoft Excel\n- Experience using a CRM solution and an understanding of the SaaS marketspace\n- Knowledge of various mobile platforms: iOS, Android, and Windows Mobile\n- Familiarity with RESTful API, Chrome Dev Tools, and various web technologies","publish_date":"2016-03-03"},{"has_chat":"true","feature":"true","link":"jobs/formlabs-community.html","location":"Boston, MA","published":"Mar 3","id":5,"title":"Formlabs Community Manager","body":"\nTo reinvent an industry, you have to build the best team. **Join Formlabs** if you want to bring ground-breaking professional 3D printers to the desktop of every designer, engineer, researcher, and artist in the world.\n\nOur primary goal is to give our customers the best tools with an amazing experience. With users of all levels throughout the world, developing our presence online is essential to growing our customers and product. We’re looking for a Community Manager to be the voice of Formlabs users, at events and online.\n\nIf you are ready to take 3D printing users to the next level by celebrating their applications, and teaching them how to do even more, join the Form Team as our Community Manager.\n\n### The job:\nInspire, organize, and scale our community presence through a variety of media\nCultivate powerful connections between users to share best practices and projects\nGet the world excited about 3D printing\n\n### You:\nAre already an expert in CAD and evangelist for 3D printing\nMaintain an active presence thorough forums, social media, and events\nExcited to be the voice and face of Formlabs in online webinars and local meetups\nA creative and patient problem solver who loves to help others be successful\nThoughtful and responsive, with a natural curiosity and sense of humor\nCan quickly develop quality written and visual content to teach tips and concepts\nTranslate feedback from the community into insights for core internal teams\nCan crunch numbers to track feedback and build metrics\nAn independent and driven self-starter, comfortable in a start-up environment\nPossess exceptional written and verbal communication skills\n\n### Bonus skills:\nHands-on fabrication expertise\nPrevious experience in the 3D printing industry\nPersonal interest in design or entrepreneurship","publish_date":"2016-03-03"},{"has_chat":"true","link":"jobs/packlane.html","location":"Remote or Berkeley, CA","published":"Feb 26","id":6,"title":"Packlane Customer Service Representative","body":"\nCustomer service is often taken for granted. “Just do your job,” they say. “That’s what we’re paying you for,” they say. Not here. At Packlane, we see it as an art form. Because great service—where details matter most, problems get solved (not deflected), and relationships are built—is magical. We know that without the right person representing us on the frontlines, we don’t stand a chance. Our customers come to us because they want the best for their business. And the best starts with you.\n\n**What you’ll do:**\n\n- Show off your proficient, positive, and proactive personality in every communication with our customers—not just on email, but also on live chat, where thinking-on-your-feet is key.\n- Be a steadfast Know-It-All when it comes to order status, product info, technical issues, pricing and more. And if you don’t know it all, you’ll know how to track it down. Fast.\n- Keep our customers’ accounts up to date, managing refunds or credits when necessary.\n- Become our CSSME—Customer Service Subject Matter Expert. In other words, know your stuff, write it down, and make sure it goes viral.\n- Remember that part about solving (not deflecting) problems? Yeah, that.\n\n\n### REQUIREMENTS\n**Who You Are:**\n\n- Detail obsessed. Like housecleaning with a toothbrush obsessed.\n- An unapologetic people person. Hugging optional, of course.\n- Reliable. Accountable. Dependable. And all the other good -bles. You know what they are.\n- A communicator at heart, who appreciates how the right words can soothe even the surliest souls.\n- Familiar with printing processes and Adobe Creative Suite.\n\n### BENEFITS\nWork from anywhere! This is a full-time, remote position.","publish_date":"2016-02-26"},{"has_chat":"true","feature":"true","link":"jobs/formlabs.html","location":"Boston, MA","published":"Feb 22","id":7,"title":"Formlabs Customer Support Engineer","body":"\nTo reinvent an industry, you have to build the best team. **Join Formlabs** if you want to bring ground-breaking professional 3D printers to the desktop of every designer, engineer, researcher, and artist in the world.\n\nOur primary goal is to give our customers the best tools with an amazing experience. At Formlabs, that means answering every question, no matter how small, and building amazing support material to empower our users to innovate and create.\n\nIf you love new technology and are a natural problem-solver and a great communicator, we want you on the Form Team as a **Customer Support Engineer**.\n\n### The job:\n- Remotely identify and resolve technical issues with both software and hardware\n- Create excellent support content and continually improve our support systems\n- Keep customers ridiculously happy\n- Print in 3D to your heart’s content\n\n### You:\n- Feel amazing when you can identify the cause of a challenging problem\n- Can teach complex technical issues to any audience\n- A critical thinker, with an ability to quickly diagnose and resolve technical issues\n- Can easily adopt cloud-based business applications (Zendesk, Salesforce)\n- Power through task lists at lightning speed\n- Enjoy dismantling, troubleshooting, and playing with electronics\n- Care about going the extra mile to find or create the best solution\n- Possess exceptional written and verbal communication skills\n\n### Bonus skills:\n- Experience with 3D modeling, printing and digital fabrication\n- Experience providing technical support for hardware products\n- Creating and writing troubleshooting guides\n- Engineering or craft background, building and repairing electrical/mechanical systems\n- Familiarity with ticket or case management systems (Zendesk)","publish_date":"2016-02-22"},{"has_chat":"true","feature":"true","link":"jobs/haikulearning.html","location":"Tucson, AZ","published":"Feb 19","id":8,"title":"Haiku Learning Support Specialist","body":"\n### What is Haiku Learning?\n\nHaiku Learning is about community, and that includes our company’s community of creators, evangelists and visionaries. Right now we’re looking for a talented communicator and process-driven people-person who is passionate about great software, smart teamwork, and doing good in the world. We are a technology company that is passionate about the technology, but even more passionate about making tools that transform learning.\n\nWhy Haiku Learning is one of the best places to work on the planet:\n\n- You get to promote learning spaces that change lives.\n- You get to work with teachers and education technologists - some of the smartest, most amazing people from the leading schools and educational programs in the world.\n- You have flexibility to live your life. We know you have hobbies, interests, and families. We want you to love what you do, but not live what you do.\n\nIf you like people, are passionate about education, and want to help build the learning spaces of tomorrow, we want to hear from you.\n\n### Role Summary\n\nSupport Specialist are in charge of making sure every support request is met with positive energy and attention. Support Specialists should have a good eye for detail and are excellent writers who want to make sure people are taken care of. They are sleuths and investigators: Think Sherlock (with social skills).\n\nAs a First-Line-of-Defense Support Specialists, your primary role is to be responsive to customers via phone and our support ticketing system. You will also be investigating problems customers encounter to see if you can identify bugs and other issues. Support Specialists follow up internally as well as externally to communicate findings and solutions. \n\nThe expectation of the job is that you will be working 40 hours per week. You will be part of our support rotation on some weekends and holidays, and your weekly hours will be flexed to compensate for these duties. Your exact schedule will be determined by you and your supervisor.\n\n### Support Desk \n- Provide general support, lightweight integrations support, and general troubleshooting\n- Respond to support tickets, phone calls, and emails\n- Provide weekend Helpdesk support on a rotating basis\n- Follow up on existing tickets in a timely manner\n- Maintain active dialogue with users on open tickets\n- Report bugs and propose fixes to the Technical Lead or Technical Services Team\n- Understand and follow internal processes for support emergencies\n- Give suggestions for internal support processes and tool improvements\n\n### Product Quality Assurance & Technical Investigation\n- Work with Technical Lead to provide higher-level support for complex issues, including deep investigation, bug replication, and troubleshooting as needed \n- Participate in pre-launch Happy Hours (Quality Assurance Testing)\n- Participate in post-launch QA and customer follow-up process\n- Make tickets for fixes, changes, and enhancements\n- Work with Support Technical Lead to prioritize issues and follow up on critical bugs\n\n### Other Responsibilities\n- Attend weekly departmental meetings\n- Be responsive to our internal teams via chat, video, and email during working hours\n- Help keep Knowledgebase articles and videos accurate, up to date, and cross-referenced\n- Collaborate with Community Care team on general and shared duties\n- Collaborate with Support Team to triage tickets and escalate problems as needed\n- Complete other tasks and projects as requested by Team Manager\n\n### Skills & Proficiences\n- Strong technical skills with the ability to troubleshoot and clearly communicate solutions both orally and in writing\n- Familiarity with Google Apps and ticket tracking applications not required, but is a plus\n\n### Requirements\n- Bachelors degree, or comparable experience in customer support","publish_date":"2016-02-19"},{"has_chat":"true","feature":"true","link":"jobs/wildbit-beanstalkapp.html","location":"Philadelphia or Remote","published":"Feb 12","id":9,"title":"Wildbit Customer Success - Beanstalkapp","body":"\nWe’re looking for someone who understands that customer success is a focus on customers, not on ourselves. At Wildbit, our focus is entirely on enabling teams to build and launch their own products and services. Our success team handles our customers needs proactively (success) and reactively (support) across our three products (Beanstalk, DeployBot, and Postmark).\n\nYou’ll be working with our customer success team helping new customers get up to speed quickly, educating developers on industry best practices, and helping our team identify where we can better meet the needs of our customers. This means creating content & user guides, talking to customers over various channels (email, support, chat, phone, etc), analyzing behaviors, and keeping our developers & designers up to speed at all times.\n\nMost of all, this job is about empowering developers to do their best work. And to have fun doing it!\n\n### Requirements:\n- solid writing skills\n- empathy for novice developers\n- a desire to teach\n- a background in web development\n- a solid understanding of version control (Git & Subversion) and development practices \n- experience in measuring and tracking your own results\n- for this position, we’re looking for people able to work the following hours: **8–4 GMT and 8–4 PST**\n\n### Nice to haves:\n- Experience in customer success/product management\n- Experience in customer support\n- Experience supporting or building a SAAS product\n\n### Benefits:\n- Chef-prepared family lunches (in Philly office)\n- Full health benefits\n- Company-paid retreats\n- Computer setup of your choice, renewed every 2 years\n- 25 paid days off per year\n- Quarterly profit sharing\n- Attend conferences\n- Quiet Fridays\n- 40 hour work week with flexible hours","publish_date":"2016-02-12"},{"has_chat":"true","feature":"true","link":"jobs/wildbit-postmarkapp.html","location":"Philadelphia or Remote","published":"Feb 12","id":10,"title":"Wildbit Customer Success - Postmarkapp","body":"\nWe’re looking for someone who understands that customer success is a focus on customers, not on ourselves. At Wildbit, our focus is entirely on enabling teams to build and launch their own products and services. Our success team handles our customers needs proactively (success) and reactively (support) across our three prodcuts (Beanstalk, DeployBot, and Postmark).\n\nYou’ll be working with our customer success team helping new customers get up to speed quickly, educating developers on industry best practices, and helping our team identify where we can better meet the needs of our customers. This means creating content & user guides, talking to customers over various channels (email, support, chat, phone, etc), analyzing behaviors, and keeping our developers & designers up to speed at all times.\n\nMost of all, this job is about empowering developers to do their best work. And to have fun doing it!\n\n### Requirements:\n- solid writing skills\n- empathy for novice developers\n- a desire to teach\n- a solid understanding of transactional email and email technologies (SPF, DKIM, DMARC)\n- experience in measuring and tracking your own results\n-  for this position, we’re looking someone able to work the following hours: **8–4 PST**\n\n### Nice to haves:\n- previous experience in customer success/product management\n- previous experience in customer support\n- previous experience supporting or building a Saas product\n\n### Benefits:\n- Chef-prepared family lunches (in Philly office)\n- Full health benefits\n- Company-paid retreats\n- Computer of your choice, renewed every 2 years\n- 25 paid days off per year\n- Quarterly profit sharing\n- Attend conferences\n- Quiet Fridays\n- 40 hour work week with flexible hours","publish_date":"2016-02-12"},{"feature":"true","link":"jobs/activecampaign.html","location":"Chicago, IL","published":"Feb 11","id":11,"title":"ActiveCampaign Director of Support","body":"\nActiveCampaign is a quickly growing SaaS company. We’ve built an integrated marketing & sales platform for companies of all sizes. We are known for being the easiest to use solution on the market and offering the best customer support experience.\n\nWe are looking for someone to improve upon our overall customer support experience while building out our support team to meet the demands of our increasing growth.\n\n### WHAT YOUR DAY COULD CONSIST OF:\n- Working with and developing our support team members on a group and individual basis\n- Identifying trending issues and working with product & development teams on solutions\n- Building out processes to improve our customer experience & ensuring processes are being utilized\n- Prospecting, interviewing, and on-boarding new hires\n- Creating strategy for growing the support team and areas of focuses\n- Assisting with defining and working towards quarterly goals for improving our customer experience\n\n### WHAT IS NEEDED:\n- Previous experience building out and managing a support team (preferably for a SAAS company)\n- Experience with recruiting and hiring for a support team\n- A passion for data analysis and processes\n- Knowledge of email marketing & marketing automation\n\n<!--[if(lte IE 8)]>\n\t\t\t\t<img style=\"width:150px\" class=\"ie meta_logo\" src=\"http://metacommunications.com/wp-content/themes/meta2015/images/fallback/logo_meta_stacked_white.png\">\n\t\t\t<![endif]-->","publish_date":"2016-02-11"}]