[{"has_chat":"true","link":"jobs/envoy.html","location":"San Francisco, CA","published":"Jun 2","id":1,"title":"Envoy Customer Ambassador","body":"\n### ABOUT US:\n\nEnvoy's mission is to have awesome visitor and employee experiences become universal in the workplace. With our first product – Envoy Visitor Registration – we’re reimagining the future of the front desk.\n\nEnvoy is an all-in-one visitor management solution. From collecting visitor information and signatures to host notification, visitor pre-registration, and more. Thousands of companies rely on Envoy to elegantly welcome visitors and keep their information safe and secure. Our focus on good design and customer service set us apart from the myriad other enterprise software companies that settle for 'good enough.'\n\nEnvoy is backed by Andreessen Horowitz and has served over 4M visitors in 55 countries since it was founded in 2013. Envoy is used by some of today’s most exciting brands including Box, Pinterest, Pixar, GoPro and Mailchimp.\n\n### ABOUT YOU:\nYou’re self-motivated, love making people happy, and have a talent for resolving customer issues with a smile. As an Envoy Customer Ambassador, you’ll be responsible for creating amazing customer experiences, helping us improve our team workflow, and putting out the occasional fire.\n\n### KEY RESPONSIBILITIES:\n- Qualify, prioritize, and close customer issues.\n- Monitor and address customer tickets and Live Chats.\n- Work with the team to identify, report, and resolve issues and file bug reports.\n- Work with customers to trouble-shoot technical problems, ranging from integrations to hardware.\n- Understand common customer issues to better inform support processes.\n- Champion the customer's issues and feature requests with the product team.\n- Help refine the processes for the Envoy Ambassadors team.\n\n### MUST HAVES:\n- Experience working with customers, either in a call center or retail position.\n- Desire to go above and beyond to help customers achieve the best experience.\n- Passion for problem solving and the right attitude and aptitude for learning new technology.\n- Excellent written and verbal skills; ability to explain the complex in a simple manner.\n- Love talking to people, and desire to help people through tough issues.","publish_date":"2016-06-02"},{"feature":"true","link":"jobs/expensify-coach.html","location":"London","published":"Jun 2","id":2,"title":"Expensify UK Success Coach","body":"\n### Your Mission, Should You Choose to Accept:\n\nExpensify prides itself on solving real-world problems with a team of top-notch product experts. We are reinventing the way people look at expense reports by automating not just the expense report, but the entire business trip. Joining our team means you are helping us fight the good fight against expense reports that suck!\n\n### About The Job\nAs a Success Coach, you will be focused on making sure that our customers are successful in using Expensify to solve the problems they face. You’ll do this by applying a deep understanding of our customers, their processes, our product and the systems with which we integrate. You’ll also gather feedback on how we can evolve Expensify to meet our customer’s needs in the future, and apply your product knowledge to map out these improvements for engineering. When product changes happen, you’ll lead the charge via documentation, blog posts, emails, calls and in-person visits with our customers.\n\nJoining our team means you will be working in our fast-paced environment and you are fearless of our next big challenge. Even though we work hard at Expensify, we make sure our employees are happy. Our most-discussed perk is our offshore, where we spend a month abroad working as a team from a remote location. Last year we went to Cambodia and Thailand. Where do you want to go next?\n\n### About You\nYou’re an entrepreneur who enjoys thinking through challenging problems, working across functional groups and articulating yourself in both technical and non-technical settings. You’re poised and confident when talking to customers and can always find the time to work with your colleagues to get any issue resolved.\n\nFor the best possible fit, we are looking for someone who:\n\n- Has excellent communication skills. One moment you may be having a technical discussion with an engineer about the product implications of a new feature, the next moment need to communicate how we are going to sell this feature with a member of the sales team, before quickly moving on to working directly with a non-technical customer to fix a problem. The ideal candidate will be able to clearly articulate themselves in all scenarios.\n- Is passionate about building, maintaining and making our software better. It’s what we do as a company.\n- Can manage time and prioritize efficiently. Things move quickly in this environment and it’s crucial that you are able to react to new information and re-prioritize accordingly.\n- Is comfortable learning from peers in an informal fashion. After all, we're all learning things as we go. We also love anyone who's able to effectively train colleagues as we grow the team.\n- Is well-versed in saying “no”. We often have to say no to ensure that our product stays simple and user-friendly. Saying no and having a compelling argument as to why requires in-depth product knowledge and knowledge of the problem that the customer is trying to solve and is critical to success in this role.\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n1. Describe a memorable experience - whether at work or in your personal life - working with a client/customer. What issue did they face, and and how you were able to address their concerns? If you weren't successful addressing their concerns, why not?\n\n2. If you were tasked with analyzing customer behavior and recommending product-driven solutions, how would you approach that problem?\n\n3. Describe a scenario where you interacted with an irate person. How were you able to turn them around (assuming you were able to)?\n\n4. What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n\n5. How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.","publish_date":"2016-06-02"},{"feature":"true","link":"jobs/expensify.html","location":"London","published":"Jun 2","id":3,"title":"Expensify UK Customer Success","body":"\n### Your Mission, Should You Choose to Accept:\nExpensify prides itself in solving a real world problem with a team of top notch product experts. We are reinventing the way people look at expense reports by automating not just the expense report, but the entire business trip. Joining our team means you are helping us fight the good fight against expense reports that suck!\n\nWe are expanding into the UK market and it's very early stage for our London based team. Help shape the team that will launch our global domination of expense reports and maintain a standard of excellence around the world.\n\n### About The Job\nAs a member of the Customer Success Team, you will be focused on making our user base successful Expensify users, through a deep understanding of our product and its many applications.\n\nJoining our team means you will be working in our fast paced environment and you are fearless of our next big challenge. Even though we work hard at Expensify, we make sure our employees are happy. Our most discussed perk is our offshore where we spend a month abroad working from a remote location as a team. This year we went to Cambodia and Thailand. Where do you want to go next?\n\n### About You\nYou’re an entrepreneurial extrovert who loves developing relationships with others and helping them solve complex problems with the ease of a trapeze artist! You’ll be talking to users through email, chat, and when needed on the phone, assisting with the onboarding process for potential customers, and working with with existing customers to make sure they are getting the most out of Expensify. The sky’s the limit for you, and this position can also be a jumping off point into other teams within the organization.\n\nFor the best possible fit, we are looking for someone who:\n\n- Can communicate to all levels within a company in a professional manner\n- Is a team player with great interpersonal skills\n- Wants to contribute to the growth of this team for the future\n- Can provide excellent verbal and written communication with clients\n- Bonus: Some general understanding of the accounting process, Not required!\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n1. What was your first customer support position?  What did you support, and what was your personal take on the product and how best to support it?\n\n2. If you were given free reign to choose the optimal set of customer support tools, what would they be and how would they optimize your customer success approach? (Feel free to list actual sales tools you’ve used, or fictitious ones. You’ve got free reign).\n\n3. Describe the angriest customer you have had to support, and how were you able to turn them around? (Assuming you were able to!)\n\n4. Pretend you had a month to do whatever you wanted. What would you do? And would this be sufficient time to accomplish the goals you set out to achieve?\n\n5. What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n\n6. How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.","publish_date":"2016-06-02"},{"link":"jobs/insightly.html","location":"San Francisco, CA","published":"Jun 2","id":4,"title":"Insightly Customer Service Specialist","body":"\nInsightly is looking for a Customer Service Specialist in San Francisco who not only loves to help customers, but also genuinely cares about them. If you’re a team player who wants to help us continue to grow Insightly, we’d love to talk to you.\n\nInsightly is dedicated to giving our customers fast, helpful, and friendly answers to any questions they have about our application. In this role, you’ll answer how-to questions, as well as questions about Insightly functionality and integrations. We have some of the most passionate customers worldwide, so sharing their feedback to influence where we take Insightly is a critical part of this role.\n\nReports to: Senior Customer Service Manager\n\nHours: Full time\n\n### When you apply (required), tell us briefly:\n- Why do you want to be part of the Insightly team?\n- Why are you the best candidate for this role?\n- What’s the best part of working in customer support?\n\n### Responsibilities\n- Become an Insightly product and features expert.\n- Help customers get the most out of our software and respond to customer requests via email ticket support, support requests that come up in our online community, and phone requests.\n- Escalate support requests and bugs to engineering team - triage, diagnose, and resolve technical issues and reduce support requests.\n- Develop and maintain relationships with QA and engineering teams for swift resolution of bugs, service interruptions, and other service-related issues.\n- Solve tickets using Zendesk, and help the team to get the most out of it.\n- Listen to customers’ needs effectively and share feedback with the engineering team.\n- Provide input to the Insightly Product team on feature improvements and customers’ business challenges.\n- Be a self-starter - identify and implement efficiencies and best practices. Identify trends/issues and come up with solutions.\n\n### Required Skills\n- Hands-on experience with cloud-based solutions\n- Experience with CRM a plus\n- Experience providing B2B a plus\n- Excellent written and communication skills\n- Ability to troubleshoot\n- Curiosity, and a passion for learning\n- Familiarity with Google Apps for Business\n- Basic computer skills including Microsoft Windows environment, Google Apps, and familiarity with various browsers\n- Must embody a great deal of patience\n- Be a customer service star with a technical background and troubleshooting skills\n- Familiarity with a ticket-based support tool (like Zendesk) and phone-based support\n- Must possess a great deal of customer empathy and have a good understanding of how to provide a great experience for customers\n- Comfortable with learning new technologies and solutions and answering customer concerns via phone, email and online communities\n- A passion for small business, CRM, and start-ups\n- Metrics-driven - can move quickly through tickets, yet maintain a high level of customer satisfaction\n\n### About this company\nOver a million users in 150 countries rely on Insightly’s intuitive cloud-based CRM project management solution to track customer interactions and manage contacts, proposals, opportunities, projects and files every day. Insightly’s service integrates seamlessly with Gmail and Outlook, and it has consistently ranked as the No. 1 CRM application on the Google Apps Marketplace. Insightly recently concluded a Series C financing round and is backed by Emergence Capital Partners, Cloud Apps Management LC, Sozo ventures, and TrueBridge Capital Partners. We are based in San Francisco and conveniently located close to Muni, Bart, and Caltrain. We provide competitive compensation packages, stock options, full medical and other benefits.\n\n### Company Perks\nWe’re not only a super successful and fast growing start-up, but also a fun place to work. Here are just some of the perks we offer:\n\n- Awesome office in SOMA, San Francisco, close to Caltrain, BART and Muni\n- Transportation: Clipper card\n- Lunch and Happy Hour Fridays\n- Flexible working arrangements\n- Generous medical, vision, and dental coverage\n- Free snacks, drinks, and fruit\n- Weekly massages from professional masseurs","publish_date":"2016-06-02"},{"has_chat":"true","link":"jobs/7geese.html","location":"Vancouver, BC, Canada","published":"May 30","id":5,"title":"7Geese Customer Support Manager","body":"\n7Geese is seeking an energetic and talented Customer Support Manager with a passion for helping customers and a relentless desire to improve customer support best practices.\n\nIn this role, you will own customer support interactions, resources, processes, and strategy. You will work very closely with the Customer Success and Product Development teams to collaborate on support resources and engagement projects.\n\nAt 7Geese, customer support means delighting customers with positive and memorable experiences that provide outcome-based solutions. We believe that finding and seeking help shouldn't be a chore. Do you agree?\n\nStart Date: ASAP\n\n### Our guide to hiring rockstar support teammates:\n\nYou invite scrutiny and exude positivity. Not every interaction is going to involve a ‘yes’, but you believe you can still delight and offer help. Honesty and empathy are your biggest soft-skills.\n\nYou avoid negativity and have integrity. You believe feedback of all kinds can lead to improvement. There are insightful opportunities in every interaction.\n\nYou are proactive and love teaching others. Simply being responsive and giving one-time solutions doesn’t meet 7Geese standards. You value helping others become self-sufficient and enjoy creating structures and resources for learning.\n\n### HERE AT 7GEESE, SUPPORT MEANS YOU...\n- Are a rockstar prioritizer and can communicate priorities to the many people who will need you to help them.\n- Have a natural ability to adapt your tone and expressions to those who you’re helping.\n- Can express complex ideas simply and elegantly. Are not intimidated by technology or terminology.\n- Thrive off learning new things. You want to continuously progress in your role and take on more responsibility.\n- Have the ability to communicate across multiple time zones and cultures. (Don’t worry, you won’t have to work at 1am).\n- Are comfortable with debugging and quality testing. You won’t be coding, but you’re comfortable talking to developers and using products like Github to stay informed with what’s going on with product development.\n- Are excited to work with other 7Geese team members to implement process improvements, resources, and develop kick-ass support practices.\n\n### BREAKDOWN OF HOW YOUR TIME WILL BE SPENT:\n- 50% Reactive support via Intercom (incoming support questions, e-mails, phone calls, and potential visits). You know the product inside and out; other teams come to fact-check things with you like \"Can a person with this permission do this?\"\n- 25% Writing and maintaining content for our learning center and knowledge base. If there's nothing new to update, you're researching new best practices and creating new resources to add.\n- 10% Bug tracking and quality testing. As things get reported, you stay in the know and act as liaison between product development and the customer.\n- 10% Pro-active engagement (re-engagement emails, developing engagement campaigns to help champion our customers through ideal customer journeys).\n- 5% Reporting for monthly and quarterly meetings. Tracking KPIs, suggesting other metrics to track based on our goals, summarizing things like top 3 reasons for tickets in a given time period with suggested solutions.\n\n### YOUR EXPERIENCE!\n- You have a minimum of 1 year customer support experience, preferably in a SaaS / startup environment\n- You have demonstrated superhero like qualities in your current situation and are ready to soar into a new opportunity and take ownership of Customer Support at 7Geese\n- You have experience working in teams and are confident collaborating with others\n- Have exhibited our 3 core value areas: excellence, positivity, and growth\n- Are communication driven with experience explaining complex problems in easy ways\n- Have experience delivering solutions to others that help them move forward\n- Bonus: ability to do product screencasts, basic photo/video editing or graphic design to create content for the support center","publish_date":"2016-05-30"},{"link":"jobs/shopstorm.html","location":"Remote","published":"May 30","id":6,"title":"ShopStorm Customer Success Specialist","body":"\nShopStorm is looking for a Customer Success Specialist to join our fully distributed team. You’ll be responsible for supporting a growing set of Shopify apps which help power thousands of online stores.\n\n### The Role\n\nYou’ll be the primary point of contact for our customers, helping them with problems, and answering questions. As part of a small team, you'll likely get your hands dirty with a little bit of everything. Here are some things you may do on a given day:\n\n- Serve as the key point person for ShopStorm’s customers\n- Help customers by troubleshooting problems and answering questions\n- Install and modify code on customers’ Shopify stores\n- Author technical documentation and blog posts to help our customers help themselves\n- Help our engineering/product leads identify existing pain points and prioritize feature releases\n- Implement processes to improve support and customer satisfaction\n- Monitor social media channels and online forums for opportunities to enhance our brand\n- Assist with marketing and partnership efforts\n\n### About You\n\nYou have that unique combination of technical aptitude and empathy for the user. You’re comfortable with code but prefer to be customer-facing. You’re self-driven with a sense of urgency and draw satisfaction from going above and beyond to provide solutions. You’re an excellent communicator and have the ability to thrive in a distributed environment. Perhaps most importantly, you have a willingness to learn.\n\n### About Us\n\nShopStorm is a small team focused on creating high-quality Shopify apps with exceptional customer service. All types and size of merchants, from the smallest 1-person online shop to large, multinational eCommerce powerhouses rely on our apps to help their businesses.\n\nOur team is part of SkyVerge, an eCommerce software company that builds tools for tens of thousands of merchants across many different platforms. We’re a distributed company with an even gender split that spans 4 US states and 5 countries. We believe in open communication, respect each other’s diversity of thought, and often find that a well-timed GIF or emoji is the best way to communicate. 🐵\n\n### The Requirements\n- To succeed in this position you will have:\n- Experience with HTML / CSS, knowledge of JavaScript a big plus!\n- Native-level fluency in English\n- Fantastic written communication and interpersonal skills\n- An endless curiosity for our products and our users\n- Ability to thrive in a remote environment (along with a reliable internet connection)\n- Availability for 1-2 team trips / year\n- Familiarity with eCommerce or SaaS products\n\n### The Bootcamp\n\nThis is a full-time, salaried position, but hours are flexible. We know your work will speak for itself through delighted customers and well-written documentation and blog posts. However, fit with our team and culture is important.\n\nEvery new team member completes a 60-day Bootcamp as a contractor before becoming a salaried employee. Already have a full-time position? Don’t worry. We’re flexible with hours and schedule during the bootcamp period.\n\n### The Package\nSome of the benefits we're excited to offer to our team members:\n\n- Competitive salary with performance incentives\n- 15 days of paid time-off per year\n- Generous holiday policy including two company holidays: SkyVerge Day in March, Founders Day in June 😀\n- Medical, dental, and vision insurance (reimbursements for comparable care for non-US/Canadian residents)\n- Retirement plan with company match\n- Home office or co-working allowance\n- Hardware and software allowance (we'll set you up with the tools you need to be productive)\n- Personal development allowance to help you learn and grow (e.g. books, courses, conferences)\n- A Kindle to help you keep learning!\n\n-------------------------------\n\nTL, DR: Join our team and influence thousands of online stores. Excited? Us too. Apply now!\n\n\nSkyVerge believes and supports workplace diversity. We do not discriminate on the basis of race, color, religion, gender identity or expression, national origin, age, military service eligibility, veteran status, sexual orientation, marital status, physical or mental disability, or any other protected class.","publish_date":"2016-05-30"},{"link":"jobs/ultralinq.html","location":"New York, NY","published":"May 25","id":7,"title":"UltraLinq Client Services Specialist","body":"\nUltraLinq Healthcare Solutions is hiring for our Client Services team.\n\nClient Services Representatives are the first line of contact for clients needing assistance, and receive a wide variety of requests (technical and non-technical).\n\nCandidate should possess the following qualities:\n• A pleasant demeanor and patient attitude\n• Understanding of the principles and process of troubleshooting\n• A strong focus on customer service with at least 2 years of helpdesk experience\n• Ability to communicate clearly, calmly and in an articulate manner over the phone\n• Excellent written communication skills; including above average grammar and spelling ability\n• Diligence when logging work completed and customer activity in ticketing database (Zendesk)\n• Advanced competency regarding Microsoft Windows XP - 10, Mac OSX, web browsers, Adobe Flash, network configuration, and antivirus/personal firewall software\n• Experience with SaaS and cloud-based products a plus\n• Experience with healthcare industry or products a plus\n• Strong understanding of networking principles (TCP, DNS, DHCP, etc.) and networking hardware configuration; knowledge of VPN setup a plus\n• Must be comfortable working independently\n• Willingness to participate in additional projects as necessary\n\nClient Services Representatives are required to sit for extended periods of time. Client Services Representatives must utilize a computer with a mouse for extended periods of time.","publish_date":"2016-05-25"},{"feature":"true","link":"jobs/activecampaign.html","location":"Australia","published":"May 19","id":8,"title":"ActiveCampaign Platform Specialist - Australia","body":"\nActiveCampaign is a platform focused on email, marketing automation, and sales for small businesses.\n\n### WHAT YOUR DAY COULD CONSIST OF:\n- Assisting users via email, live chat, and phone\n- Consulting with clients to help them utilize our platform to achieve their unique goals\n- Conducting live demos of our platform with screensharing.\n- Keeping on top of the latest news in regards to email marketing, deliverability, and small business marketing in general.\n\n### WHAT IS NEEDED:\n- Past experience with sales and customer service — specifically with SAAS solutions\n- Past experience with email marketing, marketing automation, and/or marketing in general\n- The ability to efficiently respond to a significant number of emails, chats, & phone calls per day (once you are up to speed you should be handling over 100 requests a day)\n- A self-motivated and driven attitude where you will work towards achieving new goals\n- Excellent communication skills & the ability to relate to others\n- Input matters, your work has a high impact, and everyone is working together.\n- Being able to take a general idea and add your own insight and tweaks to it.","publish_date":"2016-05-19"},{"feature":"true","link":"jobs/papertrail.html","location":"Anywhere - remote OK (US, EU)","published":"May 11","id":9,"title":"Papertrail Customer Success Engineer","body":"\n[Papertrail](https://papertrailapp.com/) provides log management as a service. We work with tens of thousands of ops-savvy developers, systems engineers, and entrepreneurs at companies like GitHub, Heroku, Instacart, Adobe, and DNSimple.\n\nThat's where you come in. We've grown to need technical customer support to help customers make the most of Papertrail. Here's a few examples of what customers think of Papertrail's support:\n\nhttps://twitter.com/TiuTalk/status/714592766827872257\nhttps://twitter.com/agmakonts/status/730356796607614976\nhttps://twitter.com/hectcastro/status/717523363032391680\n\n## Summary\n\n* Put smiles on the faces of fellow engineers\n* Remote work is welcome\n* 100% online (email, Slack/Campfire text chat), no phones\n* Startup atmosphere and tools, public company benefits\n\n\n## Okay, cool. What's involved?\n\nHelp customers setup and use Papertrail's service in email and text chat. The questions are about a wide range of topics like Linux, syslog, Web framework logging, Ruby, Rails, IP stack troubleshooting, PHP, REST/JSON, Python, firewall rules, Node.js, plus non-technical topics.\n\nYou almost certainly won't know about all of these. While a strong working knowledge of Linux is required, Googling to satisfy your own curiosity is a lot more valuable (and hopefully, fun). Also:\n\n* Be comfortable and personable in email, even when interacting with strangers.\n* Show a passion for devops tools, Web services, and technology in general. We're doing this because we love it.\n\n## Requirements\n\n* **Working Linux knowledge**. You've compiled a binary, installed packages, and understand TCP/IP concepts. Experience with tools like `tcpdump` or `strace` will help, though it isn't required.\n* **Fantastic casual writing skills**. This job involves helping people in email, forums, and text chat, so a written voice goes a long way. Good grammar is critical, as is a gut feel for when to ignore it in order to make a personal connection. When a friend emails you a question, do you spend 10 minutes Googling and send them a ridiculously thoughtful answer? You'll fit right in. A public online history (like a blog, Stack Overflow/Server Fault posts, GitHub commit history, Twitter account, or casual posts to non-technical online forums) is ideal, since a big part of this job is showing your passion and knowledge for a topic in casual, freeform emails.\n* **Scripting**. Experience in a scripting or programming language, ideally in one or more of Ruby, Python, Go, Java, or C.\n* **Location and timezone**. Able to work in US, Canada, or Europe on a roughly UTC-7 workday. Although we're completely location-agnostic, employment law is not.\n\n\n## Why is this unusually awesome?\n\nIt's the most important thing we do. Happy customers are the only reason why we get to do this every day. Since most of our interactions with customers are via support, this is the most important thing we do every day and the main reason we grow. It's:\n\n* **Flexible.** Papertrail's hub is a Slack text chat channel. Work in a coffee shop without missing office conversation.\n* **Personal**. You'll be part of a tiny team, working side by side with the founders. Debating product decisions is a lot more fun because we're all target users – 100% of Papertrail staff has sent a GitHub pull request.\n* **The tip of the iceberg**. Although answering questions is the must-have, you're welcome to write docs, improve our open-source apps, or grow into coding on the core service. We operate in 3 thriving fields: cloud computing, software as a service, and dev/ops, and the tools we use are in demand: Ruby, Java/Scala, and current open-source libraries.\n* **Predictable**. As part of SolarWinds, Papertrail offers excellent benefits, including paid health insurance and 401(k) match. If you're in San Francisco or Austin, you're welcome to come in to a physical office.\n\n\n## About Papertrail\n\nWe're part of SolarWinds, which includes [Librato](https://www.librato.com/) and [Pingdom](https://www.pingdom.com). You can see some of the things we think about on [@papertrailapp](http://twitter.com/papertrailapp).\n\nSolarWinds (SWI) is on Forbes' lists of [Most Innovative Growth Companies](http://www.forbes.com/growth-companies/list/#tab:rank) and [America's Best Small Companies](http://www.forbes.com/best-small-companies/list/).","publish_date":"2016-05-11"},{"feature":"true","link":"jobs/yeomen.html","location":"US - Remote, must be able to work East Coast hours","published":"May 10","id":10,"title":"The Yeomen Community Support Team Lead","body":"\n### The Company:\nThe Yeomen are a community of support experts who build and staff customized support solutions for companies and organizations. We specialize in creating help desks that don’t just resolve problems, but also foster brand loyalty and growth by cultivating relationships with user communities. Our mission is to bring a human element to support by connecting customers to real people who care about customer concerns and work hard to resolve their issues with compassion, care, and positivity. More information about The Yeomen can be found at theyeomen.com.\n\nThe Yeomen is proud to be a support partner for Vimeo, the leading video platform for creative professionals. We are currently looking for an experienced manager to lead the team of 18 Yeomen support ninjas who engage and support the Vimeo community day in and day out.\n\n### The Job:\nThis is a full time position.\n\nThe Yeomen is based in the United States. This opening is for someone residing within the US that can telecommute from their current location.\n\n### What you’d be doing for support:\n- Answering tech support and customer service questions by email.\n- Troubleshooting video playback issues.\n- Supporting account access for all level accounts (Basic, Plus, & PRO)\n- Helping with billing and purchases.\n- Walking someone through uploading and downloading a video.\n- Educating users of privacy settings.\n- Identifying recurring customer issues, helping to solve them, and escalating them to others for review.\n- Writing customer response templates and online help documentation.\n- Making customers very happy.\n- Having coffee with us.\n\n### What you’d be doing for your team:\n- Liaising between client contact and support team members.\n- Coordinating schedules, including shift rotations and time off requests for three separate shifts.\n- Leading monthly one on one meetings.\n- Developing well-rounded metrics for success and using these to help your team grow professionally.\n- Creating documentation & reporting of performance metrics.\n- Working with members of the team to set and reach career goals.","publish_date":"2016-05-10"},{"feature":"true","link":"jobs/precisionlender.html","location":"Cary, NC","published":"May 9","id":11,"title":"PrecisionLender Client Support Superhero","body":"\nAs a Client Support Superhero, you will support, educate, and empower our clients and end-users so that they can be successful. You will own the client support experience and work to exceed clients' expectations by genuinely caring about them, personally & professionally.\n\n### What Your Superpowers Are:\n- Passionately helping others.\n- Explaining complex issues in beautifully simple terms.\n- Listening way more than you talk and connecting with people.\n- Embracing change & adapting quickly.\n- Managing multiple projects simultaneously.\n- A natural ability to see the full scope of a problem, in order to ask the right questions.\n- Never letting a detail fall through the cracks.\n- Using social media or web-based software, including Twitter, Facebook, Google Apps.\n- Familiarity with common help-desk/ticketing solutions such as Zendesk and Jira.\n\n### How You Will Use Your Powers:\n- Saving clients across the country from any issues they are having.\n- Evaluate, troubleshoot, and follow-up on client issues as well as replicate and document for further escalation.\n- Develop support content including articles, blog posts, videos and other collateral. You may not author all that content, but you will work with our development and consulting teams to identify content needs and get them filled.\n- Being a voice for clients and fighting for their causes.\n- Drive product change and improvement by working with our Product Development team to document changes and improvements to our software and ensure that our Clients are aware of those changes.\n- Foster our community of users to stimulate the sharing of ideas so that we can get our best clients talking to each other and cross-pollinating those ideas.\n\n### Your Experience & Education:\nYou may be fresh out of college or you may have 10 years under your belt - either way, you need to have spent significant time working in a business setting, ideally in areas like customer service, internal and external client support.\nBachelors Degree preferred\n\n### How You Should Apply:\nWe're looking for people who pay attention and care about their future. If you want to be considered for this position, you have to answer the application questions, this is us testing your attention to detail.\n\nThe final step in our hiring process will be for you to arrange personal reference calls with former supervisors as well as others we may choose. If you're awesome, that part will be easy.","publish_date":"2016-05-09"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"May 5","id":12,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2016-05-05"},{"feature":"true","link":"jobs/harvest.html","location":"NYC or Remote","published":"May 5","id":13,"title":"Harvest Expert","body":"\n*Disclaimer: Don't judge us too quickly! We've made some intentional typos in this job post. See our To Apply section for more info.*\n\n### About Harvest\nHarvest creates well-crafted, useful software to help small businesses work better. Today we’re a group of folks <a href=\"http://www.getharvest.com/made-on-earth\">all over the globe</a> serving tens of thousands of awesome companies from over 100 countries. We are a team of humble and talented people who genuinely <a href=\"http://www.getharvest.com/blog/2012/05/on-craftsmanship/\">care about our craft</a> and demand the highest quality.\nOur customers love Harvest for our great products and legendary support, delivered by our Harvest Experts: wicked-smart human being, empathetic problem-solvers, and patient trouble-shooters.\n\n### About You\n- You’re patient and enjoy solving tough problems. You take pride in explaining and helping others understand problems and solutions.\n- You’re an exceptional communicator and you treat people kindly. You can gracefully break down, solve, and explain, even the most complex problems. Listening, talking, and working with people makes you happy.\n- Your writing skills are flawless. We mean it. You must have a savvy style and a firm grip on grammar.\n- You can de-escalate a tense situation with ease and grace—working through a tough issue or bug with an upset customer not only doesn’t scare you, it’s a challenge you’re eager to take on.\n- You’re a hard worker with a history of getting things done carefully and efficiently. You’re thorough—no detail go unnoticed. You’re self motivated, but also enjoy contributing to a team.\n- You have the ability to switch gears quickly and readjust your focus appropriately.\n- You don’t mind doing the same thing from day to day. You’re also comfortable jumping onto a side project when the occasion arises and aren’t scared to tackle the new and unknown.\n- You're happy to work East Coast US business hours of 9am-5pm, give or take an hour in either direction.\n\n### What You'll Do\n- Learn the ins and outs of Harvest, Harvest Forecast, and are associated apps and integrations.\n- Answer 20 to 50 customer emails and 10 to 15 phone calls per day.\n- Troubleshoot technical issues in Harvest and help developers diagnose bugs.\n- Host webinars for and answer questions from prospective Harvest customers.\n- Create lively and creative written and video documentation for Harvests Help Center, and keep this documentation up-to-date.\n- Participate in product development by sharing customer feedback and your unique perspective as a Harvest Expert.\n- Treat our customers with sincerity, kindness, and respect, and think of new ways to impress, delight, and surprise them.\n\n### To Apply\n- Email us at <a href=\"mailto:customersupport@getharvest.com\">customersupport@getharvest.com</a> with the subject line \"Harvest Expert - _______\" (fill in your favorite animal).\n- Tell us a bit about yourself and why you you’d make a great Harvest Expert.\n- You’re awesome and can work anywhere… why Harvest?\n- Whoops! We made a few grammatical mistakes in this job post. Let us know what they are.\n\nDue to the high volume of applications we receive, we won’t be able to respond to everyone. While we appreciate your enthusiasm, there’s no need to send follow up emails—if we think you’re a good fit for the team, we’ll be in touch!\n\nNo phone calls, please.","publish_date":"2016-05-05"},{"has_chat":"true","feature":"true","link":"jobs/mailchimp-early.html","location":"Atlanta, GA","published":"Apr 28","id":14,"title":"MailChimp Customer Support Technician - Early Morning Shift","body":"\nMailChimp is the world's leading email marketing service. More than 10 million people and businesses use MailChimp to design and send 1 billion emails a day. We empower small businesses with a suite of powerful and easy-to-use email, marketing automation, and analytics tools that integrate with hundreds of popular applications and services.\n\nMailChimp’s Customer Support team works around the clock to help users all over the world via chat and email support. Our support agents are extremely smart and slightly weird, and we’re looking to grow their ranks. We’re looking for someone who’s self-motivated, with excellent communications skills and high empathy. Tech-savviness is great, but more important is a strong desire to serve users and a willingness to learn all the ins and outs of the MailChimp app. This position is for our early morning crew, which works Monday through Friday, 5am to 2pm.\n\n### Responsibilities\n- Efficiently and effectively answer users’ software and technical questions\n- Perform root cause analysis and determine appropriate course of action\n- Contribute to MailChimp’s Knowledge Base via technical and process support documentation\n- Identify trends in users’ issues with the app and communicate them to supervisor\n- Partner with Support team members on strategic projects as needed\n\n### Requirements\n- 1 or more years experience in technical support and/or customer service\n- General curiosity about how and why things work the way they do\n- Ability to quickly learn and articulate technical concepts\n- Ability to empathize with users and convey confidence through written interactions\n- Well-versed in chat and email etiquette, with a fine-tuned attention to detail\n- Ability to multitask and handle multiple support tickets at once\n- MailChimp is a founder-owned, highly profitable, and private company located in the heart of Atlanta. We offer our 500+ employees an exceptional workplace, extremely competitive compensation, fully paid benefits (for employees and their families), and generous profit sharing. We hire humble, collaborative, and ambitious people, and give them endless opportunities to grow and succeed.\n- We love our hometown and support sustainable urban renewal. Our office is in the historic Ponce City Market, right on the Atlanta Beltline. If you'd like to be considered for this position, please apply below. We look forward to meeting you!\n- MailChimp is an equal opportunity employer, and we value diversity at our company. We don’t discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n","publish_date":"2016-04-28"},{"has_chat":"true","feature":"true","link":"jobs/mailchimp.html","location":"Atlanta, GA","published":"Apr 28","id":15,"title":"MailChimp Customer Support Technician - Overnight Shift","body":"\nMailChimp is the world's leading email marketing service. More than 10 million people and businesses use MailChimp to design and send 1 billion emails a day. We empower small businesses with a suite of powerful and easy-to-use email, marketing automation, and analytics tools that integrate with hundreds of popular applications and services.\n\nMailChimp’s Customer Support team works around the clock to help users all over the world via chat and email support. Our support agents are extremely smart and slightly weird, and we’re looking to grow their ranks. We’re looking for someone who’s self-motivated, with excellent communications skills and high empathy. Tech-savviness is great, but more important is a strong desire to serve users and a willingness to learn all the ins and outs of the MailChimp app. This position is for our second shift overnight crew, which works Tuesday through Friday, 8pm-6am.\n\n### Responsibilities\n- Efficiently and effectively answer users’ software and technical questions\n- Perform root cause analysis and determine appropriate course of action\n- Contribute to MailChimp’s Knowledge Base via technical and process support documentation\n- Identify trends in users’ issues with the app and communicate them to supervisor\n- Partner with Support team members on strategic projects as needed\n\n### Requirements\n- 1 or more years experience in technical support and/or customer service\n- General curiosity about how and why things work the way they do\n- Ability to quickly learn and articulate technical concepts\n- Ability to empathize with users and convey confidence through written interactions\n- Well-versed in chat and email etiquette, with a fine-tuned attention to detail\n- Ability to multitask and handle multiple support tickets at once\n- MailChimp is a founder-owned, highly profitable, and private company located in the heart of Atlanta. We offer our 500+ employees an exceptional workplace, extremely competitive compensation, fully paid benefits (for employees and their families), and generous profit sharing. We hire humble, collaborative, and ambitious people, and give them endless opportunities to grow and succeed.\n- We love our hometown and support sustainable urban renewal. Our office is in the historic Ponce City Market, right on the Atlanta Beltline. If you'd like to be considered for this position, please apply below. We look forward to meeting you!\n- MailChimp is an equal opportunity employer, and we value diversity at our company. We don’t discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n","publish_date":"2016-04-28"}]