[{"has_chat":"true","link":"jobs/1password.html","location":"Remote","published":"Feb 7","id":1,"title":"1Password Herald of Support","body":"\nHey there! It’s Jacob at AgileBits, makers of [1Password](https://1password.com/company). Let’s get acquainted.\n\nAt some point in their life, everyone forgets one of their passwords. It’s an inevitable event. When they do, they usually change it to be more memorable, which means it’ll be easier to guess or crack. Our goal with 1Password is to make remembering and managing passwords a thing of the past. We built 1Password to make security accessible and easy, not distant and arduous.\n\nIt’s a noble pursuit, remembering passwords for people. With everything the app does, it can always do better. Every day, we speak with hundreds of our customers about their experience with 1Password, and we use that to improve it for everyone. We’re a team of just over 70 right now, and we’re looking to add even more wonderful ‘bits.\n\nFor all of us here at AgileBits, building and supporting 1Password is a dream job. Doing new things is the core of our culture, and we embrace it each day. Everyone in the company does customer support once a week, and we all brainstorm ways to make our customers’ experience better. Once a month, we have an all-hands call for the whole company to rally on the same page. We even go on an annual cruise to ponder the next 12 months of the journey, and to get to know each other in person. 👋\n\nAs a Herald of Support, you could be the first voice of AgileBits someone has heard, or you could be the bridge between them and the development team. You could find yourself helping with a sign-in issue in the morning and updating our troubleshooting article for it in the afternoon. We are, after all, quite an [agile](https://en.wikipedia.org/wiki/Agile_software_development) bunch, and we get excited about _doing_.\n\n## What you might do\n\n- Help new and existing users have a great experience using 1Password.\n- Send well-written responses to customers, around 60 a day when you're up to speed.\n- Document new features and common questions in our knowledge base.\n- Be the voice of our customers internally: see that the top issues and requests each week are heard by the development team.\n- Learn how we do support as a remote company, and make it even better with your voice.\n- Try new things: we're agile, so new tools and ideas float around every few weeks.\n\n## What you have\n\n- Passion to help, love, and understand people, even the tough ones.\n- A knack for finding the cause of an issue, and the audacity to keep trying if you're wrong.\n- Adaptive explanatory skills that get people to understand, not just hear, what you're saying.\n- A personality that makes people smile and is delighted when they do.\n- Humility to ask for help when you aren't sure about something.\n- Optimism and positive written tone, even when it's raining and you forgot your umbrella (free shower!).\n\n## What you might also have\n\n- Polyglottism! You could go to France or Germany for a week and jump right in to conversation, or do that from your computer, with a French riviera as your wallpaper.\n- Personal experience with 1Password.\n- A peculiar desire to inspect things, particular elements of the web, often built of chrome or found in a safari; occasionally beside a fiery fox within an opera.\n- Building upon the previous point, you may even enjoy a cup of java while writing your script for the next production.\nIf you're a match\n\nSounding like a good fit? Let's start a conversation and see where it goes.","publish_date":"2017-02-07"},{"has_chat":"true","feature":"true","link":"jobs/illuminate-education.html","location":"Irvine, CA (Pacific Time) and Remote (Eastern Time)","published":"Feb 2","id":2,"title":"Illuminate Education Support Specialist","body":"\nWe're looking for a few friendly Support Specialists to join our team. You'll have the opportunity to support a great product, make a difference in the education community, and work with some really amazing people.\n\n### A typical day involves:\n- Helping teachers and educators use Illuminate's products to make a difference in student's lives.\n- Handling problems using the software, providing timely workarounds for our clients, and documenting issues for the development team so we can continually make our products better.\n- Being the friendly \"voice of Illuminate\" to our clients on the phone.\n- Providing clear, timely, helpful responses to email requests.\n- Collaborating with Illuminators on other teams (implementation, data, development, etc.) to make sure our clients get the best support possible.\n- Continually learning and growing so you can be a better support specialist, and a better human being!\n\n### Being a support specialist requires:\n- Amazing people skills\n- Excellent verbal and written communication skills\n- Motivated, self-directed learner\n- Strong problem-solving/troubleshooting skills\n- Strong technical aptitude\n- Must be a quick learner\n- Good sense of humor\n- Efficient office work habits\n- Ability to work independently and in a team\n\n### Meet Illuminate:\nIlluminate Education is a rapidly growing EdTech, SaaS provider founded by educators, for educators. We offer next-gen web-based software tools for the K12 market. Our streamlined suite of products is a one-stop solution for comprehensive data management and analysis, enabling users at every level of the educational system – county, district, site, classroom, student and parent – efficient access to the information essential to their success.","publish_date":"2017-02-02"},{"link":"jobs/jhana.html","location":"San Francisco OR remote!","published":"Jan 30","id":3,"title":"Jhana Support/Ops Engineer","body":"\nThe mission that gets us out of bed in the morning is simple: help millions of people get the great manager they deserve. People’s relationships with their managers are a major driver of job satisfaction. With good managers, teams and companies thrive. With bad managers, teams and companies implode. That’s why we built a web application to help managers be effective people leaders.\n\nWe’re a high-performing team of entrepreneurs and deep thinkers who get really excited about ideas and learning. And with more than 50 delighted customers (including FitBit, Etsy, Carfax, and Glassdoor), we’re well on our way to building a strong, sustainable enterprise SaaS company.\n\n### About the job:\nYou’ll be our first in-house engineering hire — a huge opportunity to lead the company in scaling our technical onboarding and support processes. You’ll also be collaborating with our platform development agency and product and client success teams to develop a secure, seamless, and downright awesome experience for managers.\n\nThis often means collaborating and coordinating with multiple stakeholders, from a client’s IT department to our own non-technical writers. If you’re the type who’s motivated by translating people’s real-world problems into technical solutions that users love — and doing so seems all the more exciting in an ever-evolving startup environment — then you’ll probably like it here.\n\n### Responsibilities:\n- Manage technical onboarding and support for new Jhana customers.\n- Provide first response Jhana SaaS product and platform support for customers.\n- Work with our Platform team to design and code platform innovations.\n\n### Requirements:\n- 4+ years support and full-stack development experience with PHP/MySQL, JavaScript, and HTML5 at a minimum.\n- Demonstrable understanding of WordPress standards, database structure and security, custom theme development, custom widget development, and responsive mobile WordPress theme development and testing.\n- Experience working in an agile development environment.\n- Has a people-person side, enjoys communicating with a range of stakeholders (clients, internal teams, IT staff, and non-technical people).\n- You’re self-motivated, collaborative, adaptable and excited about building, fixing, and improving a fast-changing startup.\n\n### Benefits:\n- The opportunity to move the needle and to see the immediate impact of your work\n- Competitive salary\n- Generous stock options\n- Company-paid medical and dental coverage\n- Discretionary paid time off: we treat employees like responsible, trusted adults, giving the flexibility needed manage their work and personal lives\n- Remote-work friendly company culture\n- Personal learning and professional development budgets\n- 401(k)\n- Dog friendly office\n\nWe value diversity\nJhana is an equal opportunity employer, and we're actively recruiting diverse candidates from a wide range of backgrounds and experiences.","publish_date":"2017-01-30"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Jan 16","id":4,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2017-01-16"},{"has_chat":"true","feature":"true","link":"jobs/codeship.html","location":"Boston/Vienna/Remote (UTC+2 to UTC-8)","published":"Jan 16","id":5,"title":"Codeship Senior Customer Success Engineer","body":"\nAs more and more teams are using Codeship for their Continuous Integration and Continuous Delivery needs, we are looking to extend our Customer Success team. When our users are having problems, they’ll contact our support team, and it is our job to make sure to help them and solve their issues in a timely manner.\n\nYour primary responsibility will be to work with our users to resolve their support tickets. Those tickets cover all possible topics from workflow specific questions to issues with their build, their Codeship setup or bug reports and feature requests. You will work closely with our Product and Engineering teams to provide feedback and help improve the customer experience. You will also make sure our documentation is up to date with current information as well as extend and improve articles.\n\nCodeship works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events.\n\n### Responsibilities\n- Assisting customers with solving problems they experience with Codeship and their project setups.\n- Communicate customer feedback and requirements to Product Management teams.\n- Update and extend Codeship product documentation as well as write documentation for upcoming features.\n\n### Qualifications\n- Excellent problem-solving skills\n- Prior experience providing technical support\n- Familiarity with at least one programming language (Ruby, Python, Go, …)\n- Understanding of continuous integration and automated software testing\n- Familiarity with a modern web application stack (Rails, Django, AngularJS, …)\n- Enthusiasm for working directly with customers\n- Stellar English verbal and written communication skills\n- Familiarity with Git and GitHub or Bitbucket\n\n### Bonus Points\n- B.S. in Computer Science or a related field is strongly preferred\n- Previous experience as a Software Engineer or an Operations Engineer\n- Familiarity with LXC and/or Docker\n\nSee also <a href=\"https://codeship.com/jobs?gh_jid=247010\">https://codeship.com/jobs?gh_jid=247010</a>","publish_date":"2017-01-16"},{"link":"jobs/everystay.html","location":"London, Soho","published":"Jan 16","id":6,"title":"Everystay Customer Success Manager (German)","body":"\nEveryStay is a brand new start-up looking to make its mark in the 90$bn global holiday rental industry. We are on a mission to create a lean and easy to use platform for connecting owners with guests. Both user groups at the centre of everything we do.\n\nAs the Customer Success Manager, you will be one of our first recruits and be essential to the build up and launch of our customer support and engagement system as well as ongoing improvement and expansion of our platform. With a passion for problem solving, you will use your experience, knowledge and communication skills to create a great customer experience and drive user engagement and help us achieve commercial success.\n\nYou have done this sort of thing before and can give active input into how we setup our processes in dealing with our customers so that it is in line with the EveryStay brand.\n\nThe majority of our audience is German speaking so fluency in German is a must.\n\n## Responsibilities\n- Respond to inbound requests from both property owners and travellers using email and phone\n- Setup FAQs and guidelines on how we deal with user queries\n- Play a crucial role in automating our processes as much as possible, while not compromising on service\n- Train and manage additional colleagues as necessary\n- Maintain a single customer view\n\n### Requirements\n- Demonstrated expertise in a previous role, ideally in the travel industry\n- Minimum 2 years of professional experience\n- Native German language skills, excellent English language skills.\n- Ability to think about your role in terms of greater business context\n- Ability to train, motivate and lead direct reports\n\n### Desired (not required)\n- Experience with tools like Hubspot, Salesforce, Zendesk is a plus\n- Excellent verbal and written presentation skills\n- Knowledge of one other European language is a strong plus","publish_date":"2017-01-16"},{"link":"jobs/customerio.html","location":"Remote (United States or Canada)","published":"Jan 10","id":7,"title":"Customer.io Technical Support Engineer","body":"\nHello, future addition to Customer.io! We’re looking forward to getting to know you better, but you probably want to know what you’re getting yourself into. You can check out our careers page, or read on.\n\nAt Customer.io, our mission is helping businesses talk like people. Today, we do this with messaging software that allows businesses with large user-bases to send targeted, more relevant communication at scale. Our customers include Shutterstock, DigitalOcean, Handy, and Watsi.\n\n### A day in the life of a Technical Support Engineer\nA Technical Support Engineer at Customer.io helps new and existing customers get up and running in our product, diagnose tricky situations in the product, and achieve their business goals. Our customers are core to everything we do (it’s in our name!) and a Technical Support Engineer has contact with more customers than anyone else in the company.\n\nWhile support tickets may take most of your day, you’ll also work on internal and external documentation and have regular touch points with our Product and Customer Success teams to discuss feature requests, usability issues and user scenarios. You’ll bring your passion for customers and their problems to advocate for product improvements and provide insight that will help us make sure we build the right thing.\n\nTechnical Support Engineers develop deep product, systems and customer knowledge. In the long run there are opportunities to apply that to automate processes and create internal tools or to join our Customer Success team which helps our high revenue customers make the most of our product. We have many new features to build and ideas to implement, so there will be plenty of exciting challenges ahead.\n\nToday the Technical Support team is powered by Help Scout for tickets, Github Issues for bug tracking and Zapier to help automate some of our support processes.\n\nAlthough, we mostly interact with each other through Basecamp and Slack and value focused work, we’re not afraid to jump on a Screenhero pairing session or a video call to clarify customer scenarios or share tips on how to troubleshoot issues better.\n\n### We’re the right match for you if:\n- You love technical problem solving\n- You enjoy helping others with your technical knowledge and take pride in your work.\n- You see every support ticket as an opportunity to improve the customer experience.\n- You take ownership of delivering results and get satisfaction from getting things done.\n- You’re passionate about learning new things.\n- You’re not afraid to ask questions if you’re confused about how something works.\n- You understand written communication is not always perfect and assume the best intentions during interactions with customers and your team. Empathy is one of your strongest attributes.\n\n### What we look for:\n- At least 2 years customer support experience.\n- Experience working remotely (it’s not your first time holding a full-time or part-time remote job).\n- HTML & CSS knowledge (just enough to troubleshoot and fix issues reported by customers).\n- Understanding of basic programming concepts (API, variables, if-else statements, loops, etc.). If you know some Javascript too even better!\n- Experience working with or supporting email marketing/ business communication tools preferred.\n- Located in the United States/ Canada or willing to work US Eastern or Pacific hours.\n\n### Why should you work with Customer.io?\n\nWe want to enable you to do your best work, and this is how we aim to do that—\n\n<b>Salary:</b> We are offering salary of $70,000 USD for this position.\n\n<b>Equity:</b> You’ll own a piece of the company. It's not a get-rich-quick deal, but if you stay around for a while, we're planning to be a long-lasting company, and your piece of it may be a nice bonus.\n\n<b>Big impact:</b> Our team is small, but growing quickly. The work you do will materially impact how successful we are as a company, both with our product and our culture.\n\n<b>Great tools:</b> Everyone in the company has a budget for a great computer, motorized standing desk, Steelcase Leap office chair, external monitor, and anything else you'd like to get your job done.\n\n<b>Health benefits:</b> We pay 100% of your premiums for medical, dental and vision.\n\n<b>Retreats:</b> We want everyone in our company to connect in person whenever possible, so we get everyone together once a year. We've had retreats in Barcelona, Romania, and Hunter Mountain, NY.\n\n<b>Vacation:</b> Rest and recuperation are important. We offer unlimited paid time off with a two week minimum per year.\n\n\n### Diversity at Customer.io\nAt Customer.io, we’re committed to building a diverse environment, and encourage minority applicants. So far, we have team members in Scotland, Germany, Canada, and all over the US. Our CEO and CTO grew up in Singapore and Arkansas respectively, but met in New York City. Our company culture is always evolving; people from different backgrounds bring valued perspective and thoughtfulness to the work that we do and the culture we foster.\n\nCustomer.io provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Customer.io complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Basically, we follow the law, but also like you for who you are!\n\n### Intrigued? Talk to us!\nApply with your resume, and make sure you tell us why you’re interested in the position! We’ve added a few questions that will also help us understand how you think.","publish_date":"2017-01-10"},{"link":"jobs/aircall.html","location":"New York","published":"Dec 7","id":8,"title":"Aircall Customer Support Hero","body":"\nYou'll join the US business team to ensure that the customers we work with have a great experience. You will be the first point of contact and advocate for clients.\n\n\n### What are the responsibilities:\n- Be the voice of Aircall - you will be on the front lines! This involves flexing your amazing troubleshooting skills via phone calls, emails, and live chat.\n- Provide swift and thorough solutions for customers. When absolutely unable to do so, escalate to the dev/tech team.\n- Take note and relay customer feedback and insights to Aircall's internal teams such as the tech, marketing and product teams, in order to constantly improve the customer experience.\n- Maintain an expert-level knowledge of our products and internal management systems as well as curiosity and awareness of new initiatives within in the industry.\n\n\n### What we are looking for:\n- You have at least 1+ year of experience in Support and are passionate about it.\n- You are technical and problem solver. UDP/TCP ports, REST API and packet losses do mean something to you.\n- You have a “no task is too small” attitude and the endurance to consistently deliver amazing customer experiences without exception.\n- You have superior written and oral communication skills.\n- You have strong people skills — you are friendly, a good listener, you ask good questions, and you're energized by personal interaction.\n- You are a team player who works well with a wide range of personalities and is ready to contribute to an awesome team environment.\n\n### Brownie points:\n- You have a sense of humour and know how to make fun of yourself.\n- Flexibility with schedule to meet the needs of the business.\n\n### What are the benefits of working here?\n- All the caffeine you need to keep you going\n- Medical/Vision/Dental benefits\n- Tax-free commuter benefits\n- Your metrocard reimbursed\n- Gym reimbursement\n- Shiny new Mac gear!","publish_date":"2016-12-07"}]