[{"has_chat":"true","link":"jobs/ginger-labs.html","location":"San Francisco, FiDi","published":"Feb 18","id":1,"title":"Ginger Labs Customer Experience Agent (iOS/Mac)","body":"\nNotability is used by millions of people around the world for capturing and reviewing information on iOS and Mac. We want you to help us deliver Notability to more people, across more platforms, and make it even easier and more fun to use.\n\nWe are looking for a Customer Experience Agent to provide technological expertise and educational support to our customers. You are an optimistic and attentive teammate who listens to customers, figures out what really matters, and you are resourceful enough to troubleshoot problems and get things done. An excellent communicator and lifelong learner, you see documentation and metrics as a way to recognize patterns and improve processes. You want to make people unexpectedly happy and leave them better than you found them.\n\nYou are an optimistic and attentive teammate who listens to customers, figures out what really matters, and focuses on finding solutions. An excellent communicator and lifelong learner, you see documentation and metrics as a way to recognize patterns and improve processes. You want to make people unexpectedly happy and leave them better than you found them.\n\n### Responsibilities:\n- Serve as one of the first points of contact for customers’ questions and feedback.\n- Diagnose bugs and elevate them to quality assurance and engineering as needed.\n- Articulate customers’ needs and interests during internal product planning discussions.\n- Write and maintain clear public support content such as FAQs and troubleshooting guides.\n- Identify and act upon opportunities to improve any and all aspects of customer experience.\n- Identify customers whose attention to detail and passion for Notability make them good candidates for our beta testing team.\n- Manage high volume of customer support requests via email and an occasional phone call, using empathy and logical reasoning to help answer questions and troubleshoot problems.\n\n### Desired Skills and Experience:\n- Articulate, personable, and reliable with excellent writing skills and email etiquette.\n- 1-3 years of online customer support experience with previous experience in software a plus.\n- Experience using support services such as Zendesk, Help Scout, Groove, etc.\n- Works well under pressure and tight deadlines within a fast-paced startup.\n- Passionate about technology and providing incredible experiences for customers.\n- Bachelor's degree with a background in a quantitative or computer science.\n- Bonus points for programming experience.","publish_date":"2017-02-18"},{"has_chat":"true","link":"jobs/resinio.html","location":"Remote","published":"Feb 17","id":2,"title":"resin.io Technical Content Lead","body":"\nResin.io provides a software platform that helps developers build, deploy and manage code on connected devices. In short, we make IoT work.\n\nOur technology is open, standards-based and proven in production across a wide range of scenarios from drones, 3D printers, point-of-sale devices, tidal turbines, skyscrapers and more. Our investors include DFJ, Aspect Ventures, GE, and Ericsson.\n\n### ABOUT THIS ROLE\nAs our user base grows and our platform gets more sophisticated, we’re creating a role for a technical content lead to explain what resin.io is and how to use it successfully. You’ll champion our efforts to create understanding about resin.io and lead the charge on technical documentation. You’ll work closely with our design, development, product and support teams to understand and communicate about the platform to our users.\n\n### RESPONSIBILITIES\n- Manage our docs from end to end. Document new features, maintain existing docs, organize the structure and flow of our docs, and ensure accuracy, clarity, and consistency across all of our technical documentation, including GitHub repos.\n- Write content such as blog posts, forum posts, white papers, and website copy to explain our product features, design principles, and architecture to users.\n- Create tutorials, projects, examples, and screen capture videos to demonstrate our platform.\n- Help design the user onboarding experience and ongoing user education programs.\n- Work closely with the product and development teams to understand technical details and their implications for users.\n- Measure our success in helping users understand resin.io, share progress with the team, and find ways to improve.\n\n### REQUIREMENTS\n- Excellent writing and communication skills. You turn complicated technical details into clear and interesting material.\n- Able to dive deep while keeping the big picture in mind. You can create lots of great content while seeing how it fits into our overall story and broader goals.\n- Able to work with developers to gather technical details. Like a journalist, you ask questions to get to what’s most important for users to know.\n- Organized, thorough and pay close to attention to detail. You’re the person who will submit a pull request to fix a typo.\n- Self-motivated and able to set direction and priorities. You can be incredibly productive without much oversight and know where your time is best spent.\n- Skilled at learning and teaching new concepts. You don’t need to be a developer, but you do need to speak the language of software, build a basic understanding of resin.io products, and be able to teach others about our technologies.\n- Able to understand the product from a user’s perspective and explain features in a way that users will appreciate.\n- Fluent in written and spoken English.\n\n### Nice to have:\n- Experience with resin.io-related technologies (e.g. Docker, Linux, IoT devices like the Raspberry Pi).\n- Interest in trying your hand at hardware projects.\n- Experience writing technical docs, blog posts, briefs, and white papers - writing samples welcome!\n- Experience in user-facing roles (e.g. quality assurance, support, development, product, experience design).\n\n### BENEFITS\n- Work with a talented, diverse team\n- Remote-friendly\n- Flexible working hours\n- Flexible vacation policy\n- Annual company gathering at an international location\n- New computer and equipment of your choice\n\n### WORKING AT RESIN.IO\nOur team is distributed around the world, at more than 15 different locations, and embraces a remote-first culture with flexible hours. This means that team members can be highly productive while still maintaining a healthy work-life balance.\n\nYou can expect to work on interesting and increasingly challenging projects here. You’ll also have a say in what you work on and how you achieve your goals.\n\nWe have a culture that assumes positive intent while driving one another towards excellent results. We value direct and open communication. We are also an equal opportunity employer and value diversity. We maintain a work environment in which team members are treated with respect and in which thoughts and ideas can be shared openly.\n\nWe actively seek out candidates with different backgrounds, experiences, abilities and perspectives. If you are not sure if this is the role for you, please ask us.","publish_date":"2017-02-17"},{"has_chat":"true","link":"jobs/seatgeek.html","location":"NYC","published":"Feb 16","id":3,"title":"SeatGeek Customer Experience Specialist","body":"\nDo you love helping people? Are you smart, humorous, and creative? Are communication and working under pressure two of your best skills? If you answered \"yes\" to all of the above, keep reading!\n\nAs a member of our Customer Experience team, you'll be the voice of SeatGeek. You'll interact with customers through phone calls, emails, live chat and social media to resolve their issues and stay in the know about SeatGeek's latest features. We are passionate about providing ridiculously good customer service, and our CX folks are some of the best and brightest in the industry.\n\nRight now - we are looking for CX Specialists who can commit to weekend shifts from 10-6 on Saturday and Sunday. The more flexible your schedule, the better!\n\n### Who you are\n- You have a bachelor's degree.\n- You are genuinely interesting, personable and intelligent. Current members of SeatGeek team include a former beekeeper, opera singer, gourmet hot dog vendor and an Olympic-hopeful fencer.\n- You love live events and understand that purchasing tickets to see your favorite band is not the same as buying a stapler. In other words, you can empathize with SeatGeek customers.\n- Prior experience working in CX. A tech startup is a major plus.\n- You aren't intimidated by numbers and understand the value of using data to make intelligent decisions.\n\n### What you'll do\n- Be the first point of contact for customer questions through phone, email, live chat, and social media (even on the weekends!).\n- Use metrics and consumer insight to help make SeatGeek better.\n- Consistently go above and beyond for our customers (think generous refunds and unexpected gifts, just because!).\n- You are a people person and are known to carry on a conversation with anyone.\n- You are passionate about technology and user experience.","publish_date":"2017-02-16"},{"link":"jobs/kayako.html","location":"anywhere","published":"Feb 14","id":4,"title":"Kayako Customer Support Advocate","body":"\nKayako is seeking a Customer Advocate to join our Customer Support team. We have offices in Gurgaon and London, but you’re welcome to work from anywhere with an internet connection!\n\nKayako is one of the leading customer service platforms, used by more than 30,000 organizations to deliver a better customer experience to millions of customers. We believe that customer support is more than just answering questions - we directly impact business goals through providing feedback to our product team and driving customer success. Our support team is one of the main reasons for our success and we want to be role models for our customers.\n\nWe believe traditional help desk software prevents great customer experiences by depersonalizing customers and disempowering teams. That’s why we built Kayako, the unified customer service platform, to help teams work better together to deliver better, personalized and memorable experiences to their customers at scale.\n\nAs the flag-bearer of the next level of customer experience in the industry, we are looking for someone who is not deterred by the road blocks and instead enjoys the challenge and keeps moving forward. Someone who doesn’t believe in following the herd. Someone who is proactive and enthusiastic, passionate, super friendly, well-spoken and energetic. A good sense of humor is also always a plus.\n\nYou'll love this role if you get your kicks by helping others. We’re looking for someone who loves solving problems and creating long term customer relationships. This is a great opportunity if you care deeply, genuinely and passionately about customer support and about the role it plays in making a customer-centric team successful.\n\n### Responsibilities and goals you’ll own:\n- Respond to and resolve customer queries through chat, email and the community forum quickly and effectively.\n- Educate and empower our customers to get better at customer support through Kayako\n- Become an expert on Kayako features and capabilities\n- Drive our Voice of the Customer program to advocate for the customer and improve Kayako through incorporating user feedback\n- Escalate critical support issues to the appropriate internal channel\n- Help to develop the customer support profession through sharing knowledge, contributing to blog posts, experimenting with new innovations and discussing best practices.\n- Assist in creating first-class Help Center documentation\n- Increase customer satisfaction and build loyalty through providing amazing, personal customer support.\n\n### Who will love this job:\n- You like making things easier for customers and colleagues. If there’s a roadblock, you want to smooth it away.\n- You are energised by interacting with and helping people. You know that everyone has trouble sometimes, and seek to empower and educate our customers.\n- You love reading and learning about new ways of doing things. There’s always a better way.\n- You’re a positive person and know how to look on the bright side.\n- You bring solutions to the table not just problems. (But you aren’t afraid to point out where we’re going wrong).\n- You’re comfortable with a little chaos and uncertainty. We move fast and sometimes decisions are made without all of the information.\n\n### Experience and requirements:\n- Excellent verbal and written communication skills\n- Ability to solve problems logically and critically\n- 1+ years in online customer support, preferable supporting a SaaS product\n- Demonstrate effective time management and organizational skills\n- A strong understanding and working knowledge of the internet and technical concepts (eg. you understand the terms HTML, browser and cache)\n\n### Reasons why you’ll love working at Kayako:\n- Stock options - we want everyone to be invested in the success of their work.\n- Unlimited PTO - take time off as you need it.\n- Pension - we’ll contribute to your pension so you can plan for the future.\n- Private health insurance package - including a 50% discount gym membership, because we want to be and stay healthy.\n- Choose your own gear - we want you to have all the tools you need to do the work best.\n- Flexible working hours - we love spending time in the office together and think we’re at our best in-person, but we’re realistic and flexible about it.\n- Family friendly - we operate a childcare vouchers scheme for all our employees.\n- Monthly on-site massage - yes, we have someone come in once a month. No, it’s not weird.\n- Fully stocked fridge and pantry - keeping you going. Standard.\n- Weekly craft beers and wines - every Friday. No reason or explanation needed. And we won’t judge you if you wanted to start on Thursday, either.\n- Weekly fruit delivery - to compensate for the weekly beers.\n- Weekly team lunches - because we like food, and we love bonding over it.\n- Regular learning opportunities - from Lunch n’ Learns to opportunities to attend the best industry events, we want you to grow in every way possible.\n\n(*please note some of these apply to UK office based staff only)\n\nEqual opportunities (it is boilerplate, but we believe it)\nKayako is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability or age.\n\n### About Kayako\nWe've brought customer service a long way. We started out with an ambitious goal: a better online customer support experience. Today, tens of thousands of businesses deliver better, personal customer service to millions of customers using Kayako. We are on a mission to completely revolutionize the way businesses support and build relationships with their customers. Why do we care? Because life's too short for bad customer service. Does that pique your interest? Drop us a line.","publish_date":"2017-02-14"},{"has_chat":"true","link":"jobs/coinbase.html","location":"San Francisco, California, USA","published":"Feb 10","id":5,"title":"Coinbase Manager, Customer Success","body":"\nOur mission at Coinbase is to create an open financial system for the world. As the Customer Success Manager at Coinbase you will shape what Success means in the future of finance. You will use direct outreach, data analysis, and customer narratives to shape an ideal Coinbase customer experience for millions of users across the globe. You will reach out to our customers to help them get the most out of the product and relay their feedback to the product team. You will research and understand how diverse segments of customers stumble and you’ll devise solutions to suit their needs. As the role evolves, you’ll create and manage a Customer Success Team from the ground up where you’ll act as a force multiplier.\n\n### Responsibilities:\n- Advocate for millions of Coinbase customers by identifying points of friction\n- Track customer engagement and map insights to product actionables\n- Combine hard data and customer narratives to make recommendations with confidence\n- Work with the Customer Support team to provide proactive and reactive support directly to our most valuable customer segments\n- Create, shape, and manage the Customer Success Team to support a new global industry\n \n###Requirements:\n\nYou will have many of these attributes:\n\n- Mastery of empathetic and professional correspondence with high value customers\n- At least 1 year of direct people management experience\n- Use of proactive outreach to drive growth, customer retention, public perception, and product improvements\n- A succinct communication style and action-oriented approach to problem solving\n- An ability to tactfully advocate for Coinbase customers to internal teams\n- Demonstrated ability to manage complex, cross functional projects\n- Experience using business analytics software (Looker, SQL, Delighted, etc.) and journey mapping to identify customer points of friction and develop action plans to address them\n- Experience performing front lines support for a rapidly growing technology or payments company","publish_date":"2017-02-10"},{"link":"jobs/kustomer.html","location":"New York, NY","published":"Feb 8","id":6,"title":"Kustomer Customer Experience Associate","body":"\nAs a Customer Experience Associate, helping people is your passion.  Improving the state of customer experience is our mission. Our goal is to build trusted advisor relationships which results in happy, loyal customers and colleagues. We do this by listening to people’s needs and guiding them through the best use of the products we offer. Today, we are looking for people with the right mix of compassion, communication skills, and technical knowledge to make customer experience the best it can be.\n\n### You’ll be responsible for:\n- Helping people understand how to use Kustomer’s platform and products\n- Onboarding new customers and partnering with them to answer their questions\n- Troubleshooting, investigating, and creating detailed bug reports for customer issues\n- Crafting and editing helpful support documentation and FAQs\n- Building a community of support by sharing knowledge and insight amongst team members\n- Being an active member of the team that provides support to our users via live chat, phone and email\n\n### Your qualities:\n- A technical understanding of computer science (degree or bootcamp) is required\n- Great communication skills; frequent and clear written and verbal is vital for success\n- A knack for taking technical language and making it understandable\n- Self-driven work ethic: be a self-starter who takes initiative and sees projects through to completion.\n- Customer service experience to help our customers improve their processes\n- Curiosity and the desire to learn. Our business is changing and growing fast, flexibility is key\n- Empathy, patience, grace, and a sense of humor\n- Experience solving tough problems and proposing elegant solutions\n- Fluent in English and bonus points if you know additional languages","publish_date":"2017-02-08"},{"has_chat":"true","link":"jobs/1password.html","location":"Remote","published":"Feb 7","id":7,"title":"1Password Herald of Support","body":"\nHey there! It’s Jacob at AgileBits, makers of [1Password](https://1password.com/company). Let’s get acquainted.\n\nAt some point in their life, everyone forgets one of their passwords. It’s an inevitable event. When they do, they usually change it to be more memorable, which means it’ll be easier to guess or crack. Our goal with 1Password is to make remembering and managing passwords a thing of the past. We built 1Password to make security accessible and easy, not distant and arduous.\n\nIt’s a noble pursuit, remembering passwords for people. With everything the app does, it can always do better. Every day, we speak with hundreds of our customers about their experience with 1Password, and we use that to improve it for everyone. We’re a team of just over 70 right now, and we’re looking to add even more wonderful ‘bits.\n\nFor all of us here at AgileBits, building and supporting 1Password is a dream job. Doing new things is the core of our culture, and we embrace it each day. Everyone in the company does customer support once a week, and we all brainstorm ways to make our customers’ experience better. Once a month, we have an all-hands call for the whole company to rally on the same page. We even go on an annual cruise to ponder the next 12 months of the journey, and to get to know each other in person. 👋\n\nAs a Herald of Support, you could be the first voice of AgileBits someone has heard, or you could be the bridge between them and the development team. You could find yourself helping with a sign-in issue in the morning and updating our troubleshooting article for it in the afternoon. We are, after all, quite an [agile](https://en.wikipedia.org/wiki/Agile_software_development) bunch, and we get excited about _doing_.\n\n## What you might do\n\n- Help new and existing users have a great experience using 1Password.\n- Send well-written responses to customers, around 60 a day when you're up to speed.\n- Document new features and common questions in our knowledge base.\n- Be the voice of our customers internally: see that the top issues and requests each week are heard by the development team.\n- Learn how we do support as a remote company, and make it even better with your voice.\n- Try new things: we're agile, so new tools and ideas float around every few weeks.\n\n## What you have\n\n- Passion to help, love, and understand people, even the tough ones.\n- A knack for finding the cause of an issue, and the audacity to keep trying if you're wrong.\n- Adaptive explanatory skills that get people to understand, not just hear, what you're saying.\n- A personality that makes people smile and is delighted when they do.\n- Humility to ask for help when you aren't sure about something.\n- Optimism and positive written tone, even when it's raining and you forgot your umbrella (free shower!).\n\n## What you might also have\n\n- Polyglottism! You could go to France or Germany for a week and jump right in to conversation, or do that from your computer, with a French riviera as your wallpaper.\n- Personal experience with 1Password.\n- A peculiar desire to inspect things, particular elements of the web, often built of chrome or found in a safari; occasionally beside a fiery fox within an opera.\n- Building upon the previous point, you may even enjoy a cup of java while writing your script for the next production.\nIf you're a match\n\nSounding like a good fit? Let's start a conversation and see where it goes.","publish_date":"2017-02-07"},{"has_chat":"true","feature":"true","link":"jobs/illuminate-education.html","location":"Irvine, CA (Pacific Time) and Remote (Eastern Time)","published":"Feb 2","id":8,"title":"Illuminate Education Support Specialist","body":"\nWe're looking for a few friendly Support Specialists to join our team. You'll have the opportunity to support a great product, make a difference in the education community, and work with some really amazing people.\n\n### A typical day involves:\n- Helping teachers and educators use Illuminate's products to make a difference in student's lives.\n- Handling problems using the software, providing timely workarounds for our clients, and documenting issues for the development team so we can continually make our products better.\n- Being the friendly \"voice of Illuminate\" to our clients on the phone.\n- Providing clear, timely, helpful responses to email requests.\n- Collaborating with Illuminators on other teams (implementation, data, development, etc.) to make sure our clients get the best support possible.\n- Continually learning and growing so you can be a better support specialist, and a better human being!\n\n### Being a support specialist requires:\n- Amazing people skills\n- Excellent verbal and written communication skills\n- Motivated, self-directed learner\n- Strong problem-solving/troubleshooting skills\n- Strong technical aptitude\n- Must be a quick learner\n- Good sense of humor\n- Efficient office work habits\n- Ability to work independently and in a team\n\n### Meet Illuminate:\nIlluminate Education is a rapidly growing EdTech, SaaS provider founded by educators, for educators. We offer next-gen web-based software tools for the K12 market. Our streamlined suite of products is a one-stop solution for comprehensive data management and analysis, enabling users at every level of the educational system – county, district, site, classroom, student and parent – efficient access to the information essential to their success.","publish_date":"2017-02-02"},{"link":"jobs/jhana.html","location":"San Francisco OR remote!","published":"Jan 30","id":9,"title":"Jhana Support/Ops Engineer","body":"\nThe mission that gets us out of bed in the morning is simple: help millions of people get the great manager they deserve. People’s relationships with their managers are a major driver of job satisfaction. With good managers, teams and companies thrive. With bad managers, teams and companies implode. That’s why we built a web application to help managers be effective people leaders.\n\nWe’re a high-performing team of entrepreneurs and deep thinkers who get really excited about ideas and learning. And with more than 50 delighted customers (including FitBit, Etsy, Carfax, and Glassdoor), we’re well on our way to building a strong, sustainable enterprise SaaS company.\n\n### About the job:\nYou’ll be our first in-house engineering hire — a huge opportunity to lead the company in scaling our technical onboarding and support processes. You’ll also be collaborating with our platform development agency and product and client success teams to develop a secure, seamless, and downright awesome experience for managers.\n\nThis often means collaborating and coordinating with multiple stakeholders, from a client’s IT department to our own non-technical writers. If you’re the type who’s motivated by translating people’s real-world problems into technical solutions that users love — and doing so seems all the more exciting in an ever-evolving startup environment — then you’ll probably like it here.\n\n### Responsibilities:\n- Manage technical onboarding and support for new Jhana customers.\n- Provide first response Jhana SaaS product and platform support for customers.\n- Work with our Platform team to design and code platform innovations.\n\n### Requirements:\n- 4+ years support and full-stack development experience with PHP/MySQL, JavaScript, and HTML5 at a minimum.\n- Demonstrable understanding of WordPress standards, database structure and security, custom theme development, custom widget development, and responsive mobile WordPress theme development and testing.\n- Experience working in an agile development environment.\n- Has a people-person side, enjoys communicating with a range of stakeholders (clients, internal teams, IT staff, and non-technical people).\n- You’re self-motivated, collaborative, adaptable and excited about building, fixing, and improving a fast-changing startup.\n\n### Benefits:\n- The opportunity to move the needle and to see the immediate impact of your work\n- Competitive salary\n- Generous stock options\n- Company-paid medical and dental coverage\n- Discretionary paid time off: we treat employees like responsible, trusted adults, giving the flexibility needed manage their work and personal lives\n- Remote-work friendly company culture\n- Personal learning and professional development budgets\n- 401(k)\n- Dog friendly office\n\nWe value diversity\nJhana is an equal opportunity employer, and we're actively recruiting diverse candidates from a wide range of backgrounds and experiences.","publish_date":"2017-01-30"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Jan 16","id":10,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2017-01-16"},{"has_chat":"true","feature":"true","link":"jobs/codeship.html","location":"Boston/Vienna/Remote (UTC+2 to UTC-8)","published":"Jan 16","id":11,"title":"Codeship Senior Customer Success Engineer","body":"\nAs more and more teams are using Codeship for their Continuous Integration and Continuous Delivery needs, we are looking to extend our Customer Success team. When our users are having problems, they’ll contact our support team, and it is our job to make sure to help them and solve their issues in a timely manner.\n\nYour primary responsibility will be to work with our users to resolve their support tickets. Those tickets cover all possible topics from workflow specific questions to issues with their build, their Codeship setup or bug reports and feature requests. You will work closely with our Product and Engineering teams to provide feedback and help improve the customer experience. You will also make sure our documentation is up to date with current information as well as extend and improve articles.\n\nCodeship works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events.\n\n### Responsibilities\n- Assisting customers with solving problems they experience with Codeship and their project setups.\n- Communicate customer feedback and requirements to Product Management teams.\n- Update and extend Codeship product documentation as well as write documentation for upcoming features.\n\n### Qualifications\n- Excellent problem-solving skills\n- Prior experience providing technical support\n- Familiarity with at least one programming language (Ruby, Python, Go, …)\n- Understanding of continuous integration and automated software testing\n- Familiarity with a modern web application stack (Rails, Django, AngularJS, …)\n- Enthusiasm for working directly with customers\n- Stellar English verbal and written communication skills\n- Familiarity with Git and GitHub or Bitbucket\n\n### Bonus Points\n- B.S. in Computer Science or a related field is strongly preferred\n- Previous experience as a Software Engineer or an Operations Engineer\n- Familiarity with LXC and/or Docker\n\nSee also <a href=\"https://codeship.com/jobs?gh_jid=247010\">https://codeship.com/jobs?gh_jid=247010</a>","publish_date":"2017-01-16"},{"link":"jobs/aircall.html","location":"New York","published":"Dec 7","id":12,"title":"Aircall Customer Support Hero","body":"\nYou'll join the US business team to ensure that the customers we work with have a great experience. You will be the first point of contact and advocate for clients.\n\n\n### What are the responsibilities:\n- Be the voice of Aircall - you will be on the front lines! This involves flexing your amazing troubleshooting skills via phone calls, emails, and live chat.\n- Provide swift and thorough solutions for customers. When absolutely unable to do so, escalate to the dev/tech team.\n- Take note and relay customer feedback and insights to Aircall's internal teams such as the tech, marketing and product teams, in order to constantly improve the customer experience.\n- Maintain an expert-level knowledge of our products and internal management systems as well as curiosity and awareness of new initiatives within in the industry.\n\n\n### What we are looking for:\n- You have at least 1+ year of experience in Support and are passionate about it.\n- You are technical and problem solver. UDP/TCP ports, REST API and packet losses do mean something to you.\n- You have a “no task is too small” attitude and the endurance to consistently deliver amazing customer experiences without exception.\n- You have superior written and oral communication skills.\n- You have strong people skills — you are friendly, a good listener, you ask good questions, and you're energized by personal interaction.\n- You are a team player who works well with a wide range of personalities and is ready to contribute to an awesome team environment.\n\n### Brownie points:\n- You have a sense of humour and know how to make fun of yourself.\n- Flexibility with schedule to meet the needs of the business.\n\n### What are the benefits of working here?\n- All the caffeine you need to keep you going\n- Medical/Vision/Dental benefits\n- Tax-free commuter benefits\n- Your metrocard reimbursed\n- Gym reimbursement\n- Shiny new Mac gear!","publish_date":"2016-12-07"}]