[{"feature":"true","link":"jobs/activecampaign.html","location":"Chicago, IL","published":"Feb 11","id":1,"title":"ActiveCampaign Director of Support","body":"\nActiveCampaign is a quickly growing SaaS company. We’ve built an integrated marketing & sales platform for companies of all sizes. We are known for being the easiest to use solution on the market and offering the best customer support experience.\n\nWe are looking for someone to improve upon our overall customer support experience while building out our support team to meet the demands of our increasing growth.\n\n### WHAT YOUR DAY COULD CONSIST OF:\n- Working with and developing our support team members on a group and individual basis\n- Identifying trending issues and working with product & development teams on solutions\n- Building out processes to improve our customer experience & ensuring processes are being utilized\n- Prospecting, interviewing, and on-boarding new hires\n- Creating strategy for growing the support team and areas of focuses\n- Assisting with defining and working towards quarterly goals for improving our customer experience\n\n### WHAT IS NEEDED:\n- Previous experience building out and managing a support team (preferably for a SAAS company)\n- Experience with recruiting and hiring for a support team\n- A passion for data analysis and processes\n- Knowledge of email marketing & marketing automation\n\n<!--[if(lte IE 8)]>\n\t\t\t\t<img style=\"width:150px\" class=\"ie meta_logo\" src=\"http://metacommunications.com/wp-content/themes/meta2015/images/fallback/logo_meta_stacked_white.png\">\n\t\t\t<![endif]-->","publish_date":"2016-02-11"},{"has_chat":"true","link":"jobs/partnerhero.html","location":"Anywhere (remote is okay!)","published":"Feb 9","id":2,"title":"PartnerHero Japanese Localization Associate (remote)","body":"\nThe company, a PartnerHero client, manages a platform or marketplace for online learning. Unlike academic MOOC programs driven by traditional collegiate coursework, the company provides a platform for experts of any kind to create courses which can be offered to the public, either at no charge or for a tuition fee. The company provides tools which enable users to create a course, promote it and earn money from student tuition charges.\n\nPartnerHero is looking for highly motivated candidates with a passion for localization and customer support. In this role, you will be part of a global team dedicated to supporting our client on an array of interesting issues. In a department that encourages innovation and forward thinking, you will be providing support to our global clients focusing mainly on culturizing the product to the Japanese community.\n\nOur mission is to provide customers with an optimal support experience driven by passion and expertise. We place the highest value on every customer interaction and approach each inquiry with urgency, care and the desire to further strengthen the existing relationship.\n\nThe Japanese Localization Associate will work with the company’s Japanese Country Manager. You will be required to translate and adapt a product or content to the Japanese locale and market. Translation is only one of several elements of the process. In addition to translation and support, it may also include:\n- Adapting graphics to target markets\n- Answering customer support emails, and solving their problems\n- Modifying content to suit the tastes and consumption habits of other markets\n- Adapting design and layout to properly display translated text\n- Converting to local requirements (such as currencies and units of measure)\n- Using proper local formats for dates, addresses, and phone numbers\n- Addressing local regulations and legal requirements\n\n### REQUIREMENTS\n- Outstanding written and verbal/written communications skills in Japanese and English\n- You are a native Japanese or have superior knowledge of Japanese culture\n- Strong analytical, problem solving and troubleshooting skills\n- A passion for delighting customers and solving their problems\n- Openness to work flexible hours if required, including weekends and holidays\n- Ability to work effectively in a fast-paced, innovative environment demonstrating high energy, a sense of urgency, and decisiveness\n- Polite, thoughtful and friendly attitude\n- Team player with an ability to operate at all levels in a matrixed organization\n- Attentiveness and empathy for customers\n- Technologically savvy\n- A curiosity about how things work, and a thirst to learn new things\n- Ability to learn and adapt to new systems and processes\n- Prior customer service & support experience a plus","publish_date":"2016-02-09"},{"has_chat":"true","link":"jobs/expensify.html","location":"London","published":"Feb 3","id":3,"title":"Expensify Customer Success","body":"\n### Your Mission, Should You Choose to Accept:\n\nExpensify prides itself in solving a real world problem with a team of top notch product experts. We are reinventing the way people look at expense reports by automating not just the expense report, but the entire business trip. Joining our team means you are helping us fight the good fight against expense reports that suck!\n\n### About The Job\n\nAs a member of the Customer Success Team, you will be focused on making our user base successful Expensify users, through a deep understanding of our product and its many applications. \n\nJoining our team means you will be working in our fast paced environment and you are fearless of our next big challenge. Even though we work hard at Expensify, we make sure our employees are happy. Our most discussed perk is our offshore where we spend a month abroad working from a remote location as a team. This year we went to Cambodia and Thailand. Where do you want to go next?\n\n### About You\n\nYou’re an entrepreneurial extrovert who loves developing relationships with others and helping them solve complex problems with the ease of a trapeze artist! You’ll be talking to users through email, chat, and when needed on the phone, assisting with the onboarding process for potential customers, and working with with existing customers to make sure they are getting the most out of Expensify. The sky’s the limit for you, and this position can also be a jumping off point into other teams within the organization.\n\nFor the best possible fit, we are looking for someone who:\n\n- Has a general understanding of accounting processes\n- Can communicate to all levels within a company in a professional manner\n- Is a team player with great interpersonal skills\n- Wants to contribute to the growth of this team for the future\n- Can provide excellent verbal and written communication with clients\n- Has experience in Customer Success/Customer Support assisting users both proactively and reactively.  \n- Has at least one year of experience in a Support/Success-driven role, or equivalent customer facing position.  ","publish_date":"2016-02-03"},{"link":"jobs/supercell-specialist.html","location":"Helsinki, Finland","published":"Feb 1","id":4,"title":"Supercell Player Support Outsourcing Specialist (Japan)","body":"\nJapan is a country with a long and rich tradition in the video game industry, home to some of the most beloved brands in the world – and to some of the most passionate players of our games.\n\nWe are looking for a Player Support Outsourcing Specialist to join our team in Helsinki and to work with our partners in Japan to ensure the best support experience for our players. Working in our multicultural team you will be the voice of our players in Japan, manage the relationship with our local partner and build a bridge between the eastern and western cultures.\n\nThe person we are looking for is a gamer with a strong background in customer support or vendor management and a unicorn-like personality who wants to push the boundaries of support for mobile games and beyond.\n\nYou are self-driven and hands-on? You can take decisions on a day-to-day basis independently? You don’t mind getting your hands dirty and address our players on individual level? Great, we have a team structure with minimal hierarchy and no red tape where the only limits to what’s achievable are set by your imagination.\n\nIf you want to make a difference for millions of fellow players in Japan, this might be the right place for you.\n\n### RESPONSIBILITIES\n- Become an expert at Supercell games and our internal tools\n- Directly manage our BPO partner in Japan\n- Use data in your day-to-day management to achieve the best results\n- Collaborate closely with other internal stakeholders\n- Be the voice of our players in Japan\n- Apply your knowledge to current and new Player Support projects\n- Support the Japanese localization of our games as required\n\n### REQUIREMENTS\n- Native or bi-lingual Japanese skills\n- Excellent verbal and written English skills\n- Previous experience in a customer support or vendor management (3-5 years) role\n- Team player with strong problem solving and conflict management skills\n- Empathic and culturally aware\n- Passion for video games and mobile applications\n- Ability to travel frequently (other Supercell offices and partners)\n\n### NICE TO HAVES\n- Passion for one or multiple Supercell games\n- Experience working in multicultural environments\n\n### SUPERCELL OFFERS\n- A first-row view into one of the most successful game companies in the world\n- Opportunity to work with a team of gaming veterans, top talent, and passionate gamers\n- Easy-going, enthusiastic, open and at the same time a very results-driven culture\n- Competitive compensation\n- Smartphone, tablet, laptop/workstation of your own choice\n- Industry leading benefits\n- Amazing co-workers ","publish_date":"2016-02-01"},{"link":"jobs/ambitionally.html","location":"Virtual - Work From Home","published":"Jan 29","id":5,"title":"AmbitionAlly Customer Success Specialist","body":"\nNathalie Lussier Media, Inc. is looking for a Customer Success Specialist to work alongside a fun, creative, and loving business strategist in our rapidly growing company, based in Aubrey, TX. We pride ourselves on exceptional customer service, combining digital strategy and real-world empathy, and setting bold business goals to reach.\n\nThis is a full-time employee position, beginning with a two-week trial to ensure a good fit. While this is a virtual, work-from-home position, it is not short-term. We are committed to building a world-class team culture, and want someone equally dedicated who will grow with us for many years. We’re a heart-centered team of dedicated, disciplined A-players and we need you to be too. If the potential for more ownership and room to grow into the team sounds exciting, keep reading.\n\nSome of the things you’ll be expected to take charge of include: answering technical support questions; helping customers with the set-up and integration of our products on their websites; evangelizing product features; assisting in the creation of training materials and product documentation; working as an integral part of the team to create and provide support for products and programs our customers will love.\n\nYour role and tasks will expand and change as the company evolves and grows. This is an entrepreneurial environment and things move quickly!\n\n### DUTIES AND RESPONSIBILITIES:\nThe core of this position centers around providing excellent, personalized technical support to our customers and fostering long-term relationships with our client base. Here are some of the specifics of the role:\n\n- Assist customers with all technical support issues related to our software product line, including AccessAlly, PopupAlly Pro, WebinarAlly, and additional products as they are launched.\n- Respond in a timely manner to customer questions, with the goal of reaching inbox zero daily.\n- Foster long-term relationships with customers to retain and grow our customer base.\n- Perform with grace under pressure and maintain composure and friendliness even when dealing with frustrated or impatient users.\n- Help document product features and create video tutorials aimed at existing and new customers to evangelize products.\n- Work independently with minimal daily oversight, while also contributing to and collaborating with a close-knit team.\n- Identify, brainstorm, and initiate opportunities to improve or expand training materials, including but not limited to our support database, video and text tutorials, integration and set-up guides, and original webinars and online courses.\n- Spot trends in support questions to make product feature recommendations.\n\n### QUALITIES AND SKILLS WE’RE LOOKING FOR:\n- College degree or equivalent experience in a related field\n- 2-3 years in a customer support role\n- Self-starting, highly motivated\n- A naturally gracious and patient – but thick-skinned – demeanor\n- Excellent writing and interpersonal skills\n- Software development experience, with a proven ability to understand the tech side (even if you’re not a developer)\n- Mastery of the WordPress platform and general understanding of plugin inner workings\n- Familiarity with the Nathalie Lussier brand and - AmbitionAlly products (being a customer/user is a major plus!)\n- AmbitionAlly is a tight-knit company with remote team members across the US, Canada, and abroad and it’s growing quickly, which means that a fast pace and constant communication is key.\n\n### HOW TO APPLY:\n1. Write a cover letter that starts with, “If I could be any animal, I’d be a(n)… because…” (all standard, boring cover letters will be rejected).\n2. Give me two examples of how you helped someone with a difficult problem – one where the interaction was totally positive, and one where there was some conflict (and how you resolved it).\n3. Tell me what great movies you’ve seen recently, and why you liked them.\n4. Attach, or include in the body of the email: your resume, salary requirements, and a link to your website (if applicable).\n5. Tell me why this position interests you.\n6. Tell me why – very specifically – you want to work for me. What do you think I can offer you (besides a paycheck)?\n\nIf you’re ready to work with me to take this business off the charts even more, send your cover letter and resume to hiring@nathalielussier.com (put “Customer Success Specialist” in the subject line).","publish_date":"2016-01-29"},{"has_chat":"true","link":"jobs/base.html","location":"Mountain View, CA","published":"Jan 28","id":6,"title":"Base CRM Product Support Specalist","body":"\nWe’re looking for a Product Support Specialist in our Mountain View office. You will be the first point of contact for our users and help serve as the voice of the company. We’re looking for smart, engaging, and dynamic people who learn quickly and have a passion for technology. \n\nIf you’re looking to kickstart your career by joining one of the fastest-growing startups in the Valley, we want to hear from you!\n\n### EXPECTATIONS\n- Assist current and potential Base users in understanding the product, its features and how it can best be used to grow their business.\n- Provide product demonstrations and webinars for prospective and current users to help them understand how to get the most out of Base.\n- Manage and resolve support requests over the phone or email.\n- Update or create support articles for new features.\n- Work with users to identify, troubleshoot and resolve issues as well as collect feedback.\n- Work side-by-side with our Product Engineering team to improve Base.\n- Provide a positive, personalized experience to each customer who reaches out to us.\n\n### REQUIREMENTS\n- MOST IMPORTANT—You possess strong written and verbal communication skills.\n- You're a self starter and are driven to conquer projects outside of your core responsibilities.\n- You’re analytically-minded, and are able to prioritize workloads and adjust as situations change.\n- You enjoy helping others and appreciate the challenge of solving technology related problems.\n- You're excited about learning and technology in a rapidly growing environment.\n- You engage well with others and remain calm under pressure.\n\n### BONUS SKILLS YOU MAY HAVE\n- Experience using Microsoft Excel\n- Experience using a CRM solution and an understanding of the SaaS marketspace\n- Knowledge of various mobile platforms: iOS, Android, and Windows Mobile\n- Familiarity with RESTful API, Chrome Dev Tools, and various web technologies","publish_date":"2016-01-28"},{"has_chat":"true","feature":"true","link":"jobs/ipsy-content.html","location":"San Mateo, CA","published":"Jan 27","id":7,"title":"ipsy Customer Care Content Manager","body":"\nipsy is committed to providing excellent service to our active community. We’re seeking a Customer Care Content Manager who create and optimize top-notch content (both text and visual) for our customers and employees. You will focus on scaling our online help center to maximize customer engagement and education, enhance accessibility, and reduce inbound volume through effective self-help material. You will also be responsible for creating and maintaining standard response templates, write responses for large-scale and sensitive issues in collaboration with other managers and stakeholders, and maintain our support team’s internal knowledge base.\n\n### Content Manager Profile:\n- Innovative and Analytical: You are a wordsmith, data-driven, and passionate about developing creative solutions.\n- Organized and Articulate: You are comfortable owning an array of detailed responsibilities. You communicate effectively across multiple mediums (written, oral, visual).\n- Proactive and Adaptable: You thrive in a challenging, collaborative environment and respond to changes with a flexible attitude.\n\n### Key Responsibilities:\n- Write and edit community help center (FAQs), customer outreach emails, and response templates for our support agents\n- Maintain content for our internal knowledge base, as well as style and tone resources for our agents\n- Optimize help center content using data analysis in order to improve the customer experience and reduce contacts\n- Identify opportunities for context-sensitive content across customer service channels, anticipate where customers may need support, and define information delivery strategies\n\n### Qualifications:\n- Bachelor’s degree\n- At least 3 years of experience in content management, preferably in a customer service capacity\n- Experience defining, tracking, and reporting metrics on the effectiveness of content\n- Basic understanding of Google Analytics\n- Excellent eye for detail\n- Understanding of and appreciation for best-in-class customer experience\n- Empathetic, authentic, and straightforward writing style\n- Strong leadership skills and ability to take initiative\n- Capable of managing a large volume and variety of work\n- Knowledge of HTML and/or CSS a plus\n- Basic graphic design and/or Adobe Photoshop skills a plus\n\n### About us:\nipsy is the world’s largest and most passionate beauty community. The community is centered around a beauty sampling service called the Glam Bag and premier content produced by ipsy and its partner creators. Since being founded in 2011 by top YouTube creator Michelle Phan, the company has grown dramatically. On the sampling front, ipsy ships to over 1.5 million subscribers every month; on the owned content side, ipsy reaches over 20 million people every month through stylist videos and social posts.\n\nipsy has built a results-oriented team packed with seasoned beauty, e-commerce, tech, and studio professionals in offices in the Bay Area, NYC, and LA. The company has received over $100M in growth capital from premier investors including TPG, Sherpa and top industry insiders. Watch a video about working at ipsy here and consider joining our growing team!","publish_date":"2016-01-27"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Jan 26","id":8,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2016-01-26"},{"has_chat":"true","feature":"true","link":"jobs/songkick-intern.html","location":"Brooklyn, NY or Los Angeles, CA","published":"Jan 25","id":9,"title":"Songkick Customer Support Intern","body":"\n### Who we are:\nSongkick is the largest concert discovery service and artist-to-fan ticketing platform in the world. Our goal is to help artists sell more tickets directly to their fans and fix the central problem at the heart of the concert industry – that 50% of tickets go unsold. Working with over 500 artists and ticketing thousands of events worldwide each year, we’re working to make every show a sellout.\n\nSongkick delivers personalized alerts for upcoming concerts to its 10 million monthly unique fans, making it easy for these fans to track their favorite artists so they never miss them live.\n\nOur company has also powered worldwide programs for some of the world’s biggest artists, including Alicia Keys, Arcade Fire, Imagine Dragons, Blake Shelton, and Paul McCartney, creating the ultimate artist experience by linking fans through innovative ticketing technology and marketing solutions.\n\nWith offices strategically positioned in London, Los Angeles, Nashville, and New York, Songkick combines technology and expertise to make the concert experience better for artists and fans alike.\n\n### What we’re looking for:\nWe have an opening for an ambitious Graduate to join us at Songkick’s New York or LA offices. This is an opportunity to work with our Customer Support team for a 2 month paid internship.\n\nWe're after someone who is driven by helping people, making them happy and most importantly, someone who understands how much it means to see your favorite band live. You’ll be on the front line helping the music industry and music fans to get the most out of Songkick.\n\nWe pride ourselves in providing exceptional support for our users, and having accurate and exhaustive concert listings – your role will be crucial to making sure that this high standard is maintained!\n\nWe handle 90% of our support over email, so you need to be fast on your fingers and comfortable with coming across friendly and helpful through this communication channel. The successful candidate is a wordsmith extraordinaire. If you’re a stickler for grammar, get all OCD about using the same word too many times, and know exactly how many exclamation marks set the tone of an email, you’re in the right place!\n\nAlongside providing top quality support, you’ll be helping out the fulfilment department with dispatching tickets, assisting the office manager when required, and taking on small projects within other areas of the company. We make sure that interns at Songkick get a thorough insight into the whole business operation, so you’ll be sitting in on meetings and have the opportunity to talk directly to other departments that you’re interested in learning more about.\n\n### Responsibilities:\n- Be on the front-line replying to customers in Desk, the platform we use to handle our support enquiries\n\n- Liaise directly with our contacts at music labels and agencies on a daily basis to help them with their listings and using the site\n\n- Moderate concerts and festivals, spotting trends in the data and proactively care-taking the most popular events\n\n- Write blog posts and contribute to other social media projects\n\n- Assist with adding/editing ticket inventory within our system\n\n- Help out at community events\n\n- Occasionally, you’ll get pulled off-project to support other areas of the business including Office Management, Business Development and User Experience\n\n### Requirements:\n- A Bachelor’s Degree from a four-year college or university\n\n- Energetic, passionate, and driven individual who can easily collaborate with others\n\n- Sensitive to varied customer personalities\n\n- Flawless writing skills\n\n- Conscientious, with excellent attention to detail\n\n- Strong work ethic and sense of ownership\n\n- At ease when communicating with others, whether that’s via email, phone or face to face\n\n- Flexible and adaptable in a fast workplace environment\n\n- Comfortable taking initiative and making decisions independent of others\n\n- Familiar with using Macs and Google Docs\n\n### Big plus if you have:\n- Knowledge of ticketing and/or live music experience\n\n- Knowledge of social media use for customer service\n\n- Previous experience with a customer help system\n\n- Previous work/internship in a technology or startup environment\n\n### Compensation:\nHourly wage (min. wage)","publish_date":"2016-01-25"},{"has_chat":"true","feature":"true","link":"jobs/songkick.html","location":"Brooklyn, NY or Los Angeles, CA","published":"Jan 25","id":10,"title":"Songkick Customer Support","body":"\n### Who we are:\nSongkick is the largest concert discovery service and artist-to-fan ticketing platform in the world. Our goal is to help artists sell more tickets directly to their fans and fix the central problem at the heart of the concert industry – that 50% of tickets go unsold. Working with over 500 artists and ticketing thousands of events worldwide each year, we’re working to make every show a sellout.\n\nSongkick delivers personalized alerts for upcoming concerts to its 10 million monthly unique fans, making it easy for these fans to track their favorite artists so they never miss them live.\n\nOur company has also powered worldwide programs for some of the world’s biggest artists, including Alicia Keys, Arcade Fire, Imagine Dragons, Blake Shelton, and Paul McCartney, creating the ultimate artist experience by linking fans through innovative ticketing technology and marketing solutions.\n\nWith offices strategically positioned in London, Los Angeles, Nashville, and New York, Songkick combines technology and expertise to make the concert experience better for artists and fans alike.\n\n### What we’re looking for:\nWe're after someone who is driven by helping people, making them happy and most importantly, someone who understands how much it means to see your favorite band live.\n\nWe handle 90% of our support over email, so you need to be fast on your fingers and comfortable with coming across friendly and helpful through this communication channel. The successful candidate is a wordsmith extraordinaire. If you’re a stickler for grammar, get all OCD about using the same word too many times, and know exactly how many exclamation marks set the tone of an email, you’re in the right place!\n\nWe pride ourselves in providing exceptional support for our users so we need someone who is a great problem-solver and is creative about going above and beyond to make things right.\n\nHe or she will communicate with our users in a manner that reflects positively on the company, increasing our fan base and raising awareness of the Songkick brand.\n\n### Responsibilities:\n- Be on the front-line replying to customers in Desk, the platform we use to handle our support enquiries\n\n- Take ownership of tour campaigns from a customer support perspective: be a point person with our Artist Services team, assist with testing of new ticket stores and own the feedback loop for customer issues\n\n- Get to know the Songkick product and eco-system inside-out - you’ll need to be as comfortable guiding a confused user through our onboarding process as you are in handling complaints and refund requests\n\n- Be a brand ambassador - you’ll be representing the company on a daily basis, every interaction is an opportunity to impress, engage and grow our user base\n\n- Feel comfortable handling the phone and personally interacting with customers when necessary\n\n- Provide support to other team members if asked - we’re a start-up which means that we all muddle in and help each other when required. Occasionally you’ll get pulled off to work on other projects.\n\n- Writing and sending informative emails to our customers regarding their ticket orders\n\n- Helping to improve on and develop both our internal help documents, and our external FAQ pages\n\n- If you’re interested, there is also scope to get involved in helping out on our social media channels, marketing efforts and community projects\n\n### Requirements:\n- A Bachelor’s Degree from a four-year college or university\n\n- 1-3 years’ experience in a related field, including internships – previous work in a technology or startup environment a strong plus\n\n- Energetic, passionate, and driven individual who can easily collaborate with others\n\n- Sensitive to varied customer personalities\n\n- Flawless writing skills\n\n- Strong work ethic and sense of ownership\n\n- At ease when communicating with others, whether that’s via email, phone or face to face\n\n- Dedicated to team and personal success\n\n- Flexible and adaptable in a fast workplace environment\n\n- Comfortable taking initiative and making decisions independent of others\n\n### Big plus if you have:\n- Knowledge of ticketing and/or live music experience\n\n- Knowledge of social media use for customer service\n\n- Previous experience with a customer help system\n\n### Compensation:\n- Competitive salary\n\n- Employee stock options\n\n- Employer-matched 401(k) plan\n\n- Generous paid time off\n\n- Above-market medical, dental, vision and life insurance","publish_date":"2016-01-25"},{"has_chat":"true","link":"jobs/ipsy.html","location":"San Mateo, CA","published":"Jan 22","id":11,"title":"ipsy Customer Care Representative","body":"\nAt ipsy, our customers are at the core of everything we do, and we’re committed to providing them with top-notch service. We’re searching for a support representative who is passionate about helping others, who can proactively offer solutions and ideas that will delight our members. This position is responsible for managing sensitive customer interactions, proposing creative solutions, and establishing rapport with our engaged community. You will be scheduled for our evening shift (12-8 PM), and one weekend shift per week.\n\n**COVER LETTER REQUIRED** – Please tell us about yourself and why you’re interested in this role.\n\n### You Are:\nSupport driven. You have a passion for problem-solving and enjoy being challenged. Helping others comes naturally to you.\nPerceptive and empathetic. You proactively anticipate customer needs. You can adapt your tone and approach to fit a diverse range of customer personalities and situations.\nHonest and authentic. You’re comfortable being yourself and genuinely enjoy connecting with others. You express yourself openly and respectfully, and function well as part of a team.\nReliable and accountable. You’re consistent, dependable, and adhere to a set work schedule.\nYou take ownership over the quality of your work and make an effort to improve.\nInnovative. You're a creative thinker who can offer solutions to the trickiest conundrums. You bring compelling ideas to the table in an effort to catalyze positive change.\n\n### Responsibilities:\nRespond to customer emails in a professional, friendly, and timely manner to enhance our members’ knowledge of ipsy and create a positive experience for them\nManage sensitive issues while maintaining the highest level of professionalism; provide thoughtful, prompt resolutions with empathy and poise\nRecommend solutions to complex or escalated situations through research and critical thinking\nShare relevant, strategic insights with our product, marketing, and technology teams regarding overall customer experience and service-related trends\nStrive to exceed volume and quality goals\nHelp with additional projects as needed\n\n### Qualifications:\nBachelor degree or equivalent experience\n1-3 years in customer-centric industry\nStrong computer and typing skills, very comfortable with web-based applications and navigation between tools\nExceptional written communication skills with keen attention to detail\nEntrepreneurial spirit with ability to manage workflow efficiently\nWilling to work one weekend shift per week\nExperience providing customer support via social media is a plus\n\n### About us:\nipsy is the world’s largest and most passionate beauty community. The community is centered around a beauty sampling service called the Glam Bag and premier content produced by ipsy and its partner creators. Since being founded in 2011 by top YouTube creator Michelle Phan, the company has grown dramatically. On the sampling front, ipsy ships to over 1.5 million subscribers every month; on the owned content side, ipsy reaches over 20 million people every month through stylist videos and social posts.\n\nipsy has built a results-oriented team packed with seasoned beauty, e-commerce, tech, and studio professionals in offices in the Bay Area, NYC, and LA. The company has received over $100M in growth capital from premier investors including TPG, Sherpa and top industry insiders. Watch a video about working at ipsy here and consider joining our growing team!","publish_date":"2016-01-22"},{"feature":"true","link":"jobs/shopify.html","location":"Anywhere in British Columbia, Canada","published":"Jan 21","id":12,"title":"Shopify Customer Success Agent (aka: Guru)","body":"\nGooo-Rooo?\n\nShopify is a leading cloud-based, multichannel commerce platform designed for small and medium-sized businesses. Merchants can use the software to design, set up and manage their stores across multiple sales channels, including web, mobile, social media, brick-and-mortar locations, and pop-up shops. Shopify currently powers over 200,000 businesses in approximately 150 countries, including: Tesla Motors, Budweiser, Google, Wikipedia, LA Lakers, GoldieBlox, and many more.\n\nAbout the Role:\n\nThe Guru team at Shopify supports shop owners around the clock on the telephone, email and chat. With over 200,000 shops, we are looking for talented people to join our growing remote Guru team.\n\nOur Gurus are well equipped to handle any questions that our merchants might have. Sales, online marketing, billing, technical issues, third party apps and design are just some examples of the types of questions you will get. Check out our 1000+ pages of support documentation for a taste of what you will be asked: http://docs.shopify.com/\n\nThis role is very challenging and incredibly fast paced, yet rewarding. You’ll get hands-on experience working with online businesses.\n\nThere are no scripts; we want you to be yourself and work with the merchant to find solutions and help them grow their business.\n\nIt is a full-time position with 40 hours/week and some work on the weekends.\n\nAbout you:\n\nThis is an entirely remote position, so you’ll be working from home. You will need a DSL or Cable internet connection.\n\nYou are available for non standard (9-5) hours with weekend work. Everyone joining in British Columbia covers 4pm - 12 am PT.\n\nYou are passionate about customer success and helping the team.\n\nYou have a great sense of humour, have a strong desire to learn, and are a great communicator.\n\nYou are detail oriented.\n\nYou are proactive and own issues from beginning to end.\n\nMost importantly, you are resourceful and really enjoy problem solving.","publish_date":"2016-01-21"},{"has_chat":"true","feature":"true","link":"jobs/articulate.html","location":"Telecommute (U.S. only)","published":"Jan 18","id":13,"title":"Articulate Senior Technical Support Engineer","body":"\n<p>Do you want to help customers solve their most challenging technical problems at an organization that invests in making customer support amazing? If so, we’d love to hear from you! We’re looking for a Senior Technical Support Engineer to join our fantastic team.</p><p><strong>You’re an ideal candidate if:</strong></p><p>You’re a sharp, knowledgeable technician with charisma and a genuine love for people that lets you disarm your angriest customer. You’re a recognized leader and escalation point for our support, sales, and community teams. You’re passionate about owning and resolving cases yourself, but humble enough to know when to ask for help. And you’re flexible, collaborative, open to feedback, proactive, and able to manage projects from start to finish.</p><p><strong>Your responsibilities:</strong></p><ul><li>Take on our customers’ most challenging technical problems after Tier 1 and Tier 2 have exhausted all other options</li><li>Delight the customer, and remind them why they chose Articulate</li><li>Coach and lead other team members, always demonstrating patience and empathy</li><li>Be proactive and deadline-driven, manage your time well, be organized, and propose creative solutions</li><li>Reproduce and isolate bugs before involving QA</li><li>Write high-quality bug reports</li><li>Help the engineering team prioritize bugs</li><li>Test products when asked, and act as a customer advocate</li><li>Participate in occasional (no more than quarterly) after-hours support for customers in other time zones</li><li>Write detailed client instructions and contribute toward the Articulate knowledge base</li><li>Use Salesforce to record, track, and close cases</li><li>Be so knowledgeable, versatile, and humble that you can back up every other role on the team</li></ul><p><strong>Your ideal skills/experience:</strong></p><ul><li>5 years of technical support experience with desktop software applications and web tools</li><li>Extensive experience troubleshooting Windows, Office, and a wide variety of Windows applications; experience with Articulate software is a plus, but not a must</li><li>Hands-on experience creating and editing multimedia, including audio, video, and images</li><li>Innate understanding of web technologies, including all major browsers, FTP, email delivery, Adobe Flash, accessibility tools, and challenges such as low bandwidth, proxies, filters, and firewalls</li><li>No fear of logs—you can jump in and attempt to decipher any log file from any application</li><li>Basic understanding of HTML and of the AICC, SCORM, and Tin Can API specifications</li><li>Unafraid of jumping into tense situations, with a love for turning frustrated customers into successful advocates</li><li>You love to help everyone: customers, peers, and the neighbor down the street</li><li>Excellent oral and written communication skills; able to convey complex concepts concisely and clearly to customers with professionalism, empathy, and excellent grammar and spelling</li><li>Experience working from home or in an environment with a lot of autonomy</li></ul><p><strong>Work life:</strong></p><p>Articulate is a highly successful company with an empowering work culture. We give you autonomy over when, where, and how you work. We value productivity and results, not corporate B.S. And we keep our eyes fixed on our customers, helping them succeed in every way we can. We also believe that, to reach our diverse audiences, we need different viewpoints and voices in our midst. We welcome and celebrate differences and are committed to building a diverse team.</p><p><strong>About Articulate:</strong></p><p>Articulate is a nimble software company focused on building incredible e-learning software, community, and content. We have 48,000+ B2B customers, including 93 of the Fortune 100 companies and 19 of the 20 top-ranked universities. Our customers trust us because they know we’re just as passionate about them as they are about us. Learn more about what it’s like to work at Articulate at www.articulate.com/careers.</p><p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>","publish_date":"2016-01-18"},{"has_chat":"true","link":"jobs/customerio.html","location":"Remote / Anywhere","published":"Jan 18","id":14,"title":"Customer.io Technical Support Specialist","body":"\n<div id=\"content\" class=\"\">\n      <p>Do you love to help people solve problems? Are you curious about how things work? Do you find yourself always asking, <em>what can I do to help</em>?</p>\n<p>If so, you may be who we’re looking for! <strong>Customer.io is seeking the fourth member of our Technical Support team.</strong></p>\n<p>At Customer.io, our mission is helping businesses talk like people. Today, we do this with messaging software allowing businesses with large user-bases (500,000+ users) to send targeted, more relevant communication at scale. Our customers include Shutterstock, DigitalOcean, Handy, Watsi, plus over 800 other internet businesses.</p>\n<h2><strong>What You'll Be Doing</strong></h2>\n<ul>\n<li>Every day, you’ll answer customer requests and questions, mostly over email. This could vary between very complex questions like “how do I set up this complicated drip campaign with Customer.io?” to processing tasks like “please import some data for my users” and plenty of things in between.</li>\n<li>Occasionally, you’ll call existing customers to walk them through tasks and answer questions about the software. Email is #1 here, but we’ll pick up the phone when needed.</li>\n<li>You’ll write new or update existing documentation (both internal and external) with words, images, and screencasts.</li>\n<li>You’ll be recording feature requests, tracking them internally, and explaining these to our Product and Engineering teams directly.</li>\n<li>You’ll dedicatedly look for ways to improve the software or our service.</li>\n</ul>\n<p>With a small team at a startup, you’ll likely get the opportunity to do a lot of different things—including projects and tasks we don’t even know we need to do yet!</p>\n<h2>About You</h2>\n<ul>\n<li>You have amazing written and verbal communication skills. Besides talking with customers all the time, our team is located in Germany, Texas, and Oregon, and being able to communicate effectively in this remote environment is paramount.</li>\n<li>You exhibit our <a href=\"https://customer.io/careers/\">Core Values: <strong>Empathy, Transparency, and Responsibility</strong></a>. These values guide us when we talk with customers.</li>\n<li>You’re independent and self-motivated. While previous remote experience is not necessary, being remote from your entire team can be a challenging experience for anyone who hasn’t done it before. These qualities are essential to be successful on our team.</li>\n<li>You’re curious and enjoy learning new things through investigation. Our team tracks down root cause of an issue, be it a bug, something confusing in our software, etc.</li>\n<li>You don’t like to leave questions unanswered. If you don’t understand something you’ll dig until you find the answer.</li>\n<li>You’re passionate about technology (in the web and mobile spaces). Familiarity with things like HTML and CSS (for email marketing), Liquid markup, JavaScript, and APIs is a big asset.</li>\n</ul>\n<h2>Why you should work with us</h2>\n<p>Work anywhere in the world you want. We'll buy you what you need to deck out your home office or give you a monthly budget for some coworking space. We want you to work where you'll be most productive.</p>\n<p><strong>Competitive salary</strong> - We’re offering $55,000 for this role.</p>\n<p><strong>Equity</strong> - You'll own a piece of the company. It's not a get-rich-quick deal, but if you stay around for a while, we're planning to be a long-lasting company, and your piece of it will be a nice bonus.</p>\n<p><strong>Big Impact</strong> - Our team is small but growing quickly. The work you do will materially impact how successful we are as a company.</p>\n<p><strong>Great Tools</strong> - Everyone in the company has a budget for a great computer, a motorized standing desk, Steelcase Leap office chair, external monitor, and anything else you need to get your job done.</p>\n<p><strong>Health Benefits</strong> - We pay 100% of your premiums for medical, dental, and vision insurance.</p>\n<p><strong>Retreats</strong> - The whole company gets together twice a year: once at HQ in Portland, OR and once a year we travel. We’ve visited places like Barcelona, Spain; Sinaia, Romania; and Hunter Mountain, NY.</p>\n<p><strong>Vacation</strong> - Rest and recuperation are important. We offer unlimited paid time off with a two-week minimum per year.</p>\n</div>","publish_date":"2016-01-18"},{"link":"jobs/digitalocean.html","location":"NYC-HQ, Remote","published":"Jan 18","id":15,"title":"Digital Ocean Customer Success Engineer","body":"\n<p><span style=\"font-weight: 400;\">DigitalOcean is a simple cloud hosting built for developers, by developers. We make it easy for users to launch and manage their web infrastructure, and we love doing it. As a Customer Success Engineer at DigitalOcean, you’re responsible for ensuring our top customers have the best experience possible. This is a challenging and rewarding role in which you’ll be supporting our biggest customers to troubleshoot issues, scale applications and grow both our customer’s and DigitalOcean’s business.</span></p>\n<p><span style=\"font-weight: 400;\">Customer Success is an integral part of our company and we’re looking for creative problem-solvers who are eager to help our customers. We’re looking for candidates who are passionate about the technologies we use, and have extensive experience working with open-source and Linux environments. As the voice of the customer you have the opportunity to influence product decisions while helping to build the next great cloud company!</span></p>\n<p><span style=\"font-weight: 400;\">This is a full-time position based at our New York City HQ or working remotely. If you do wish to work remotely, we ask that you are available to come onsite periodically for team building activities.&nbsp;</span></p>\n<h2>What You Will Be Doing:</h2>\n<ul>\n<li>Respond to technical and product questions generated by our customers through tickets, emails, or phone calls</li>\n<li>Troubleshoot Linux (Ubuntu and CentOS), Apache, Nginx, MySQL, Rails/Unicorn, and PHP</li>\n<li>Quickly learn DigitalOcean systems and adapt to rapid changes</li>\n<li>Work both collaboratively and independently within a team setting (we love Slack!)</li>\n<li>Identify and communicate process improvement suggestions</li>\n<li>Incident management and escalations</li>\n<li>Help combat fraud and abuse on the platform</li>\n<li>Collaborate with other teams and departments to improve the customer's experience</li>\n<li><strong><span style=\"font-weight: 400;\">Help architect HA solutions for fast-growing and new customers</span></strong></li>\n</ul>\n<h2>What We'll Expect From You:</h2>\n<ul>\n<li>Strong background with technology and Linux systems</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Passionate about technology and customer support</li>\n<li>Strong identity with our brand and team culture</li>\n<li>Strong analytical skills and pattern recognition</li>\n<li>Prior experience in similar environments in Customer Success, Solutions Architecture type roles is a big plus.</li>\n<li>Strong communication skills, with ability to explain technical concepts in clear and concise terms</li>\n<li>A desire to get the best out of everyone on their team with the ability to balance the demands of multiple constituencies, defining priorities and setting appropriate expectations.</li>\n<li>Startup experience a big plus</li>\n</ul>\n<h2>Extra Credit:</h2>\n<ul>\n<li>Programing/Scripting: Ruby, Python, Go, Bash</li>\n<li>Source Code: GitAutomation: Chef, Puppet</li>\n<li>Virtualization: KVM, Xen</li>\n<li>Open Source: CoreOS, Docker, Vagrant</li>\n<li>Willingness to work in non-traditional business hours (nights and/or weekends)</li>\n</ul>\n<h2>Working at DigitalOcean:</h2>\n<ul>\n<li>Competitive compensation including a 401k with up to 4% employer match</li>\n<li>Stock options</li>\n<li>DigitalOcean&nbsp;offers competitive health, dental, and vision benefits for both employees and their dependents</li>\n<li>Corporate Seamless account to keep your hunger at bay</li>\n<li>Monthly commuter expense (for local workers) and gym membership allowance</li>\n<li>Monthly Internet expense for remote workers</li>\n<li>Great office space located in the heart of SoHo</li>\n</ul>\n<p class=\"p1\"><span class=\"s1\">We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</span></p>","publish_date":"2016-01-18"},{"link":"jobs/peekpro.html","location":"Salt Lake City, UT","published":"Jan 15","id":16,"title":"Peek Partner Support Representative","body":"\nPeek is looking for a passionate and driven Partner Support Representative to help our activity operator partners grow their businesses through Peek’s “Peek Pro” SaaS reservation and business management platform. The ideal candidate adapts well to a fast-paced environment, provides a high degree of service and responsiveness to our existing and potential partners, and demonstrates flexibility and a calm demeanor as company needs and priorities evolve. This is a full-time position.\n\n### Responsibilities:\n- Provide product and technical support to our operator partners \n- Gather data and feedback from partners, make observations about their needs, and influence product and process development at a rapidly growing start-up \n- Represent the voice of our partners internally as we make critical decisions about developingthe features and usability of our products  \n- Collaborate with different Peek functional teams such as Sales, Production and Product/Engineering to ensure partners are successful on our platform \n\n### Requirements:\n- BA/BS degree\n- Willing to work one or both weekend (Sat or Sun) days\n- Natural enthusiasm for helping people solve problems \n- Spanish fluency strongly preferred\n- 1-2 years of experience in account management, customer service, technical support or client relations\n- Experience with SalesForce and/or Desk preferred \n- Tech and web-savvy critical \n- Patient and able to teach new software to non-tech savvy operator partners \n- A self-starter eager to exceed objectives and take on more responsibility \n- Excellent written, oral and interpersonal communication skills \n- Able to work in a dynamic, face paced environment without skipping a beat \n- Process-oriented, enjoys coordinating work between multiple parties and ensuring everyone contributes effectively and gets what they need \n- Demonstrates common sense and able to troubleshoot and make sound decisions when faced with emergencies \n- Must be punctual and reliable \n- A passion for travel! ","publish_date":"2016-01-15"},{"link":"jobs/zapier.html","location":"Anywhere you want","published":"Jan 15","id":17,"title":"Zapier Customer Champion","body":"\n<p>Hi there!</p>\n<p>We're looking for someone who loves helping people. If you love interacting with people on a daily basis to help them learn how to optimize their work then read on&hellip;</p>\n<h2>About You</h2>\n<p>You're empathetic to users and can easily put yourself in their shoes. You realize that not everyone has the same skill set and that smart people sometimes make mistakes. You make customers feel empowered after interacting with support and not stupid because of a small mistake.</p>\n<p>You obsess over the details. Maybe you have a one emoticon and one exclamation point rule of thumb for every email. Maybe it's only two sentences per paragraph. Either way, you make sure each word and each punctuation mark makes the customer delighted to work with you.</p>\n<p>You love solving problems. Every customer is different, many times radically so. You relish being able to meet their specific need, and also solving their problems that may have gone unsaid.</p>\n<p>You love to write. Almost everything at Zapier is done via written communication (both with customers and between teammates).</p>\n<p>You're persistent. Support at Zapier is much different than at many software companies. It's not the same questions over and over again, and often involves researching technical nuances of the apps we support. You love the opportunity to solve new problems every day and won't give up when you don't know the answer right away.</p>\n<p>You love doing things efficiently. At Zapier, the work you do will have a disproportionate impact on the business. We believe in systems and processes that let us scale our impact to be larger than ourselves.</p>\n<p>You love to set your own course. At Zapier, we have quick team meetings each week and one-on-one meetings every month and then we go make things happen. You get to make things happen without someone saying so.</p>\n<h2>Things You Might Do</h2>\n<p>Zapier is a startup, so you'll likely get your hands dirty in a little bit of everything. That said, here are some things you'll get to lead:</p>\n<ul>\n<li>Help customers via email or chat to ensure they have the best experience possible (teammates tend to send 60+ emails every day), troubleshooting their problems and answering their questions.</li>\n<li>Write documentation to help users help themselves (all the documentation on our help site is written and maintained by the support team: https://zapier.com/help/)</li>\n<li>Work with the product team to build tools that will speed up and increase the quality of support at the same time</li>\n<li>Experiment: this is a startup so everything can change</li>\n</ul>\n<h2>About Zapier</h2>\n<p>For the past three years, Zapier has been helping people across the world automate the boring and tedious parts of their job. We do that by helping everyone connect the web applications they already use.</p>\n<p>We believe that there are jobs that a computer is best at doing and that there are jobs that a human is best at doing. We want to empower businesses everywhere to create processes and systems that let computers do what they are best at doing and let humans do what they are best at doing.</p>\n<p>We believe that with the right tools, you can have 10X the impact with less work.</p>\n<p>We believe in small teams. Small teams are fast and nimble. Small teams mean less bureaucracy and less management and more getting things done. </p>\n<h2>The Whole Package</h2>\n<p>Location: Anywhere you want.</p>\n<p>If you want to work remote, that's cool. If you want to work near others, that's cool too. The current support team is in Washington, Virginia, Florida, Connecticut, Wisconsin, Texas, Australia, and Spain.</p>\n<p>Compensation:</p>\n<ul>\n<li>Based on experience</li>\n<li>Great healthcare + dental + vision coverage</li>\n<li>401k retirement plan with 4% company match</li>\n<li>Profit sharing</li>\n<li>2-3 annual company retreats to awesome places</li>\n</ul>\n<p>Pick your own equipment. We'll set you up with whatever laptop + monitor combo you want plus any software you need. </p>\n<p>Unlimited vacation policy (plus we insist you take at least 2 weeks off each year - this isn't a vague policy where unlimited vacation means no vacation). </p>\n<p>Work with awesome companies around the world. We partner with the best software companies in the world and you'll constantly get to <a href=\"https://zapier.com/zapbook\">interact with people from these great companies</a>.</p>\n<p>Set your own destiny.</p>\n<h2>How to Apply</h2>\n<p>Applying is simple.</p>\n<ul>\n<li>Send an email to supportjobs@zapier.com</li>\n<li>Tell us about yourself</li>\n<li>Tell us why you want to work at Zapier vs. somewhere else.</li>\n</ul>\n<p>Then answer these 6 questions:</p>\n<ol>\n<li>What should our goal be when replying to users?</li>\n<li>A user requests an integration with a service that we don't support yet. How would you word your response?</li>\n<li>Set up a zap that takes new Gmail emails from a specific sender and adds them to a Google Sheets spreadsheet.  Send us the link to the zap and a share link for the spreadsheet.</li>\n<li>Send us a link to an app's API docs that you think are well done, and explain why you think they are good.</li>\n<li>Look at <a href=\"https://gist.github.com/WadeFoster/0bd294efe54f8fb8a1e7\">this list</a> and pick the 5 things that most excite you. Also pick the 5 things that least excite you. Don't pick by your opinion of importance, this is mostly to see interest/experience. Please put this answer somewhere like <a href=\"https://gist.github.com\">Gists</a> or <a href=\"http://pastebin.com\">Pastebin</a> and include a link in your email.</li>\n<li>How did you hear about Zapier?</li>\n</ol>\n<p><em>All teammates at Zapier also agree to a <a href=\"https://zapier.com/jobs/zapier-code-of-conduct/\">code of conduct</a> that keeps Zapier a safe, welcoming and inclusive environment.</em></p>","publish_date":"2016-01-15"},{"link":"jobs/fleetio.html","location":"Birmingham, AL / Remote","published":"Jan 13","id":18,"title":"Fleetio Customer Experience Rep","body":"\n<p>As a Customer Experience Rep for <a href=\"https://www.fleetio.com/\">Fleetio</a>, your job is to support our customers and enable their success. This is a demanding but rewarding role that requires a broad skill set. You’ll be directly responsible for keeping Fleetio’s&nbsp;customers happy and productive. You will also work with the product teams to test new features and provide feedback based on customer conversations.</p>\n<p>Companies around the world rely on Fleetio to manage their fleet operations. Your job is to ensure that Fleetio’s customers have the best customer service experience possible.</p>\n<p>We take customer service seriously. This is a position we consider essential to the company’s success. Be sure to mention coffee in your cover letter so we know you actually read this.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Handle inbound customer requests via email and phone (90% email, 10% phone)</li>\n<li>Quickly resolve customer inquiries with helpful, personalized responses</li>\n<li>Identify, reproduce and document bugs for the product teams</li>\n<li>Assist the product teams by testing new features and bug fixes</li>\n<li>Spot trends in customer issues and communicate to product teams</li>\n<li>Write documentation and contribute content to our <a href=\"http://help.fleetio.com/\">Help Center</a></li>\n<li>Create screencasts (video tutorials) for specific features and functionality</li>\n<li>Monitor and report on support metrics and KPIs and suggest improvements</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Ability to work 8am – 5pm, CT, Monday through Friday</li>\n<li>Genuine empathy for customers, and desire to make them feel happy and understood</li>\n<li>Passion for exceptional customer service and appreciation for its role in a company’s success</li>\n<li>Excellent writing and communication skills</li>\n<li>Resourceful and determined, yet not afraid to ask for help</li>\n<li>Natural troubleshooting skills</li>\n<li>Serious attention to detail</li>\n<li>Excited by technology and its ability to make you more productive</li>\n<li>Prior experience doing email-centric customer support for a web application is highly desirable</li>\n<li>College degree or equivalent professional experience preferred</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>100% coverage of health and dental insurance</li>\n<li>401(k)</li>\n<li>Competitive salary and meaningful equity</li>\n<li>Open PTO policy</li>\n<li>Mac laptop and whatever tools you need</li>\n</ul>","publish_date":"2016-01-13"},{"link":"jobs/supercell.html","location":"Helsinki, Finland","published":"Jan 11","id":19,"title":"Supercell Player Support Specialist","body":"\n<p>Want to work in one of the most disruptive Customer Support organizations on the planet? Then maybe it’s time for you to get ready for the north and join us here in our HQ in Helsinki, Finland.</p>\n<p>We are looking for a Player Support Specialist to reinforce our multicultural team. The person we are looking for is a gamer with a strong background in customer support and a unicorn-like personality who wants to push the boundaries of support for mobile games and beyond.</p>\n<p>You are self-driven and hands-on? You can take decisions on a day-to-day basis independently? You don’t mind getting your hands dirty and address our players on individual level? Great, we have a team structure with minimal hierarchy and no red tape where the only limits to what’s achievable are set by your imagination. If you want to make a difference for millions of players around the globe every single day, this might be the right place for you.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Become an expert at Supercell games and our internal tools</li>\n<li>Be a point-of-contact for escalations, content questions and ad-hoc decisions and requests for our local outsourcing partners and our other offices</li>\n<li>Use data to support the development of processes and policies</li>\n<li>Support the internal live game liaisons with their day-to-day requests</li>\n<li>Apply your knowledge to current and new Player Support projects</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Excellent verbal and written English skills</li>\n<li>Previous experience (2–3 years) in a customer support role</li>\n<li>Team player with strong problem solving and conflict management skills</li>\n<li>Empathic and culturally aware</li>\n<li>Passion for video games and mobile applications</li>\n<li>Ability to travel frequently (other Supercell offices and partners)</li>\n</ul>\n<h3>Nice to Haves</h3>\n<ul>\n<li>Fluent in French, Italian, German, Spanish, Portuguese, Japanese, Chinese, Korean, Turkish, Arabic, Dutch, Russian, Finnish or Klingon</li>\n<li>Passion for one or multiple Supercell games Experience working in multicultural environments</li>\n</ul>\n<h3>Supercell Offers</h3>\n<ul>\n<li>A first-row view into one of the most successful game companies in the world</li>\n<li>Opportunity to work with a team of gaming veterans, top talent, and passionate gamers</li>\n<li>Easy-going, enthusiastic, open and at the same time a very results-driven culture</li>\n<li>Competitive compensation</li>\n<li>Smartphone, tablet, laptop/workstation of your own choice</li>\n<li>Industry leading benefits</li>\n<li>Amazing co-workers</li>\n</ul>","publish_date":"2016-01-11"}]