[{"link":"jobs/resource-guru.html","location":"UK (Remote)","published":"Mar 31","id":1,"title":"Customer Success Guru (£25-28K, Share Options, Work Remotely) ","body":"\nResource Guru is a leading cloud-based team calendar and leave management app. It’s the fast, simple way to schedule people, equipment and other resources online. We have customers from over 150 countries around the world including Microsoft, Ogilvy, Deloitte, Yahoo!, AT&T, HBO and the NHS. They all trust Resource Guru to handle one of their most precious assets - their people’s time. Resource Guru was founded in 2011 in London and is backed by one of the world’s leading VCs, Index Ventures. Visit http://resourceguruapp.com for more.\n\nWe are a remote team with employees across the UK and South Africa. This means you would be free to work from anywhere with a 4 hour overlap with GMT and a good internet connection. We will be happy to pay for coworking space if you need it.\n\n### In Brief\nWe like our customers to smile when they think of Resource Guru :) We think of customer service as an opportunity to engage with our customers, and wherever possible convert them into brand advocates. Your main role is to make that happen. As well as supporting existing customers, you’ll be dealing with enquiries from potential customers too. You’ll usually be speaking to people via email, but you’ll also be hosting online demos and will occasionally need to jump on the phone.\n\nYou’ll help to troubleshoot any technical issues our customers face - whether they’re struggling to change their password, or they’ve reported a bug which needs investigating by our engineers.\n\nAs a separate part of the role, you will carry out QA testing prior to feature releases and, because we’re a small startup, you may also be asked to help out in various other areas too.\n\nWe are looking for a radiator, not a drain. Someone who can empathise with others, is passionate about technology, is level headed and has a pragmatic approach to problem solving.\n\n### What You’ll Be Doing\n- Helping to manage the day-to-day customer service for Resource Guru and responding to tickets in a timely manner\n- Conducting customer product demos online\n- Testing new features and enhancements prior to release\n- There’s always lots to do when you work in a startup, so there’ll be plenty of other stuff to get your teeth stuck into!\n\n### What We’re Looking For\n- An empathetic, conscientious and resourceful person with experience in customer service\n- Someone with patience, an upbeat disposition and a good sense of humour who can turn disgruntled customers into happy ones\n- A technically inquisitive and knowledgeable person who delights in helping others, can empathise with their issues and think laterally about how to replicate them\n- A rigorous troubleshooter who wants to dig deep and get to know our product inside out\n- A clear, concise communicator who can keep it light and playful but knows when to be serious\n- Someone with excellent English who understands technical jargon\n- A positive, autonomous person who is familiar with, and enjoys, remote working\n\n### These Would Be A Bonus\n- Experience of working in a startup environment\n- Experience of working on a SaaS product\n- Sales experience\n\n### What We’re Offering\n- A full time position with a salary of £25-28k\n- Work from anywhere with at least 4 hrs overlap with GMT\n- 25 days paid holiday per year (yes, on top of public holidays!)\n- Flexible hours\n- Monthly exercise contribution - use it for anything from gym membership to exercise equipment\n- A small, friendly team - we like to think of ourselves as a family :)\n- Share options\n- Extra day of holiday on your birthday\n\nIf all this rings a bell with you and you’d like to work for one of the UK’s most successful startups, then we would love to hear from you!","publish_date":"2017-03-31"},{"link":"jobs/protrainings.html","location":"Grand Rapids, MI -or- Remote","published":"Mar 23","id":2,"title":"ProTrainings Customer Happiness Hero","body":"\n### You...\n- Are good at seeing things from other people's point of view\n- Strive to take care of others like you would take care of your own family\n- Love to build relationships with customers\n- Want to take customer care to the next level\n- Emulate other companies that provide amazing service: Disney, Chick-Fil-A, Nordstrom, Ritz-Carlton, Trader Joe's, and Zappos are some great examples\n- See the value in having a rabid, loyal customer base\n- Embrace change\n- Push for excellence\n\n### What you'll be doing\n- Delighting our customers by forming real relationships with them (through phone, email, and chat), including sending out postcards and follow-up emails to show our appreciation\n- Forming meaningful relationships with company administrators (Nike, Buffalo Wild Wings, Bed Bath & Beyond, Goodwill, and Jazzercise are just a few companies that use us) while assisting them with setup, onboarding, and follow-up\n- Providing insightful advice and friendly support to ProTrainings customers in need\n- Quickly diagnosing problems on the spot, determining and explaining situations with patience and empathy so they can get trained and get back to work\n- Taking ownership of every customer interaction — we empower you to make decisions and care for customers in creative ways — no robots here\n- Collaborating with other departments to WOW our customers\n- Learning and growing professionally by taking time every week to read articles or books from our bookshelf to better yourself\n- We are open to remote workers who have a great work ethic, are self-motivated, and do great work without direct supervision\n\n### Availability\nOur goal is to create a schedule that you’ll love. We’re currently in need of additional weeknight (5pm-8pm EST) and weekend (12pm-8pm) Happiness Hero coverage. These shifts could be filled in a number of ways, from joining either part or full-time (or something in-between). We’re truly open and flexible to creating a win-win solution.\n\n### Desired experience\nYou have worked in a customer-relations role in the past, whether that was as a receptionist, a call center rep, nursing assistant, barista, bank teller, anything in retail, or any other position in which you helped and delighted customers.\n\n### Basic skills we're looking for\n- Strong writing skills\n- Strong people skills\n- A good speaking voice\n- Ability to maintain composure and customer focus while troubleshooting and solving technical issues\n- Comfortable with technology\n- Fast typer\n- Comfortable on phone, email, and chat\n- Fast learner\n- Attention to detail\n- Bonus if you are able to speak Spanish (at least at a high school level) and interested in learning more\n\n### Benefits you'll love\n- Fun culture / atmosphere\n- A career that makes a difference (train people to save lives, hear heroic stories, and receive awesome testimonials from really grateful customers)\n- High level of autonomy and creativity while helping and delighting customers\n- Extensive, continuous training (you won't be thrown in blind)\n- Professional development library (request a book or resource, and you'll have it within 2 weeks)\n- CPR / first aid training & certification\n\n<b>Full-time employees are also eligible for:</b>\n- Health / dental insurance\n- Paid time off\n- 401k with company match\n\n### Ready to help save lives?\nIf you're still reading this, we would love to learn more about you. Shoot an email to <a href=\"mailto:careers@protrainings.com\">careers at protrainings.com</a> and include the following:\n\n- A fun, catchy subject line\n- Your top 3 strengths\n- A time that you went above and beyond to help someone (preferably in a work setting, but a personal interaction is fine)\n- Your ideal schedule (full or part time, which days/hours)\n- Why you want to work at ProTrainings\n- Your résumé","publish_date":"2017-03-23"},{"feature":"true","link":"jobs/expensify-london.html","location":"London","published":"Mar 18","id":3,"title":"Expensify Success Coach","body":"\n### Your Mission, Should You Choose to Accept:\n\nExpensify prides itself on solving real-world problems with a team of top-notch product experts. We are reinventing the way people look at expense reports by automating not just the expense report, but the entire business trip. Joining our team means you are helping us fight the good fight against expense reports that suck!\n\n### About The Job\n\nAs a Success Coach, you’ll focus on making sure that our customers are successful in using Expensify. You’ll do this by applying a deep understanding of our customers, their processes, our product and the systems with which we integrate. Our customers come in all shapes and sizes and we do our best to make them as happy as possible (read: phenomenal support is the name of the game). When our product changes, you’ll be the point of contact for our customers via email, in product announcements, phone calls and (occasional) in-person visits.\n\n### About You\n\nJoining our team means you enjoy a fast-paced and ever changing work environment. You’re fearless and relish in big challenges, working within the grey and making it concrete and clear. You’re entrepreneurial, you love developing relationships with others and helping them solve complex problems -- all with the ease of a trapeze artist! You’re a digital maven and love interacting with customers through email, in-product, and sometimes over the phone. Because Expensify is a simple product that connects to a variety of deceptively complex financial systems, you’re also someone who is comfortable wading in the complicated waters of accounting and simplifying it for our customers.\n\n### For the best possible fit, we are looking for someone who can:\n- Deftly articulate complex thoughts. One moment you may be having a technical discussion with an engineer about the product implications of a new feature, before quickly moving on to working directly with a non-technical customer to fix a problem. The ideal candidate will be able to clearly articulate themselves in each scenario.\n- Maintain customer relationships and problem solve on their behalf by providing clear and friendly written (and verbal) communication.\n- Manage time and prioritize efficiently. Things move quickly in this environment and it’s crucial that you are able to react to new information and re-prioritize accordingly.\n- Learn from peers across teams in an informal fashion. After all, no one is an expert at Expensify and we're all learning things as we go. We also love anyone who's able to effectively train colleagues as we grow the team.\n- Do what it takes to bring the most value to the company day to day, even if it may be sometimes repetitive and not so glamorous. #oneteamonedream\n- Support customers day in and day out, with the understanding that a product-driven company grows nowhere without a happy customer base. Make no mistake, this role is squarely grounded in support, no matter the customer size.\n- Say “no” and communicate that things won’t always change “now”. This helps to keep our product simple and user-friendly, but it is only possible with in-depth product knowledge and a deep understanding of the problem that the customer is trying to solve.\n- Bonus: Some general understanding of the accounting process, Not required!\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n- Describe a memorable experience - whether at work or in your personal life - working with a client/customer. What issue did they face, and and how you were able to address their concerns? If you weren't successful addressing their concerns, why not?\n- Pretend you had a month to do whatever you wanted. What would you do? And would this be sufficient time to accomplish the goals you set out to achieve?\n- If you were tasked with analyzing customer behavior and recommending product-driven solutions, how would you approach that problem?\n- What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n- How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.\n\nResume not your thing? That’s great, we don’t really read them anyways! Forward your responses to the questions to jobs@expensify.com. We're excited to hear from you!","publish_date":"2017-03-18"},{"feature":"true","link":"jobs/expensify-portland.html","location":"Portland, OR","published":"Mar 18","id":4,"title":"Expensify Success Coach","body":"\n### Your Mission, Should You Choose to Accept:\n\nExpensify prides itself on solving real-world problems with a team of top-notch product experts. We are reinventing the way people look at expense reports by automating not just the expense report, but the entire business trip. Joining our team means you are helping us fight the good fight against expense reports that suck!\n\n### About The Job\n\nAs a Success Coach, you’ll focus on making sure that our customers are successful in using Expensify. You’ll do this by applying a deep understanding of our customers, their processes, our product and the systems with which we integrate. Our customers come in all shapes and sizes and we do our best to make them as happy as possible (read: phenomenal support is the name of the game). When our product changes, you’ll be the point of contact for our customers via email, in product announcements, phone calls and (occasional) in-person visits.\n\n### About You\n\nJoining our team means you enjoy a fast-paced and ever changing work environment. You’re fearless and relish in big challenges, working within the grey and making it concrete and clear. You’re entrepreneurial, you love developing relationships with others and helping them solve complex problems -- all with the ease of a trapeze artist! You’re a digital maven and love interacting with customers through email, in-product, and sometimes over the phone. Because Expensify is a simple product that connects to a variety of deceptively complex financial systems, you’re also someone who is comfortable wading in the complicated waters of accounting and simplifying it for our customers.\n\n### For the best possible fit, we are looking for someone who can:\n- Deftly articulate complex thoughts. One moment you may be having a technical discussion with an engineer about the product implications of a new feature, before quickly moving on to working directly with a non-technical customer to fix a problem. The ideal candidate will be able to clearly articulate themselves in each scenario.\n- Maintain customer relationships and problem solve on their behalf by providing clear and friendly written (and verbal) communication.\n- Manage time and prioritize efficiently. Things move quickly in this environment and it’s crucial that you are able to react to new information and re-prioritize accordingly.\n- Learn from peers across teams in an informal fashion. After all, no one is an expert at Expensify and we're all learning things as we go. We also love anyone who's able to effectively train colleagues as we grow the team.\n- Do what it takes to bring the most value to the company day to day, even if it may be sometimes repetitive and not so glamorous. #oneteamonedream\n- Support customers day in and day out, with the understanding that a product-driven company grows nowhere without a happy customer base. Make no mistake, this role is squarely grounded in support, no matter the customer size.\n- Say “no” and communicate that things won’t always change “now”. This helps to keep our product simple and user-friendly, but it is only possible with in-depth product knowledge and a deep understanding of the problem that the customer is trying to solve.\n- Bonus: Some general understanding of the accounting process, Not required!\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n- Describe a memorable experience - whether at work or in your personal life - working with a client/customer. What issue did they face, and and how you were able to address their concerns? If you weren't successful addressing their concerns, why not?\n- Pretend you had a month to do whatever you wanted. What would you do? And would this be sufficient time to accomplish the goals you set out to achieve?\n- If you were tasked with analyzing customer behavior and recommending product-driven solutions, how would you approach that problem?\n- What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n- How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.\n\nResume not your thing? That’s great, we don’t really read them anyways! Forward your responses to the questions to jobs@expensify.com. We're excited to hear from you!","publish_date":"2017-03-18"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Mar 6","id":5,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2017-03-06"},{"has_chat":"true","feature":"true","link":"jobs/cartstack.html","location":"Remote","published":"Mar 2","id":6,"title":"CartStack Customer Support / Success Hero","body":"\nAs a customer support hero, problem-solving, clear-communication, and empathy are your strongest traits! You will be the voice of CartStack's support channels in your quest to WOW customers by exceeding their expectations :)\n\nCartStack is a growing SaaS startup that offers a cart abandonment solution for e-commerce websites. Our mission is simple…. Be known as the most powerful cart recovery solution in the world! \n\n### Responsibilities you will own:\n- Respond to and resolve customer questions via livechat and email (and every once in awhile, phone)\n- Review new customer's websites to make sure our tracking code (javascript snippet) is integrated properly\n- Pro-actively helping new trialers get onboarded with their new accounts\n- Assist in developing first-class content for our help docs website\n- Review existing customer accounts for any issues or possible account optimizations\n- Reach out to customers about referrals and testimonials\n- Come up with and execute random acts of kindness for our customers :)\n\nThis is a contract to full-time hire position. We would like you to start out with a 90 day contact and if we are a good fit for each other, we'll move into a W2 position + benefits. \n\n### REQUIREMENTS\n- You must be self-motivated, detail-oriented, empathetic, and passionate about about helping people\n- 1 + years of customer support experience (Bonus if it's for a SaaS company!)\n- Foundational understanding of HTML and basic JavaScript\n- Experience working in a remote environment\n- College educated\n- Fantastic writer and communicator\n- Access to high-speed internet\n\n### BENEFITS\n- Remote work and flexible schedule\n- We genuinely care about our employees/contractors and their happiness in their every day work\n- Chance to step in and have a big impact on a growing SaaS company\n- A fun, relaxed company culture (Skype happy hours every month!)\n- Annual team trip\n- We focus on learning and personal/career growth ($100/mo budget for learning / books / courses)\n- Competitive compensation (w/ opportunity for growth related bonuses)\n- When you transition to a full-time employee you would receive health and dental insurance + some other perks\n\nSo, sound like an awesome fit for you? If so, we'd love to hear from you!","publish_date":"2017-03-02"},{"link":"jobs/door-to-door-organics.html","location":"Louisville, CO","published":"Mar 1","id":7,"title":"Door to Door Organics Customer Care Representative","body":"\nWe are seeking full-time and part time Customer Care Representatives to join our highly-valued Customer Care Team. This team member will be friendly and energetic and able to act as the voice of the company in high-stress situations. The right candidate must be extremely motivated, friendly and personable while maintaining flexibility, solving problems quickly, and staying organized under pressure.\n\n### Qualifications:\n- Provides a WOW customer service experience with every interaction\n- Improves company operations by providing customer service input and recommendations to the Customer Care Team Lead\n- Meets and exceeds regular customer service standards\n- Proactively respond to customer service trends\n- Able to make decisions quickly in a fast paced, dynamic environment\n- Excellent oral and written communication skills\n- Demonstrate high proficiency in Microsoft Office, CRM tools, and able to learn new technology systems quickly and with ease while on the job\n- Able to work in a fast paced environment\n- Strong interpersonal skills\n\n### Candidate Requirements:\n- Bachelor's degree or equivalent professional experience\n- Able to work flexible hours including nights and weekends\n- Passionate about helping customers live better and simpler lives\n- 3+ years of experience in a customer service role\n\n### What makes you the right candidate?\nYou LOVE serving others and maintain a passion for great food with local, organic and sustainable foods routinely part of your grocery shopping requirements.\n\nYou aren't afraid to jump into the unknown to fix a problem, and you're good at finding the right resources to help figure it out on the fly.\n\nYou think online shopping is an obvious solution for groceries, and are excited not only to work for Door to Door Organics,, but to shop at Door to Door Organics, too!\n\n### Interested? Please submit:\nA copy of your resume.\nA cover letter explaining why you want to work for Door to Door Organics.\nA brief description of the most difficult customer you served and how you made them happy.","publish_date":"2017-03-01"}]