[{"link":"jobs/livestream.html","location":"New York, NY","published":"Jul 14","id":1,"title":"Livestream Live Video Support Specialist","body":"\n<div id=\"content\" class=\"\">\n      <p><strong>What’s this job?</strong></p>\n<p>Your job is to make the world a better place one support ticket at a time. From our not-so-secret lair in Bushwick you’ll help our producers across the US and even around the world. &nbsp;We’re here to make sure their work gets to their audience.</p>\n<p><strong>What will you do here?</strong></p>\n<ul>\n<li>Answer customer questions and concerns regarding Livestream's hardware products, platform services and anything in between.&nbsp;</li>\n<li>Troubleshoot technical issues, drive the product roadmap and help developers diagnose bugs.</li>\n<li>Be the first point of contact for incoming calls, emails, and online chats.</li>\n<li>Write and update customer facing FAQs and other internal documents.</li>\n<li>Proactively look for ways to improve our service and to better serve our customers.</li>\n</ul>\n<p><strong>Who you are:</strong></p>\n<ul>\n<li><strong>A video or internet guru.</strong>&nbsp;</li>\n<ul>\n<li>We help people stream video over the internet - you should be a master of at least one of those things and excited to learn the other.</li>\n</ul>\n<li><strong>Passionate about connecting with and helping people.</strong></li>\n<ul>\n<li>You love listening, talking, and working with people makes you happy.</li>\n<li>You're patient, sympathetic, and understand how to find that sweet balance between customer service and genuine friendliness.</li>\n</ul>\n<li><strong>An exceptional communicator.</strong></li>\n<ul>\n<li>You treat people kindly and can gracefully break down, solve, and explain, even the most complex problems.</li>\n<li>Bonus: You cringe when you see poor grammar in social media posts.</li>\n</ul>\n<li><strong>Curious.</strong></li>\n<ul>\n<li>You master any area you work in and naturally do more than is asked of you.</li>\n<li>You take initiative and ownership to see things through to completion.</li>\n<li>We won’t micro-manage you. We provide you with lots of wiggle room and you must be hungry to learn and grow with the company.</li>\n</ul>\n<li><strong>A team player. </strong></li>\n<ul>\n<li>You get along with others and know how to keep the mood light.&nbsp;<a href=\"http://media0.giphy.com/media/5r5J4JD9miis/giphy.gif\">Your .gif game is on point!</a></li>\n</ul>\n</ul>\n<p><strong>Required for a callback:</strong></p>\n<ul>\n<li>Bachelor's level education or above.</li>\n<li>Demonstrated job stability - at least 1 year in a professional environment.</li>\n<li>At least 6+ months experience working in a customer service or support role.&nbsp;</li>\n<li>Ability to work a flexible schedule that&nbsp;includes required evening&nbsp;and weekend shifts.</li>\n<li>Solid computer skills - you need to know your way around a Google spreadsheet; blindfolded after spinning on a bat 10 times.</li>\n<li>¿Hablas español? No es necesario. ¡Pero sería genial!</li>\n</ul>\n<p><strong>What are the benefits?</strong></p>\n<ul>\n<li>Full Time Position</li>\n<li>Competitive salary</li>\n<li>Comprehensive health, dental, and vision coverage</li>\n<li>401(k) savings</li>\n<li>Paid holidays</li>\n<li>Commuter Discounts</li>\n<li>Annual company outing and regular celebrations</li>\n<li>Stacks of snacks and caffeine</li>\n<li>Working with awesome people</li>\n</ul>\n<p><strong>&nbsp;</strong></p>\n</div>","publish_date":"2016-07-14"},{"has_chat":"true","link":"jobs/capsule.html","location":"UK/Remote","published":"Jul 13","id":2,"title":"Capsule Customer Support","body":"\nSince 2009 we’ve been making it easy for business to take care of their customers and sales opportunities. Capsule is now one of the most popular CRM’s for small business and sales teams.\n\nWe’re expanding our support team and looking for someone who loves helping people out. Troubleshooting and communication will be a big part of your job and you’ll be comfortable using email & twitter to keep our customers happy. You’ll also spend some time working with our development and design teams to share customer feedback and test new features.\n\nWe’re a UK based company with an office in central Manchester. We’re open to remote working if you’re outside of Manchester, but you need to be in the UK for this position. You’ll be joining a small, dedicated & friendly team that cares deeply about the customer experience. We offer a start-up style culture with a competitive salary and benefits.\n\n### What we’re looking for:\n- You have experience helping customers through a previous marketing or support-related position\n- You’re tech savvy with an interest in web and mobile apps\n- You’ll be a great writer with a positive style and enjoy describing solutions simply\n- You’re able to read between the lines when necessary and minimise emails back-and-forth to get to a solution quickly\n- You’re self motivated and confident working independently but you also know your limits and when to seek direction\n- You’re a pro at minimising disruptions whether working remotely or in the office and can get through a high volume of emails each day\n\n### A typical week involves:\n- Helping people get the most out of Capsule by responding to emails and tweets\n- Troubleshooting and detailing issues for our developers to resolve\n- Sharing customer feedback with the design and development team\n- Creating and updating helpful online support guides\n- You’ll also spend some time contributing to scaling and improving our internal support practices\n\n### We offer very competitive salaries and benefits\n- Flexible working hours\n- 25 days paid annual leave in addition to the stat holidays\n- Private medical, dental and optical insurance\n- Pension scheme with generous matched contributions\n- Casual dress environment\n- The best kit for the job (which usually means lots of Apple gear)\n- Monthly eBook allowance with your choice of iPad Mini or Kindle\n- Mobile phone (e.g. Android or iPhone)\n- Conference allowance\n\n### How to apply:\nIf this excites you and your experience and strengths match what we’re looking for <a href=\"mailto:jointheteam@capsulecrm.com\">send us an email</a> introducing yourself.","publish_date":"2016-07-13"},{"link":"jobs/github-enterprise-support-agent.html","location":"North America (Remote)","published":"Jul 6","id":3,"title":"GitHub Enterprise Support Agent","body":"\nMore and more companies are using GitHub Enterprise, so the support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. This person will join GitHub as part of our global support team and support our customers around the world. We're looking for Enterprise Support Agents in North America (US and Canada) who will answer incoming phone calls, triage issues, and help provide solutions.\n\nThe position reports to an Enterprise Support Manager and works closely with other teams and leaders across the company.\n\nGitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events.\n\n### RESPONSIBILITIES\n- Take in-bound phone support requests\n- Triage incoming support tickets\n- Work collaboratively with other support teams\n- Manage communication around customer tickets\n- Troubleshoot and help solve highly complex support tickets\n- Escalate issues to other support engineers and managers as applicable\n- Work with our Engineering team to prioritize issues and development\n- Work with our Documentation team to improve customer-facing resources\n\n### QUALIFICATIONS\n- Must have current working authorization to work in the U.S.\n- Knowledge of Linux servers\n- General understanding of how modern web applications work\n- Enthusiasm for working directly with customers\n- Ability to clearly write and orally communicate technical information\n- Ability to review and understand code (Ruby / Bash)\n- Must have a workspace conducive to answering phone calls\n- Prior experience providing technical support\n- Excellent problem solving skills\n- Strong empathy for GitHub users and GitHub Support\n\n### BONUS POINTS IF YOU HAVE\n- Technical experience (QA, documentation, systems administration, etc.)\n- Familiarity with Git and GitHub","publish_date":"2016-07-06"},{"link":"jobs/github-enterprise-support-engineer.html","location":"North America (Remote)","published":"Jul 6","id":4,"title":"GitHub Enterprise Support Engineer","body":"\nMore and more companies are using GitHub Enterprise, so the support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. This person will join GitHub as part of our global support team and support our customers around the world. We're looking for Enterprise Support Engineers, in North America (US and Canada) to support our GitHub Enterprise product installed and managed in the customer's virtualization environment.\n\nYour main responsibility will be to work with our customers to solve support tickets. Tickets are usually opened by internal system administrators, and can include investigating load or networking issues, debugging application errors, and discussing feature requests. You'll also work with our engineering team to prioritize issues and development, and our documentation team to improve customer-facing resources. You don’t need to be a Git expert, but you do need to have technical experience and a passion for helping people.\nThe position reports to an Enterprise Support Manager and works closely with other teams and leaders across the company.\n\nGitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events.\n\n### RESPONSIBILITIES\n- Solve complex customer support tickets often involving Linux servers, source code, and web application issues\n- Effectively communicate technical information to customers and engineering groups at GitHub\n- Work proactively with customers on activities such as coordinating upgrades, communicating upcoming features, and ensuring their installation is running smoothly\n- Identify bugs and improvements in the GitHub Enterprise codebase\n- Manage urgent customer outages during business hours\n\n### QUALIFICATIONS\n- Must have current legal working authorizaton\n- General understanding of how modern web applications work\n- Prior experience providing technical support\n- Excellent problem solving skills\n- Familiarity with some flavor of production-level virtual machine (e.g., VMware ESX, Xen, KVM)\n- Enthusiasm for working directly with customers\n- Stellar English and grammar skills\n\n### BONUS POINTS IF YOU HAVE\n- Worked closely with large complex customer accounts\n- Familiarity with Git and GitHub\n- Experience with phone support\n- Ability to look through and understand code (Ruby / Bash)\n- Previous experience as a System Administrator\n- Previous experience as a Linux System Administrator","publish_date":"2016-07-06"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Jul 5","id":5,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2016-07-05"},{"has_chat":"true","link":"jobs/vimeo.html","location":"New York, NY","published":"Jul 4","id":6,"title":"Vimeo Technical Support Manager","body":"\nVimeo is a leading online video platform with more than 160 million visitors per month. We provide an expansive, high-end toolset for video creators, creative professionals, and businesses, as well as a world class video player.\n\nOur advanced platform and passionate members are matched by an equally remarkable Support + Community team who provide expert assistance on topics like video playback, compression, uploading, and embedding.\n\nThat's where you come in. We're looking for a Technical Support Manager to join our Support + Community team at our gorgeous NYC HQ. You'll take the lead on supporting users through their playback, player customization, uploading, and video / audio compression issues in all the different places they can occur (e.g., vimeo.com, other websites, mobile devices, and connected TVs).\n\n### RESPONSIBILITIES:\n- Tackle support escalations from other team members, providing friendly, expert assistance to users\n- Vet and ticket user-reported bugs, and communicate with our Engineering team, users, and community team about the status of each open issue\n- Create user-facing FAQs and troubleshooting instructions\n- Create training documents and troubleshooting guides to empower other team members to effectively handle issues on their own\n- Provide Support team with regular updates about all outstanding issues impacting users\n- Track trends in technical issues and user feedback and prepare monthly and annual reports of the most noteworthy items\n- Proactively surface major user concerns to our Product team\n- Maintain our \"Compression Guidelines\" and tutorials - the technical guidelines we provide to Vimeo uploaders\n\n### SKILLS & KNOWLEDGE REQUIRED:\n- Expert technical troubleshooting skills or some kind of technical background\n- Curiosity for understanding how things work “under the hood”\n- Familiarity with how websites are put together, and an aptitude for keeping up with constantly evolving technologies\n- 1+ year of experience in customer support (the more the better)\n- Excellent written communication and interpersonal skills\n- Familiarity with all major browsers and developer tools\n- Familiarity with the processes of video editing and compression (let us know which programs you've used!)\n- Proactive and highly organized approach to work\n- Familiarity with the Vimeo platform and player\n- If you know what these terms mean already, you've got a leg up: Content Delivery Network, H.264, adaptive streaming, bits vs. bytes, JavaScript console.\n\n### BONUS POINTS:\n(These aren't requirements, but they'd be giant gold stars on your resume)\n\n- You have experience working with both engineers and end-users\n- You have experience using a bug tracking system and ticketing technical issues (GitHub, Jira, etc.)\n\n### ABOUT THE COMMUNITY TEAM:\nVimeo’s Community team is responsible for making sure that the amazing humans who use our website are happy, supported, and engaged. Community team members maintain our Help Center, manage the Community Forums, host Weekend Challenge video contests, and provide expert product and technical support via email and social media. They’re also advocates for the community within the company. They spend all day interacting with Vimeans directly, so they’re the experts on what our members love about Vimeo and what features they’d like to see in the future.","publish_date":"2016-07-04"},{"link":"jobs/github-specialist.html","location":"APAC, EU, US","published":"Jul 1","id":7,"title":"GitHub Dotcom ToS Support Specialist","body":"\nThe GitHub Terms of Service Support team is looking for full-time team members in our SF office or worldwide! GitHub users work 24/7, so you'll occasionally need to adjust your work week to help cover a weekend or holiday (don't worry! We strongly support flexible schedules that let you to take care of the important things in your life).\n\nWhen GitHub users have questions, they email support. We help people as quickly and awesomely as possible. Our Terms of Service team supports users with issues related to site policy, including DMCA takedowns, trademarks, spam and abuse, and privacy. This requires a logical brain, good intuition and problem solving skills, plus the ability to objectively apply GitHub's values to a variety of socially and emotionally sensitive topics. We work closely with GitHub's Legal team, so an interest in law is also an asset.\n\nThe most important characteristic of our support team is that we love helping developers. The Terms of Service Support team specifically helps people understand and follow the policies that make GitHub a place for people to work better, together.\n\nOur support teammates have excellent writing chops: stellar grammar, charming written personality, and the ability to explain complicated things simply. We measure our success in swiftness, accuracy, and clarity.\n\n### YOU MUST HAVE:\n- Stellar English and grammar skills\n- Excellent problem solving skills – you might not know all the answers but you know how to find and communicate the solution\n- A strong sense of empathy and the ability to advocate for others\n- A unique writing style and voice\n\n### BONUS IF YOU HAVE:\n- Prior customer support experience\n- Experience in law, policy-related, or regulatory fields\n- Experience working remotely","publish_date":"2016-07-01"},{"link":"jobs/github.html","location":"North America (Remote)","published":"Jul 1","id":8,"title":"GitHub Developer Platform Content Writer","body":"\nWe're looking for a writer to help create developer content for the GitHub Developer Documentation site.\n\nThis writer will report to the Documentation Team Manager and work cooperatively with the Documentation and Platform teams to document APIs and create guides to showcase the power of the GitHub platform products and tools, tailored to developers at different stages in their careers.\n\nIf you're a patient, compassionate writer who loves crafting innovative, useful reference documentation and usage samples to help developers build software, we really want to hear from you!\n\nThis person will be part of our global Support organization, writing content for users around the world. At this time, we're looking for candidates located in the US or Canada, with legal work authorization in one of those countries.\n\n### RESPONSIBILITIES:\n- Collaborate with the Documentation and Platform teams on planning, developing, and maintaining developer content for the GitHub Platform\n- Cooperatively review and edit drafts of developer content with other writers and developers on those teams\n- Communicate with Support, Product, and Engineering teams about the user feedback, product changes, and technical product information that inform our documentation\n\n### QUALIFICATIONS:\n- Working knowledge of HTTP and web requests\n- Familiarity with a higher-level programming language, such as Ruby, Python, or JavaScript\n- Ability to create high-quality, innovative content for software developers\n- Strong developer advocate, especially for those new to a platform\n- Ability to compassionately give and receive editorial critique\n- Excellent communication skills, especially when working with a distributed team (The Documentation team is currently entirely distributed)\n- Strong ability to plan, prioritize, and carry out complex writing projects with high attention to detail along the way\n- Located in the US or Canada, with legal work authorization in one of those countries","publish_date":"2016-07-01"},{"link":"jobs/replicated.html","location":"Los Angeles, California","published":"Jul 1","id":9,"title":"Replicated Support Engineer","body":"\nThe Support Engineer will work directly with our customers (including some of the best developer tools in the world) to ensure that their end customers are successful in deploying their application via Replicated.\n\nYou’ll need to know your way around common distributions of Linux, be comfortable in the command line and maybe write a few lines of bash.\n\nIn this role you’ll:\n- Help customers install and maintain their Replicated installations.\n- Build knowledge base of common mistakes\n- Work to improve the product and prevent issues.","publish_date":"2016-07-01"},{"link":"jobs/ultralinq.html","location":"London, UK","published":"Jul 1","id":10,"title":"UltraLinq Healthcare Solutions Implementation Specialist","body":"\nImplementation Specialists are responsible for the on-boarding process for prospects and new clients. Implementation Specialists must work with the on-boarding client to assess product needs, manage technical operations and roadblocks, and appropriately train the user base. Implementation Specialists must also participate in customer support and troubleshooting when necessary.\n\n### Job Responsibilities\n- Manage the on-boarding process for new clients.\n- Accurate logging, dispatching and resolution of 1st and 2nd level support requests.\n- Tracking of client feature requests.\n- User training for all client personnel who require access to the product.\n- After-hours support as required.\n\n### Job Skills\n- Familiarity with the project management lifecycle.\n- Ability to work independently with strong time management skills.\n- Excellent written communication skills; including above average grammar and spelling ability.\n- Understanding of the principles and process of troubleshooting.\n- Ability to communicate clearly, calmly and in an articulate manner over the phone.\n- Advanced competency regarding Microsoft Windows, web browsers, and a special focus on network and firewall configuration.\n- Strong understanding of networking principles (TCP, DNS, DHCP, etc.) and networking hardware setup.\n- Advanced knowledge of the UltraLinq and UpLinq applications.\n- Knowledge of medical workflows or familiarity with medical imaging devices, strongly preferred.\n- A pleasant demeanor and patient attitude.\n\n### Other Stuff:\n- Ideal candidate is local to London\n- Implementation Specialists are required to sit for extended periods of time.\n- Client Services Representatives must utilize a computer with a mouse for extended periods of time.\n- Travel: Approximately 25%","publish_date":"2016-07-01"},{"link":"jobs/klaviyo.html","location":"Boston, London, and Sydney","published":"Jun 27","id":11,"title":"Klaviyo Support Engineer","body":"\nEmail will no longer suck. Klaviyo is using technology to reinvent email marketing from the ground up! For far too long email marketing has been pretty selfish. Companies blast everyone with the same email, not because they think that’s what customers want, but because they don’t have a choice.\n \nKlaviyo fundamentally changes the game. Our software ties together everything companies know about their customers, processes massive quantities of data in real-time, and uses it to drive a platform that’s part CRM, part analytics engine and 100% an email platform that drives results.\n \nTechnology has come a long way in the last 15 years, but email hasn’t really changed. We’re here to fix that.\n\n### Success at Klaviyo \nSuccess is a super critical function that sits at the intersection of product, sales and marketing. The Success team is at the core of our business! \n\n### You Will\n- Respond to customer inquiries \n- Communicate technical concepts effectively to both technical and non-technical audiences \n- Serve as the Klaviyo Product Expert \n- Contribute to the knowledge base of the Klaviyo Customer Success Team \n- Collaborate with Engineering, Sales and Product to improve customer experience \n\n### You Have\n- 3+ years in a technical support role \n- In depth working knowledge of JavaScript, HTML, CSS \n- Proficiency with APIs","publish_date":"2016-06-27"},{"feature":"true","link":"jobs/code-climate.html","location":"New York, NY","published":"Jun 6","id":12,"title":"Code Climate Customer Success Manager","body":"\nCode Climate is the world's largest static analysis platform, helping over 50,000 developers improve the health of their codebases. We work hard to provide clear, timely and actionable insights derived from source code. We recently launched the Code Climate Platform, the first open, extensible platform for all types of static analysis.\n\nCode Climate is available on our hosted platform for free for open source projects, and offers paid subscriptions to analyze private source code either on our hosted platform or Code Climate Enterprise, our behind the firewall product. Our customers include Fortune 500s, public and private companies, large and small, with a range of technical sophistication and exposure to static analysis.\n\nAs a Customer Success Manager you’ll work with customers to help them achieve their software goals, primarily (but not necessarily exclusively) using Code Climate. You’ll also work closely with our engineering and customer service teams as a voice for these customers within the company.\n\nAs a key part of the external face of Code Climate, we're looking for someone who is invested in the success of our customers, and represents our values well by putting customers first and executing rigorously.\n\n## Examples of problems you'll be solving:\n* Becoming an active and positive collaborator in the customer’s mission to better improve their code and software development processes by learning about their unique goals, successes and challenges.\n* Navigating organizations to determine who are the influencers and decision makers.\n* Training clients and promoting wider and deeper Code Climate adoption within their organizations.\n* Educating customers with unique software development processes and environments about the best way to use Code Climate.\n* Concierge onboarding for customers with large teams of developers to ensure smooth integration of Code Climate into their organization\n* Integrating Code Climate into an organization’s existing IT environment -- including source code management, code review tools, and collaboration tools like Trello and Slack.\n* Diagnosing issues affecting customers and collaborating with the product engineering team to identify solutions (and creatively suggesting workarounds, when necessary).\n\n## You're awesome because:\n* You elicit glowing testimonials from customers.\n* You communicate clearly, concisely and honestly. Customers trust you.\n* You empathize with issues customers face and are compelled to solve them.\n* You continually advocate internally on behalf of customers, and can name from memory the problems that our biggest customers face.\n* You're never afraid to strike up a conversation with someone new, online or in person.\n* You’re comfortable having discussions with both technical and non-technical stakeholders.\n* You're able to navigate complex organizations.\n* You're technologically curious and always learning.\n\n## Working at Code Climate\n* Join a small team of around fifteen full-time people who love what they do.\n* Competitive compensation and meaningful stock options.\n* Flexible and generous paid time off including an open vacation policy and maternity/paternity leave.\n* Health, dental and vision insurance. We pay 100% of the premium and 50% of the premium for dependents.\n* Company retreats twice a year. So far we've gone to Bali and San Diego.\n* Opportunities to continue your professional development, including attending tech conferences.\n* Dog-friendly office stocked with snacks, drinks and cold-brew iced coffee.","publish_date":"2016-06-06"},{"feature":"true","link":"jobs/activecampaign.html","location":"Australia","published":"Jun 3","id":13,"title":"ActiveCampaign Platform Specialist - Australia","body":"\nActiveCampaign is a platform focused on email, marketing automation, and sales for small businesses.\n\n### WHAT YOUR DAY COULD CONSIST OF:\n- Assisting users via email, live chat, and phone\n- Consulting with clients to help them utilize our platform to achieve their unique goals\n- Conducting live demos of our platform with screensharing.\n- Keeping on top of the latest news in regards to email marketing, deliverability, and small business marketing in general.\n\n### WHAT IS NEEDED:\n- Past experience with sales and customer service — specifically with SAAS solutions\n- Past experience with email marketing, marketing automation, and/or marketing in general\n- The ability to efficiently respond to a significant number of emails, chats, & phone calls per day (once you are up to speed you should be handling over 100 requests a day)\n- A self-motivated and driven attitude where you will work towards achieving new goals\n- Excellent communication skills & the ability to relate to others\n- Input matters, your work has a high impact, and everyone is working together.\n- Being able to take a general idea and add your own insight and tweaks to it.","publish_date":"2016-06-03"},{"feature":"true","link":"jobs/expensify-coach.html","location":"London","published":"Jun 2","id":14,"title":"Expensify UK Success Coach","body":"\n### Your Mission, Should You Choose to Accept:\n\nExpensify prides itself on solving real-world problems with a team of top-notch product experts. We are reinventing the way people look at expense reports by automating not just the expense report, but the entire business trip. Joining our team means you are helping us fight the good fight against expense reports that suck!\n\n### About The Job\nAs a Success Coach, you will be focused on making sure that our customers are successful in using Expensify to solve the problems they face. You’ll do this by applying a deep understanding of our customers, their processes, our product and the systems with which we integrate. You’ll also gather feedback on how we can evolve Expensify to meet our customer’s needs in the future, and apply your product knowledge to map out these improvements for engineering. When product changes happen, you’ll lead the charge via documentation, blog posts, emails, calls and in-person visits with our customers.\n\nJoining our team means you will be working in our fast-paced environment and you are fearless of our next big challenge. Even though we work hard at Expensify, we make sure our employees are happy. Our most-discussed perk is our offshore, where we spend a month abroad working as a team from a remote location. Last year we went to Cambodia and Thailand. Where do you want to go next?\n\n### About You\nYou’re an entrepreneur who enjoys thinking through challenging problems, working across functional groups and articulating yourself in both technical and non-technical settings. You’re poised and confident when talking to customers and can always find the time to work with your colleagues to get any issue resolved.\n\nFor the best possible fit, we are looking for someone who:\n\n- Has excellent communication skills. One moment you may be having a technical discussion with an engineer about the product implications of a new feature, the next moment need to communicate how we are going to sell this feature with a member of the sales team, before quickly moving on to working directly with a non-technical customer to fix a problem. The ideal candidate will be able to clearly articulate themselves in all scenarios.\n- Is passionate about building, maintaining and making our software better. It’s what we do as a company.\n- Can manage time and prioritize efficiently. Things move quickly in this environment and it’s crucial that you are able to react to new information and re-prioritize accordingly.\n- Is comfortable learning from peers in an informal fashion. After all, we're all learning things as we go. We also love anyone who's able to effectively train colleagues as we grow the team.\n- Is well-versed in saying “no”. We often have to say no to ensure that our product stays simple and user-friendly. Saying no and having a compelling argument as to why requires in-depth product knowledge and knowledge of the problem that the customer is trying to solve and is critical to success in this role.\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n1. Describe a memorable experience - whether at work or in your personal life - working with a client/customer. What issue did they face, and and how you were able to address their concerns? If you weren't successful addressing their concerns, why not?\n\n2. If you were tasked with analyzing customer behavior and recommending product-driven solutions, how would you approach that problem?\n\n3. Describe a scenario where you interacted with an irate person. How were you able to turn them around (assuming you were able to)?\n\n4. What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n\n5. How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.","publish_date":"2016-06-02"},{"feature":"true","link":"jobs/expensify.html","location":"London","published":"Jun 2","id":15,"title":"Expensify UK Customer Success","body":"\n### Your Mission, Should You Choose to Accept:\nExpensify prides itself in solving a real world problem with a team of top notch product experts. We are reinventing the way people look at expense reports by automating not just the expense report, but the entire business trip. Joining our team means you are helping us fight the good fight against expense reports that suck!\n\nWe are expanding into the UK market and it's very early stage for our London based team. Help shape the team that will launch our global domination of expense reports and maintain a standard of excellence around the world.\n\n### About The Job\nAs a member of the Customer Success Team, you will be focused on making our user base successful Expensify users, through a deep understanding of our product and its many applications.\n\nJoining our team means you will be working in our fast paced environment and you are fearless of our next big challenge. Even though we work hard at Expensify, we make sure our employees are happy. Our most discussed perk is our offshore where we spend a month abroad working from a remote location as a team. This year we went to Cambodia and Thailand. Where do you want to go next?\n\n### About You\nYou’re an entrepreneurial extrovert who loves developing relationships with others and helping them solve complex problems with the ease of a trapeze artist! You’ll be talking to users through email, chat, and when needed on the phone, assisting with the onboarding process for potential customers, and working with with existing customers to make sure they are getting the most out of Expensify. The sky’s the limit for you, and this position can also be a jumping off point into other teams within the organization.\n\nFor the best possible fit, we are looking for someone who:\n\n- Can communicate to all levels within a company in a professional manner\n- Is a team player with great interpersonal skills\n- Wants to contribute to the growth of this team for the future\n- Can provide excellent verbal and written communication with clients\n- Bonus: Some general understanding of the accounting process, Not required!\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n1. What was your first customer support position?  What did you support, and what was your personal take on the product and how best to support it?\n\n2. If you were given free reign to choose the optimal set of customer support tools, what would they be and how would they optimize your customer success approach? (Feel free to list actual sales tools you’ve used, or fictitious ones. You’ve got free reign).\n\n3. Describe the angriest customer you have had to support, and how were you able to turn them around? (Assuming you were able to!)\n\n4. Pretend you had a month to do whatever you wanted. What would you do? And would this be sufficient time to accomplish the goals you set out to achieve?\n\n5. What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n\n6. How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.","publish_date":"2016-06-02"}]