[{"feature":"true","link":"jobs/github-enterprise-support-engineer.html","location":"North America (Remote)","published":"Sep 12","id":1,"title":"GitHub Enterprise Support Engineer","body":"\nMore and more companies are using GitHub Enterprise, so the support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. This person will join GitHub as part of our global support team and support our customers around the world. We're looking for Enterprise Support Engineers, in North America (US and Canada) to support our GitHub Enterprise product installed and managed in the customer's virtualization environment.\n\nYour main responsibility will be to work with our customers to solve support tickets. Tickets are usually opened by internal system administrators, and can include investigating load or networking issues, debugging application errors, and discussing feature requests. You'll also work with our engineering team to prioritize issues and development, and our documentation team to improve customer-facing resources. You don’t need to be a Git expert, but you do need to have technical experience and a passion for helping people.\nThe position reports to an Enterprise Support Manager and works closely with other teams and leaders across the company.\n\nGitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events.\n\n### RESPONSIBILITIES\n- Solve complex customer support tickets often involving Linux servers, source code, and web application issues\n- Effectively communicate technical information to customers and engineering groups at GitHub\n- Work proactively with customers on activities such as coordinating upgrades, communicating upcoming features, and ensuring their installation is running smoothly\n- Identify bugs and improvements in the GitHub Enterprise codebase\n- Manage urgent customer outages during business hours\n\n### QUALIFICATIONS\n- Must have current legal working authorizaton\n- General understanding of how modern web applications work\n- Prior experience providing technical support\n- Excellent problem solving skills\n- Familiarity with some flavor of production-level virtual machine (e.g., VMware ESX, Xen, KVM)\n- Enthusiasm for working directly with customers\n- Stellar English and grammar skills\n\n### BONUS POINTS IF YOU HAVE\n- Worked closely with large complex customer accounts\n- Familiarity with Git and GitHub\n- Experience with phone support\n- Ability to look through and understand code (Ruby / Bash)\n- Previous experience as a System Administrator\n- Previous experience as a Linux System Administrator","publish_date":"2016-09-12"},{"link":"jobs/fleetio.html","location":"Birmingham, AL (or remote)","published":"Sep 9","id":2,"title":"Fleetio Customer Success Director","body":"\nAs the Customer Success Director at Fleetio, your job is to deliver continuous value for our customers, enabling their success and driving customer retention. This is a demanding but rewarding role that requires a broad skillset. You’ll manage Customer Experience Reps who support our customers every day. You will also monitor customer health through usage and satisfaction data, customer surveys and more, then take proactive action to ensure customer retention.\n\nFleetio is a modern software platform that helps thousands of organizations around the world manage a fleet. Transportation technology is a hot market and we’re leading the charge, with raving fans and new customers signing up every day. Your job is to make sure we exceed our customers’ expectations, and that they continue to receive ongoing value from our software platform.\n\nWe take customer service and retention seriously. This is a position we consider essential to the company’s success. Be sure to mention coffee in your application so we know you actually read this.\n\n### KEY RESPONSIBILITIES\n- Grow customer relationships, drive adoption and customer satisfaction\n- Establish a trusted advisor relationship with customers and help them receive continued value from our products\n- Maximize customer/revenue retention by monitoring usage and survey data to identify at-risk customers and proactively reach out to them\n- Lead the Customer Success Team: coach team members, monitor daily operations and remove obstacles\n- Recruit & hire more Customer Success Team members to keep up with business growth\n- Assist the Sales Team in onboarding and training new customers\n- Design upfront training and implementation services for enterprise customers; lead the team to deliver swift and accurate implementations\n- Identify and nurture customer advocates to be used as sales references\n- Help upsell existing customers on new product offerings\n\n### WHAT'S IN IT FOR YOU\n- Work with fascinating customers and prospects from all around the world. So many different types of companies and organizations operate a fleet each day, and Fleetio is a good fit for most of them (it’s a huge market).\n- Be a part of an incredible team of “A” players who go above and beyond to make Fleetio a successful company. We’re a customer-centric team with a great product, excellent support, and countless happy customers.\n- Use the latest tools and techniques to grow a massive audience in a global marketplace (we already have paying customers in about 50 countries).\n- Work from our HQ in Birmingham, AL or wherever you’d like as a part of our strong remote working culture.\n\n### REQUIREMENTS\n- 3+ years of Customer Success (or equivalent) experience in a B2B-focused role with a proven history of increasing customer satisfaction, adoption and retention\n- 2+ years of management experience in a SaaS business\n- Strong analytical approach to customer success -- you love using BI tools and spreadsheets to dig into usage data\n- Excellent written and verbal communication skills -- there is a heavy amount of writing and prospect/customer interaction in this role\n- Incredibly organized and efficient, a great project manager\n- Familiarity working with enterprise customers\n- Passion for exceptional customer service and appreciation for its role in a company’s success\n- You must absolutely love delighting customers\n- Excited by technology and its ability to make you more productive\n- Strong team player but still a self-starter\n- Level up if you know a thing or two about cars and engines\n\n### BENEFITS\n- 100% coverage of health and dental insurance\n- 401(k)\n- Meaningful company equity\n- Book program and professional development budget\n- Mac laptop and whatever tools you need","publish_date":"2016-09-09"},{"feature":"true","link":"jobs/ipsy-care.html","location":"San Mateo, CA","published":"Sep 9","id":3,"title":"ipsy Customer Care Representative","body":"\nAt ipsy, our customers are at the core of everything we do, and we’re committed to providing them with top-notch service. We’re searching for a support representative who is passionate about helping others, who can proactively offer solutions and ideas that will delight our members. This position is responsible for managing sensitive customer interactions, proposing creative solutions, and establishing rapport with our engaged community. You will be scheduled for our evening shift (12-8 PM), and one weekend shift per week.\n\nCOVER LETTER REQUIRED – Please tell us about yourself and why you’re interested in this role.\n\n### You Are:\n- Support driven. You have a passion for problem-solving and enjoy being challenged. Helping others comes naturally to you.\n- Perceptive and empathetic. You proactively anticipate customer needs. You can adapt your tone and approach to fit a diverse range of customer personalities and situations.\n- Honest and authentic. You’re comfortable being yourself and genuinely enjoy connecting with others. You express yourself openly and respectfully, and function well as part of a team.\n- Reliable and accountable. You’re consistent, dependable, and adhere to a set work schedule.\n- You take ownership over the quality of your work and make an effort to improve.\n- Innovative. You're a creative thinker who can offer solutions to the trickiest conundrums. You bring compelling ideas to the table in an effort to catalyze positive change.\n\n### Responsibilities:\n- Respond to customer emails in a professional, friendly, and timely manner to enhance our members’ knowledge of ipsy and create a positive experience for them\n- Manage sensitive issues while maintaining the highest level of professionalism; provide thoughtful, prompt resolutions with empathy and poise\n- Recommend solutions to complex or escalated situations through research and critical thinking\n- Share relevant, strategic insights with our product, marketing, and technology teams regarding overall customer experience and service-related trends\n- Strive to exceed volume and quality goals\n- Help with additional projects as needed\n\n### Qualifications:\n- Bachelor degree or equivalent experience\n- 1-3 years in customer-centric industry\n- Strong computer and typing skills, very comfortable with web-based applications and navigation between tools\n- Exceptional written communication skills with keen attention to detail\n- Entrepreneurial spirit with ability to manage workflow efficiently\n- Willing to work one weekend shift per week\n- Experience providing customer support via social media is a plus","publish_date":"2016-09-09"},{"feature":"true","link":"jobs/ipsy-social.html","location":"San Mateo, CA","published":"Sep 9","id":4,"title":"ipsy Customer Care Representative - Social Media","body":"\nipsy is committed to providing excellent service to our community. We’re seeking someone with a passion for helping others, who can actively suggest initiatives that will delight our membership. This role is responsible for providing customer support through our various social media channels (Facebook, Instagram, Twitter, Pinterest, and YouTube). It will involve managing sensitive customer escalations, researching and proposing creative solutions, and building rapport with our active community.\n\nCOVER LETTER REQUIRED – Please tell us about yourself and why you’re interested in this role.\n\n### You Are:\n- Passionate about providing excellent support. You enjoy tackling a challenge head on and never shy away from an opportunity to learn and grow. You love social media and understand the importance of brand consistency.\n- Empathetic and perceptive. You can identify the tone of a customer and adjust your approach accordingly. You are proactive and always anticipate customer needs.\n- Authentic and honest. You’re not afraid to be yourself, and you have a desire to connect with others in a genuine way. You communicate openly and respectfully with teammates.\n- Reliable and accountable. You can adhere to a consistent work schedule. You accept ownership over the quality of your work, and take initiative to keep improving.\n- Creative. You’re an innovator who can think of solutions to the trickiest conundrums. You bring compelling ideas to the table in an effort to catalyze positive change.\n\n### Responsibilities:\n- Respond to comments made on our social channels in a timely, friendly, and professional manner to educate and create positive connections with our community.\n- Identify sensitive issues and potential escalations, and relay to appropriate teams ensuring that all members are helped in a quick and thorough manner.\n- Maintain the highest level of professionalism while managing sensitive issues. Demonstrate empathy while providing thoughtful and prompt resolutions.\n- Research complex and escalated situations and recommend solutions.\n- Provide thoughtful, strategic insight regarding customer requests and service-related trends to our product, marketing, and technology teams.\n- Strive to exceed volume and quality goals.\n- Help with side projects as needed.\n- You will be responsible for working our midday or evening shift (10 - 6 or 12 - 8 PM), and one weekend shift per week.\n\n\n### Qualifications:\n- Bachelor degree or equivalent experience.\n- 1-3 years in customer-centric industry, preferably with experience providing customer support via social media.\n- Strong computer and typing skills. Particularly high level of comfort in web-based applications and navigation between tools.\n- Exceptional written communication skills with keen attention to detail.\n- Entrepreneurial spirit with ability to manage workload efficiently.\n- Willing to work one weekend shift per week.","publish_date":"2016-09-09"},{"has_chat":"true","link":"jobs/lifechurch.html","location":"Oklahoma City, OK","published":"Aug 30","id":5,"title":"Life.Church YouVersion User Support Team Leader","body":"\nAt Life.Church we believe our jobs are a calling. We are risk-taking, irrationally generous, spiritual contributors who bring our best, laugh hard, and honor God with integrity. We are mutually broken and trying, together, to find restoration in Christ and to help restore our community and the world. Our life and our work are centered around one thing: leading people to become fully devoted followers of Christ. \n \nWith more than 240 million installs of the Bible App and 12 million installs of the Bible App for Kids, the YouVersion team continues to grow and evolve in an effort to appropriately steward the opportunities brought our way. We are looking for a driven and capable leader for user support of the Bible App, the Bible App for Kids, and our website, www.bible.com. Do you have the ability to lead, motivate, and grow an international support team, a passion for critical analysis and problem-solving, and the ability to drive change? If you do, you should definitely keep reading.\n \n### We want someone who will:\n- Develop a large global team consisting of hundreds of international volunteers\n- Supply original ideas and create efficient processes\n- Work autonomously and drive change through influence\n- Keep up with new tools and processes in the world of user support and think critically about how we could apply them\n \n### You want a job that includes:\n- Helping millions of users around the world better engage in the Bible\n- Leading, growing, and inspiring an international team that includes dozens of different cultures and backgrounds\n- Tight deadlines and an agile work environment\n- Constantly fiddling with more Apple and Android devices than you have pockets to hold them\n \n### The perfect fit:\n- Has experience in managing user or customer support teams and in building strong relationships and rapport with a largely remote team\n- Can recite a list of top companies with world-class user support\n- Sports a broad sense of humor and a deep appreciation for the absurd","publish_date":"2016-08-30"},{"link":"jobs/surveygizmo.html","location":"Boulder, CO or London, UK","published":"Aug 26","id":6,"title":"SurveyGizmo Customer Support Hero","body":"\nThe Customer Service Hero provides immediate and amazing service to 14000+ customers worldwide.  This person champions customer happiness, satisfaction, and success through patience, understanding, and technical superpowers.\n\n### What we want you to do:\n- Enthusiastically support customers by phone, email, chat, social media and other web-based tools\n- Accurately identify, analyze, and resolve technical and non-technical issues in a timely manner\n- Work in a team environment to achieve shared goals\n- Promptly escalate more complex problems to appropriate internal resources\n- Participate in enhancing the product from initial design through testing and delivery\n- Demonstrate a familiarity with standard concepts, practices, and procedures of survey software and data collection\n- Enthusiastically provide internal support for the application\n- Continuously endeavor to improve the quality of our support and service, both internally and externally\n- Provide on-call customer support on holidays and weekends on a shared rotation\n\n### What you need to succeed:\n- A passion for customer service, and a great love for helping people\n- Be well-versed and comfortable with email, phone, and chat etiquette\n- Ability to exercise creativity in problem solving\n- Ability to empathize with customers and convey confidence\n- Independent and self-reflective learner\n- Ability to prioritize and get things done with many distractions\n- Customer service or technical support experience\n- Familiarity with, or the aptitude to learn HTML, CSS, Javascript, JQuery, or PHP\n- Experience creating surveys or using survey software\n- Experience in a SaaS company\n- Computer proficiency\n- Excellent written and verbal communication skills\n- Be a self-starter and comfortable/flexible with frequent change","publish_date":"2016-08-26"},{"link":"jobs/gitlab.html","location":"Remote","published":"Aug 24","id":7,"title":"GitLab Service Engineer","body":"\n<div class=\"container md-page\">\n    <p>The rising popularity of GitLab means that our professional services are in high demand. If you have the skills\n        to help our clients we would love to talk to you.</p>\n\n    <p>We are looking for skilled people around the world. If you would love to work from home and help GitLab grow,\n        this is the right spot for you.</p>\n\n    <h2 id=\"responsibilities\">Responsibilities</h2>\n    <ul>\n        <li>Engage with our customers—anything from a small advertising firm or a university, to Fortune 100 clients and\n            help them with anything from a simple support ticket to a customer training\n        </li>\n        <li>Triage customer issues and find workarounds if possible</li>\n        <li>Engage with the development team to escalate bugs, problems, or missing information</li>\n        <li>Communicate via email and video conferencing with potential and current clients</li>\n        <li>Maintain GitLab.com and our other services such as GitHost.io</li>\n        <li>Participate in the rotating \"on-call\" list to provide 24/7 emergency response availability</li>\n        <li>Ensure that everything we learn from running GitLab.com is set as default or communicated to our users</li>\n        <li>Maintain documentation relating to troubleshooting and other knowledge gained via customer interactions</li>\n        <li>Submit and comment on feature requests based on customer interactions</li>\n    </ul>\n    <p>More information can be found on the <a href=\"https://about.gitlab.com/handbook/support/\">support page in the\n        handbook</a>.</p>\n\n    <h3 id=\"junior-service-engineer\">Junior Service Engineer</h3>\n    <ul>\n        <li>Junior Service Engineer's responsibilities cover all the support channels that are supported by a level 3 or\n            4 SLA, per the definitions on the <a href=\"/handbook/support/#sla\">Support</a> page.\n        </li>\n        <li>Contribute with documentation</li>\n        <li>Manage Feature Proposals created through their user interactions</li>\n        <li>Manage Bug reports created through their user interactions</li>\n        <li>Technical Skills\n            <ul>\n                <li>Able to triage basic GitLab issues</li>\n                <li>Able to perform basic UNIX/GitLab system administration</li>\n                <li>Able to solve customer tickets in a timely fashion</li>\n            </ul>\n        </li>\n        <li>Communication\n            <ul>\n                <li>Able to communicate clearly with customers on technical topics</li>\n                <li>Able to escalate issues to the right people</li>\n                <li>Keeps issues up-to-date with progress</li>\n                <li>Follows up with outstanding issues</li>\n                <li>Documents relatively simple answers in issues and GitLab documentation</li>\n                <li>Makes customers happy</li>\n            </ul>\n        </li>\n    </ul>\n    <h3 id=\"service-engineer\">Service Engineer</h3>\n    <ul>\n        <li>All Junior Service Engineer responsibilities with less time invested on SLA 3 and SLA 4</li>\n        <li>Participate in the On-call schedule</li>\n        <li>Work on SLA 1 emergency and security tickets</li>\n        <li>Work on SLA 2 customer tickets</li>\n        <li>Maintain GitLab.com and other services such as GitHost.io</li>\n        <li>Technical Skills\n            <ul>\n                <li>Able to triage intermediate GitLab issues and resolve them</li>\n                <li>Able to perform intermediate UNIX/GitLab system administration</li>\n                <li>Can identify relatively challenging bugs/issues with GitLab</li>\n                <li>Can submit merge requests for basic GitLab bugs/problems</li>\n            </ul>\n        </li>\n        <li>Workflow\n            <ul>\n                <li>Reliably answers on-call emergencies</li>\n                <li>Exceeds SLAs consistently</li>\n            </ul>\n        </li>\n        <li>Communication\n            <ul>\n                <li>Documents relatively challenging answers in issues and GitLab documentation</li>\n                <li>Helps ensure that tickets are closed in a timely manner</li>\n                <li>Contributes with training material/sessions</li>\n            </ul>\n        </li>\n    </ul>\n    <h3 id=\"senior-service-engineer\">Senior Service Engineer</h3>\n    <ul>\n        <li>All Service Engineer responsibilities</li>\n        <li>Able to cover all channels</li>\n        <li>Help train new service engineers</li>\n        <li>Improve the support workflow (ZenDesk)</li>\n        <li>Contributes to complementary projects (e.g. GitLab University, etc.)</li>\n        <li>Maintains good ticket performance</li>\n        <li>Write blog articles</li>\n        <li>Take ownership of documentation and feature requests that is based on customer interactions</li>\n        <li>Improve the support process (on-boarding, training, escalation, etc)</li>\n        <li>Technical Skills\n            <ul>\n                <li>Have deep knowledge of GitLab internals and a variety of possible configurations</li>\n                <li>Able to perform complex UNIX/GitLab system administration</li>\n                <li>Can debug challenging bugs with GitLab</li>\n                <li>Can submit merge requests for advanced GitLab bugs/problems</li>\n            </ul>\n        </li>\n        <li>Leadership\n            <ul>\n                <li>Help hire and train new Service Engineers</li>\n                <li>Are a go-to person for the other Service Engineers when they face tough challenges</li>\n            </ul>\n        </li>\n        <li>Communication\n            <ul>\n                <li>Take ownership of documentation</li>\n                <li>Drives feature requests based on customer interactions</li>\n            </ul>\n        </li>\n    </ul>\n    <h3 id=\"staff-engineer\">Staff Engineer</h3>\n    <ul>\n        <li>All Senior Service Engineer responsibilities</li>\n        <li>Help hire service engineers as part of the interview process</li>\n        <li>Good ticket performance</li>\n        <li>Good ticket satisfaction</li>\n        <li>Maintains complementary project</li>\n        <li>Contributes to GitLab regularly</li>\n        <li>Technical Skills\n            <ul>\n                <li>Can solve most support tickets in a reasonable time without escalating to development</li>\n                <li>Specializes in multiple topics (e.g. LDAP, Jenkins/CI integration, Geo)</li>\n                <li>Should submit or review MRs with development for customer GitLab bugs/issues</li>\n            </ul>\n        </li>\n    </ul>\n    <h2 id=\"requirements-for-applicants\">Requirements for Applicants</h2>\n    <ul>\n        <li>B.Sc. in Computer Science or equivalent experience</li>\n        <li>Above average knowledge of Unix and Unix based Operating Systems</li>\n        <li>Vast experience with Ruby on Rails Applications and git</li>\n        <li>Good people skills</li>\n        <li>Excellent spoken and written English</li>\n        <li>You share our <a href=\"/handbook/#values\">values</a>, and work in accordance with those values</li>\n        <li><a href=\"/jobs/#technical-interview\">A technical interview</a> is part of the hiring process for this\n            position.\n        </li>\n        <li>A customer scenario interview is part of the hiring process for this position.</li>\n    </ul>\n    <p>Avoid the <a href=\"http://www.theatlantic.com/magazine/archive/2014/05/the-confidence-gap/359815/\">confidence\n        gap</a>; you do not have to match all the listed requirements exactly to apply. Our hiring process is described\n        in more detail in our <a href=\"/handbook/hiring/\">hiring handbook</a>.</p>\n\n    <p>Work remotely from anywhere in the world. Curious to see what that looks like? Check out our <a\n            href=\"/2015/04/08/the-remote-manifesto/\">remote manifesto</a>.</p> \n</div>","publish_date":"2016-08-24"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Aug 23","id":8,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2016-08-23"},{"link":"jobs/redgate.html","location":"Cambridge, UK","published":"Aug 23","id":9,"title":"Redgate Software Customer Support Manager","body":"\n<p>Redgate is looking for a Customer Support Manager to lead our Customer Support team. Our ideal candidate is someone who’s looking for a challenge – not just leading our excellent Customer Support team and taking customer support at Redgate to the next level, but also thinking about support in commercial terms and helping us to realise the full value of our world-class support offering.</p>\n<p>Reporting to the Head of Sales &amp; Customer Support, you’ll collaborate with Redgate’s Commercial Team to build and execute the strategy for Customer Support. You’ll be leading team leaders who manage the rest of the team across our Cambridge and Pasadena offices. You’ll be responsible for setting direction and monitoring the performance of the team, as well as for the continuous improvement of the team.</p>\n<p>With a deep passion for customer service, you’ll be aware of current best practice and will network with like-minded people. You’ll be constantly looking for areas of improvement and will look outside of our business for innovation and ideas.</p>\n<p>Confident with data, you’ll be able to analyse and use the data the team collects to inform other areas of the business. You’ll be comfortable collaborating with product managers and sales managers to drive innovation and improvements across the business.</p>\n<p>Redgate views customer support as a competitive advantage, and therefore a crucial part of the business. This is an exciting time to be a part of our ever-improving team.</p>\n<p>Redgate is proud to be independently recognised as Cambridge’s <a href=\"http://www.red-gate.com/our-company/careers/assets/sunday-times-top-100.pdf\" target=\"_blank\" title=\"\">best workplace</a> as well as an <a href=\"http://www.red-gate.com/our-company/about/awards\" target=\"_blank\">award winning</a> software provider – we aspire to be the best place you’ve ever worked. To apply, simply upload your CV and covering letter or <a href=\"mailto:careers@red-gate.com\" target=\"_blank\">get in touch</a> if you’d like to talk to us first.</p>\n<p><strong>What makes you Redgate’s next Customer Support Manager?</strong></p>\n<ul>\n<li>You’ve got a genuine passion for customer experience and the ability to work across an organisation to make continuous improvements in this area.</li>\n<li>You can demonstrate experience which makes your customer service knowledge and team management skills obvious to us.</li>\n<li>You’ll be able to translate and report on the large amount of data available.</li>\n<li>You have experience of taking an idea, building a plan and executing projects which involve collaboration with other teams. You have a genuine interest outside of your area and work for the greater good.</li>\n<li>You can demonstrate an ability to think commercially and are comfortable working with revenue targets.</li>\n<li>You have experience of striking the right balance between operational demands and project work</li>\n<li>You have a genuine interest in technology and are able to learn our technical products and tools</li>\n<li>You take management seriously, and will propagate the Redgate management way.</li>\n<li>You’re a team builder. You’re able to learn and adapt to Redgate’s culture and have the skills to build and grow your team in this way.</li>\n<li>You value integrity and are an authentic, courageous and confident manager – you understand how to empower your team to do great work.</li>\n<li>You can operate successfully in a rapidly changing, fast moving environment, whilst providing direction for your team.</li>\n<li>You have an action bias. When faced by uncertainty and risk, you make decisions nonetheless, learning from mistakes.</li>\n<li>You’ve got excellent communication and collaboration skills, which are effective across departments and countries.</li>\n<li>You foster innovation and creativity and have experience managing change.</li>\n<li>You’re comfortable with transparency and feedback.</li>\n</ul>\n<p><strong>What would help?</strong></p>\n<ul>\n<li>History of managing customer support in a software business, understanding the complexities of supporting a large amount of desktop tools across different platforms.</li>\n<li>Demonstrable commercial experience in a customer support context.</li>\n</ul>\n<p><strong>What’s the package?</strong></p>\n<ul>\n<li><a href=\"http://www.red-gate.com/our-company/careers/benefits\" target=\"_blank\">A great benefits package</a>.</li>\n<li>Salary is £40 – £60k per annum, depending on experience.</li>\n<li>You’ll work about 40 hours a week, with flexible work time.</li>\n</ul>","publish_date":"2016-08-23"},{"link":"jobs/recharge.html","location":"Remote","published":"Aug 19","id":10,"title":"ReCharge Technical Customer Support","body":"\nReCharge is a fast moving small team making ecommerce payments easy for everyone. We currently empower thousands of online stores to sell their products on a recurring basis. We’re experiencing incredible growth – from our start 18 months ago we have bootstrapped our way to processing millions of dollars a week.\n\nWe are looking for a Customer Success Engineer who is resourceful; using troubleshooting and analytical skills to serve our customers via email, chat and occasional phone calls. You are self driven, with a knack for digging deep into problems. You have a sense of urgency and draw satisfaction from going above and beyond to provide solutions. You'll help to find convergence in what customers need so we build the highest value product. We get a lot of applicants, so we encourage you to do something that stands out and help us know why your the perfect fit for ReCharge. \n\n### Job Description:\n- Combining technical expertise with customer service to resolve questions and issues.\n- Able to communicate clearly in writing for both technical and non-technical people\n- Document and build new tools to improve support flows.\n- Identify patterns - recommend improvements, and filter our unimportant issues. \n- Authoring Success documentation for our customer facing Help Center. \n- Assist with successful on-boarding of new customers\n\n### REQUIREMENTS\n- Schedule Sunday - Thursday\n- Covering US hours (9am PST - 5 pm PST)\n- Knowledge of HTML, CSS, Javascript (Knowledge of other programming languages a plus) \n- 2+ Years experience in a similar role at another SaaS company\n- Excellent organizational and communication skills. \n- Detail oriented, to prove this make sure to add to job application headline \"I am detailed oriented\".\n- Excellent customer service skills with a polite, patient, caring, calm and professional demeanor.\n- Language requirements, English fluency (written and spoken)\n- Background in the software industry.\n\n### BENEFITS\n- Competitive salaries\n- Apple equipment\n- Paid time off\n- Medical, dental, & vision insurance\n- Much more...","publish_date":"2016-08-19"},{"feature":"true","link":"jobs/digitalocean.html","location":"New York City Metro Area","published":"Aug 8","id":11,"title":"Digital Ocean Trust & Safety Manager","body":"\nReporting to the Director of Customer Support, the Trust & Safety Manager at DigitalOcean will lead a team of 11 specialists who ensure our customers have a positive experience on our platform while reducing the impact of bad actions. To excel in this role you should be passionate about people, process and product as you will be guiding all three. This is a great opportunity for an experienced, performance-oriented manager looking for a great new leadership opportunity. You’ll have the chance to portray thought leadership for what Trust & Safety as a practice is at DigitalOcean.\n\nYou will owns all aspects of creating and maintaining processes to continue developing a premier team that effectively handles abuse, law enforcement requests and customer verification. You should also bring a high level of domain experience to the organization. These skills include customer communications, creating internal policies/external policies, and ultimately helping to keep our network safe and abuse free. Finally, this person should also possess excellent interpersonal, communication and management skills. As a leader in our organization, you will have the ability to influence both product and policy decisions with internal teams. This is a full-time position based in our New York City office.\n\n### What You'll Be Doing:\n- Performs 1-on-1 meetings with direct reports as needed and on a regular basis to help motivate and manage their performance\n- Create process guidelines to handle customer verification, inbound abuse and network abuse, law enforcement requests, and outside information sharing\n- Lead a 24/7 team to ensure compliance with processes (you don’t have to work 24/7 though!)\n- Develop relationships with product, security and legal to enhance team productivity and performance\n- Introduces new methods to our processes and oversees their implementation and effectiveness\n- Collaborate with shift managers to ensure continuity in building a strong management team\n- Establish a recruiting plan to attract, hire, onboard, develop, excite and manage high performing team members\n- Develop, measure, and develop team KPIs such as: rate of abuse, RBL listings, FBL volume, etc.\n- Own the communication with the product team to improve the team’s tools\n- Reduces overall costs of handling abuse\n- Own relationships with key outside parties such as law enforcement, ensuring overall compliance with legal procedures\n\n### What We'll Expect From You:\n- Exhibits and lives the servant leadership style and has prior experience as a manager.\n- Understands fraud and abuse within a cloud infrastructure environment and has experience effectively combating it.\n- Creates a climate in which people want to do their best; can motivate many kinds of direct reports and team or project members, empowering others.\n- Is dedicated to meeting the expectations required of internal and external customers.\n- Gets first hand customer information and uses it for improvements in service.\n- Establishes and maintains effective relationships with customer and internal team members, gaining their trust and respect.\n- Spends his/her time and the time of others on what’s essential to success.\n- Can quickly sense what will help or hinder accomplishing a goal, eliminating roadblocks and creating focus.\n- Has the ability to get their hands dirty with customer facing tasks while displaying the capacity to delegate as needed.\n- Is personally committed and actively works to improve self through on the job and outside learning.\n- Is able to write clearly and effectively in reviewing direct reports, responding to customer inquires and follow-ups.\n- Expresses the capacity to manage a distributed team, across multiple timezones and shifts. \n- Displays empathy to both internal and external customer requests.\n- Showcases the ability to encourage and facilitate mentoring and knowledge sharing within the Support team\n- Strongly identify with our brand and team culture\n- Prior experience in similar environments\n\n### Minimum Qualifications:\n- Bachelor's degree in relevant field and/or at least 4-5+ years of related experience\n- Technical expertise with Linux and other OpenSource technologies is ESSENTIAL; this person will be an integral and hands-on member of the team at large\n- Experience as a technical or support lead/supervisor/manager, ideally in a similar IaaS, service provider or cloud computing environment\n- Direct experience with managing, coaching, and mentoring team members\n- Exceptional verbal and written communications skills\n- Strong analytical skills and pattern recognition\n- Exceptional attention to detail and follow-up\n- Experience with staffing, interviewing and team building\n\n### Working at DigitalOcean:\n- DigitalOcean offers competitive health, dental, and vision benefits for both employees and their dependents\n- Competitive compensation including a 401k with up to 4% employer match\n- Flexible vacation time\n- Stock options\n- Daily catered lunch as well as a corporate Seamless account to keep your hunger at bay\n- Monthly commuter expense and gym membership allowance\n- Great office space located in the heart of SoHo\n\n<i>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</i>","publish_date":"2016-08-08"}]