[{"feature":"true","link":"jobs/github-web-apac.html","location":"Asia Pacific (Remote)","published":"Sep 30","id":1,"title":"GitHub Web Support Accounts Manager","body":"\nGitHub's user base is growing and the web support team is growing with it. We're looking for a web support team manager located in the Europe or Asia Pacific to help lead our passionate, distributed support staff and work with them to create effective and efficient support processes and solve users' problems. This is the current list of countries in which we are set up as an employer in Europe and Asia Pacific, so legal working authorization is required: Japan, Australia, New Zealand, Austria, Croatia, Denmark, England, France, Germany, Ireland, Netherlands, Scotland, Spain, Sweden, and Switzerland.\n\nThe Web Support EU-APAC Accounts Manager will work with their team members to provide guidance and support in the day-to-day work environment. The manager will also work side-by-side with the team answering emails and help resolve users' issues as quickly and awesomely as possible. The manager will also participate in the weekly management meetings providing input and guidance into the team direction and future growth of the organization.\n\nWhen GitHub users have questions, they email support. We help people as quickly and awesomely as possible. Our Account Support team handles a wide range of questions that require a logical brain and a spidey sense to investigate and determine the appropriate solution to many of the problems.\n\nThe most important characteristic of our support team is that we love helping developers. GitHub is a place for people to work better, together. Our job is to help. Support treats users the way we'd want someone to treat our friends.\n\nOur support teammates have excellent writing chops: stellar grammar, charming written personality, and the ability to explain complicated things simply. We measure our success in swiftness, accuracy, and clarity.\n\nThe Web Support EU-APAC Accounts Manager will report to the Director of Web Support, who will help maintain open lines of communication among team members and help keep work focused on things that are important to the individuals, the team, and the company. They will also keep communication open with the Engineering and Product teams to serve everyone involved. The Web Support EU-APAC Accounts Manager will work with the Human Resources team to help resolve personnel issues as they arise as well as hiring for Web Support.\n\n### RESPONSIBILITIES INCLUDE:\n- Meeting 1-1 with team members on a regular basis\n- Planning and supporting career development\n- Giving guided performance feedback\n- Serving as a coach and mentor\n- Keeping communication channels open within the entire Support team as well as cross-functionally\n- Serving as hiring manager for the team\n- Participating in management conversations about the day-to-day business as well as future direction and stratergy of the team\n- Responding to user emails\n- Working with Engineering to resolve problems on GitHub.com\n- Driving efficiencies within support tools and processes\n- Tracking and monitoring project progress and ensuring deliverables are completed\n\n### YOU SHOULD HAVE:\n- Must currently reside in one of the following: Japan, Australia, New Zealand, Austria, Croatia, Denmark, England, France, Germany, Ireland, Netherlands, Scotland, Spain, Sweden, and Switzerland.\n- Must have current working authorization in country listed above\n- Stellar written and verbal communication skills\n- Experience with managing people\n- Passionate about creating and fostering good support practices\n- Ability to empathize with a diverse range of people\n- A strong sense of empathy and the ability to advocate for others\n- Excellent problem solving skills\n- A malleable writing style and voice\n- Have worked with a distributed team\n\n### BONUS POINTS FOR:\n- Experience working remotely\n- Managing a remote team\n- Hiring experience\n- Prior customer support experience\n- Technical experience (QA, documentation, elaborate boardgames)","publish_date":"2016-09-30"},{"feature":"true","link":"jobs/github-web-eu.html","location":"Europe (Remote)","published":"Sep 30","id":2,"title":"GitHub Web Support Accounts Manager","body":"\nGitHub's user base is growing and the web support team is growing with it. We're looking for a web support team manager located in the Europe or Asia Pacific to help lead our passionate, distributed support staff and work with them to create effective and efficient support processes and solve users' problems. This is the current list of countries in which we are set up as an employer in Europe and Asia Pacific, so legal working authorization is required: Japan, Australia, New Zealand, Austria, Croatia, Denmark, England, France, Germany, Ireland, Netherlands, Scotland, Spain, Sweden, and Switzerland.\n\nThe Web Support EU-APAC Accounts Manager will work with their team members to provide guidance and support in the day-to-day work environment. The manager will also work side-by-side with the team answering emails and help resolve users' issues as quickly and awesomely as possible. The manager will also participate in the weekly management meetings providing input and guidance into the team direction and future growth of the organization.\n\nWhen GitHub users have questions, they email support. We help people as quickly and awesomely as possible. Our Account Support team handles a wide range of questions that require a logical brain and a spidey sense to investigate and determine the appropriate solution to many of the problems.\n\nThe most important characteristic of our support team is that we love helping developers. GitHub is a place for people to work better, together. Our job is to help. Support treats users the way we'd want someone to treat our friends.\n\nOur support teammates have excellent writing chops: stellar grammar, charming written personality, and the ability to explain complicated things simply. We measure our success in swiftness, accuracy, and clarity.\n\nThe Web Support EU-APAC Accounts Manager will report to the Director of Web Support, who will help maintain open lines of communication among team members and help keep work focused on things that are important to the individuals, the team, and the company. They will also keep communication open with the Engineering and Product teams to serve everyone involved. The Web Support EU-APAC Accounts Manager will work with the Human Resources team to help resolve personnel issues as they arise as well as hiring for Web Support.\n### RESPONSIBILITIES INCLUDE:\n- Meeting 1-1 with team members on a regular basis\n- Planning and supporting career development\n- Giving guided performance feedback\n- Serving as a coach and mentor\n- Keeping communication channels open within the entire Support team as well as cross-functionally\n- Serving as hiring manager for the team\n- Participating in management conversations about the day-to-day business as well as future direction and stratergy of the team\n- Responding to user emails\n- Working with Engineering to resolve problems on GitHub.com\n- Driving efficiencies within support tools and processes\n- Tracking and monitoring project progress and ensuring deliverables are completed\n\n### YOU SHOULD HAVE:\n- Must currently reside in one of the following: Japan, Australia, New Zealand, Austria, Croatia, Denmark, England, France, Germany, Ireland, Netherlands, Scotland, Spain, Sweden, and Switzerland.\n- Must have current working authorization in country listed above\n- Stellar written and verbal communication skills\n- Experience with managing people\n- Passionate about creating and fostering good support practices\n- Ability to empathize with a diverse range of people\n- A strong sense of empathy and the ability to advocate for others\n- Excellent problem solving skills\n- A malleable writing style and voice\n- Have worked with a distributed team\n\n### BONUS POINTS FOR:\n- Experience working remotely\n- Managing a remote team\n- Hiring experience\n- Prior customer support experience\n- Technical experience (QA, documentation, elaborate boardgames)","publish_date":"2016-09-30"},{"feature":"true","link":"jobs/meetedgar.html","location":"Remote (USA)","published":"Sep 28","id":3,"title":"MeetEdgar User Outreach Specialist (Remote | USA)","body":"\nFull-time remote position, 40 hours/week\nLike a treasure map hidden on the back of the Declaration of Independence, our marketing team is dedicated to helping people discover something new and exciting - and in our case, that means leading them to Edgar. But what about all those people out there who could use a little extra push? Well, That’s where you come in, dear reader - we’re looking for a User Outreach Specialist who can lead the charge on identifying and nurturing leads, leading product demos, and whatever else our pre-customers might need!\n\n### About You\nYou’re a take-charge sort of guy/gal/non-binary individual - somebody who can tell when a person needs a nudge or three in the right direction, and proactively gives them the information they need to make their own brilliant decisions. You’re not a salesperson - you’re a matchmaker, setting people up with bliss-inducing solutions to their most problem-y problems.\nIn this position, that means working with our marketing team to do things like:\n\n- Identify and nurture leads via email, social media, and more\n- Conduct personalized one-on-one demos as needed\n- Respond to emails and online chats from our leads\n- Transition new customers into our onboarding process\n\nSometimes, the people who’ll benefit most from your help and expertise will come to you - other times, you’ll seek them out yourself. That means you’re someone who understands the weird lil’ intersection of social media, SaaS products, and content marketing where Edgar lives, and the issues that are important to anyone else in that neighborhood. \n\nHow can you tell when what we offer is what someone’s looking for? How do you communicate that - and how does your strategy change from person to person? What matters most to one type of lead versus another, and how do you help them meet their needs? These are the types of questions you’ll be answering in this position - so be ready! (Sorry, we totally didn’t give you a spoiler alert beforehand.)\n\nBecause this role requires significant interaction with potential customers, you’ll work alongside both our Marketing and Customer Experience teams to make our relationships with our leads better than ever. From conducting proactive outreach to responding to the needs of prospective users, your day-to-day will be the types of one-on-one interactions that a people person’s dreams are made of!\n\n### Job Deets Cheat Sheet\n- This is a full-time, salaried remote position - you must live somewhere in North America and be able to show eligibility to work in the USA\n- Sales/marketing experience a plus\n- Customer service experience also preferred, ideally with technology-related products/services\n- An extrovert’s love of reaching out to new people (an introvert’s love of staying at home is okay, though)\n- Able to read a situation and determine someone’s needs - even if they don’t spell them out for you\n- Confident hosting live demos, Q&A sessions, and sing-a-longs\n- Demonstrably good judgment\n\n### About Us\nWe’re a small team of 18-ish people, all working remotely across the US & Canada. We do a lot of collaborating and meme-swapping on Slack, along with virtual team meetings and super-futuristic video calls. We also do a twice-annual retreat week where we work together on cool projects all day and rock the karaoke mic all night. (Spoiler alert: This means you have to be willing and able to travel to those retreats! The karaoke, however, is optional.) \nWe’re proudly bootstrapped and profitable, which means we get to turn down VC money a lot and keep doing things the way we like. We’re pretty serious about building and maintaining an awesome, positive company culture, so, you know, no jerks. \n\nWe'll probably get along if you’re someone who wants to be creative, have a pretty-serious-but-not-inhuman amount of responsibility, and work with people who make going to work not suck. (And be one of those people yourself. We like those people.)\n\nYou can find out more at http://meetedgar.com/careers/ and by watching this video (please watch it, it was mad expensive):\n<iframe width=\"320\" height=\"180\" src=\"https://www.youtube.com/embed/XvU3P43b0rQ\" frameborder=\"0\" allowfullscreen></iframe>\n\n### Perks & Benefits\n- Work from home (or wherever there’s strong wifi)\n- 4 weeks paid vacation (Shazam! And yes, everyone actually uses all 4 weeks)\n- Monthly cleaning service for your home - not that we don't have total faith in you\n- Paid home Internet service\n- Coworking space/coffee shop working expenses\n- Coverage for health, dental, and vision for you and your fam\n- 401(k) with matching\n- An extra paid day off per quarter so you can volunteer in your community (awww)\n- New Mac laptop (#blessed)\n- Books, conferences, and other educational resources to help you be even more amazing at what you do!","publish_date":"2016-09-28"},{"feature":"true","link":"jobs/zapier-apac.html","location":"Asia Pacific (remote)","published":"Sep 23","id":4,"title":"Zapier Customer Champion APAC","body":"\n<div class=\"column two-thirds content secondary-blog-entry-jobs\">\n         \n<p><em>Normally we hire candidates for our customer champion team from anywhere in the world. However right now we are in need of someone who can help our customers from 12am UTC to 9am UTC. This roughly corresponds with people who live in Australia and Asia. If you're excited about this role but your main working hours aren't in this timezone check out our <a href=\"https://zapier.com/jobs/customer-champion-zapier/\">general customer champion application</a></em></p>\n<p>Hi there!</p>\n<p>We're looking for someone who loves helping people. If you love interacting with people on a daily basis to help them learn how to optimize their work then read on…</p>\n<blockquote>\n<p>We know applying for and taking on a new a job at any company requires a leap of faith. We want you to feel comfortable and excited to apply at Zapier. To help share a bit more about life at Zapier here are a few resources in addition to the job description that can give you an inside look at what life is like at Zapier. Hopefully you'll take the leap of faith and apply.</p>\n<ul>\n<li><a href=\"https://zapier.com/jobs/our-commitment-to-applicants/\">Our Commitment to Applicants</a></li>\n<li><a href=\"https://zapier.com/learn/the-ultimate-guide-to-remote-working/\">Zapier Guide to Remote Work</a></li>\n<li><a href=\"https://zapier.com/jobs/zapier-code-of-conduct/\">Zapier Code of Conduct</a></li>\n<li><a href=\"https://zapier.com/jobs/working-on-diversity-and-inclusivity/\">Working on Diversity and Inclusivity</a></li>\n</ul>\n</blockquote>\n<h2>About You</h2>\n<p>You're empathetic to users and can easily put yourself in their shoes. You realize that not everyone has the same skill set and that smart people sometimes make mistakes. You make customers feel empowered after interacting with support and not stupid because of a small mistake.</p>\n<p>You obsess over the details. Maybe you have a one emoticon and one exclamation point rule of thumb for every email. Maybe it's only two sentences per paragraph. Either way, you make sure each word and each punctuation mark makes the customer delighted to work with you.</p>\n<p>You love solving problems. Every customer is different, many times radically so. You relish being able to meet their specific need, and also solving their problems that may have gone unsaid.</p>\n<p>You love to write. Almost everything at Zapier is done via written communication (both with customers and between teammates).</p>\n<p>You're persistent. Support at Zapier is much different than at many software companies. It's not the same questions over and over again, and often involves researching technical nuances of the apps we support. You love the opportunity to solve new problems every day and won't give up when you don't know the answer right away.</p>\n<p>You love doing things efficiently. At Zapier, the work you do will have a disproportionate impact on the business. We believe in systems and processes that let us scale our impact to be larger than ourselves.</p>\n<p>You love to set your own course. At Zapier, we have quick team meetings each week and one-on-one meetings every month and then we go make things happen. You get to make things happen without someone saying so.</p>\n<h2>Things You Might Do</h2>\n<p>Zapier is a startup, so you'll likely get your hands dirty in a little bit of everything. That said, here are some things you'll get to lead:</p>\n<ul>\n<li>Help customers via email or chat to ensure they have the best experience possible (teammates tend to send 60+ emails every day), troubleshooting their problems and answering their questions.</li>\n<li>Write documentation to help users help themselves (all the documentation on our help site is written and maintained by the support team: https://zapier.com/help/)</li>\n<li>Work with the product team to build tools that will speed up and increase the quality of support at the same time</li>\n<li>Experiment: this is a startup so everything can change</li>\n</ul>\n<h2>About Zapier</h2>\n<p>For the past five years, Zapier has been helping people across the world automate the boring and tedious parts of their job. We do that by helping everyone connect the web applications they already use.</p>\n<p>We believe that there are jobs that a computer is best at doing and that there are jobs that a human is best at doing. We want to empower businesses everywhere to create processes and systems that let computers do what they are best at doing and let humans do what they are best at doing.</p>\n<p>We believe that with the right tools, you can have 10X the impact with less work.</p>\n<p>We believe in small teams. Small teams are fast and nimble. Small teams mean less bureaucracy and less management and more getting things done. </p>\n<h2>The Whole Package</h2>\n<p>Location: Anywhere you want.</p>\n<p>If you want to work remote, that's cool. If you want to work near others, that's cool too. The current support team is in Washington, Maryland, Florida, Connecticut, Wisconsin, Michigan, Oregon, California, Indiana, Pennsylvania, Australia, England, and Spain.</p>\n<p>Compensation:</p>\n<ul>\n<li>Based on experience</li>\n<li>Profit sharing</li>\n<li>2-3 annual company retreats to awesome places</li>\n<li>14 weeks paid leave for new parents</li>\n</ul>\n<p>Pick your own equipment. We'll set you up with whatever laptop + monitor combo you want plus any software you need. </p>\n<p>Unlimited vacation policy (plus we insist you take at least 2 weeks off each year - this isn't a vague policy where unlimited vacation means no vacation). </p>\n<p>Work with awesome companies around the world. We partner with the best software companies in the world and you'll constantly get to <a href=\"https://zapier.com/zapbook\">interact with people from these great companies</a>.</p>\n<p>Set your own destiny.</p>\n<h2>How to Apply</h2>\n<p>Applying is simple.</p>\n<p><a href=\"https://zapier.wufoo.com/forms/customer-champion-asiaaustralia-application/\">Complete this form with answers to the below questions</a>.</p>\n<ol>\n<li>Tell us why you'd be a good fit for this role.</li>\n<li>Tell us why you want to work at Zapier instead of somewhere else.</li>\n<li>What should our goal be when replying to users?</li>\n<li>A user requests an integration with a service that we don't support yet. Compose a reply to this user.</li>\n<li>Set up a zap that takes new Gmail emails from a specific sender and adds them to a Google Sheets spreadsheet.  Send us the link to the zap and a share link for the spreadsheet.</li>\n<li>Send us a link to an app's API docs that you think are well done, and explain why you think they are good.</li>\n<li>Look at <a href=\"https://gist.github.com/WadeFoster/0bd294efe54f8fb8a1e7\">this list</a> and pick the 5 things that most excite you. Also pick the 5 things that least excite you. Don't pick by your opinion of importance, this is mostly to see interest/experience. </li>\n<li>How did you hear about Zapier?</li>\n<li>Optional: <a href=\"https://zapier.wufoo.com/forms/zv5nyxr0ho7nxi/def/Field208=Customer+Happiness\">Share anonymously some demographic information about yourself</a> to help us better track trends related to the backgrounds of candidates interested in working at Zapier in order for us to build a team that represents the users at Zapier and the broader world population.</li>\n</ol>\n<p>Finally, wait for us to reply. We reply to everyone, even if we don't seem like a good fit.</p>\n<p><em>Zapier is an equal opportunity employer. We're excited to work with talented and empathetic people no matter their race, color, religion, national origin, sex, physical or mental disability, or age. Our <a href=\"https://zapier.com/jobs/zapier-code-of-conduct/\">code of conduct</a> provides a beacon for the kind of company we strive to be and we celebrate our differences because those differences are what allow us to make a product that serves a global user base.</em></p>\n\n\n          \n        </div>","publish_date":"2016-09-23"},{"feature":"true","link":"jobs/github-account-apac.html","location":"Asia Pacific (Remote)","published":"Sep 21","id":5,"title":"GitHub Account Support","body":"\nThe GitHub Accounts Support team is looking for full-time team members who are based in Asia Pacific. This person will join GitHub as part of our global support team and support our customers around the world. This is the current list of countries in which we are set up as an employer in Asia Pacific, so legal working authorization is required:Japan, Australia, and New Zealand.\n\nWhen GitHub users have questions, they email support. We help people as quickly *and awesomely* as possible. Our Account Support team handle passwords, email verification, billing, legal, spam and abuse, account lockouts, fraud, and helping people choose plans. This requires a logical brain and a spidey sense for problems.\n\nThe most important characteristic of our support team is that we love helping developers. GitHub is a place for people to work better, together. Our job is to help. Support treats users the way we'd want someone to treat our friends.\n\nOur support teammates have excellent writing chops: stellar grammar, charming written personality, and the ability to explain complicated things simply. We measure our success in swiftness, accuracy, and clarity.\n\n*Developers: this probably isn't the job for you, but perhaps you have a friend who would be a perfect fit. Send them this link. Thanks!*\n\n### REQUIREMENTS:\n- Currently residing in Japan, Australia, and New Zealand.\n- Current legal working authorization to work in Japan, Australia, and New Zealand.\n- Stellar English and grammar skills\n- Excellent problem solving skills – you might not know all of the answers, but you know how to find and communicate the solution\n- A strong sense of empathy and the ability to advocate for others\n- A unique writing style and voice\n\n### BONUS POINTS:\n- Prior customer support experience\n- Technical experience (QA, documentation, elaborate boardgames)\n- Experience working remotely","publish_date":"2016-09-21"},{"feature":"true","link":"jobs/github-enterprise-support-engineer.html","location":"North America (Remote)","published":"Sep 12","id":6,"title":"GitHub Enterprise Support Engineer","body":"\nMore and more companies are using GitHub Enterprise, so the support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. This person will join GitHub as part of our global support team and support our customers around the world. We're looking for Enterprise Support Engineers, in North America (US and Canada) to support our GitHub Enterprise product installed and managed in the customer's virtualization environment.\n\nYour main responsibility will be to work with our customers to solve support tickets. Tickets are usually opened by internal system administrators, and can include investigating load or networking issues, debugging application errors, and discussing feature requests. You'll also work with our engineering team to prioritize issues and development, and our documentation team to improve customer-facing resources. You don’t need to be a Git expert, but you do need to have technical experience and a passion for helping people.\nThe position reports to an Enterprise Support Manager and works closely with other teams and leaders across the company.\n\nGitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events.\n\n### RESPONSIBILITIES\n- Solve complex customer support tickets often involving Linux servers, source code, and web application issues\n- Effectively communicate technical information to customers and engineering groups at GitHub\n- Work proactively with customers on activities such as coordinating upgrades, communicating upcoming features, and ensuring their installation is running smoothly\n- Identify bugs and improvements in the GitHub Enterprise codebase\n- Manage urgent customer outages during business hours\n\n### QUALIFICATIONS\n- Must have current legal working authorizaton\n- General understanding of how modern web applications work\n- Prior experience providing technical support\n- Excellent problem solving skills\n- Familiarity with some flavor of production-level virtual machine (e.g., VMware ESX, Xen, KVM)\n- Enthusiasm for working directly with customers\n- Stellar English and grammar skills\n\n### BONUS POINTS IF YOU HAVE\n- Worked closely with large complex customer accounts\n- Familiarity with Git and GitHub\n- Experience with phone support\n- Ability to look through and understand code (Ruby / Bash)\n- Previous experience as a System Administrator\n- Previous experience as a Linux System Administrator","publish_date":"2016-09-12"},{"link":"jobs/fleetio.html","location":"Birmingham, AL (or remote)","published":"Sep 9","id":7,"title":"Fleetio Customer Success Director","body":"\nAs the Customer Success Director at Fleetio, your job is to deliver continuous value for our customers, enabling their success and driving customer retention. This is a demanding but rewarding role that requires a broad skillset. You’ll manage Customer Experience Reps who support our customers every day. You will also monitor customer health through usage and satisfaction data, customer surveys and more, then take proactive action to ensure customer retention.\n\nFleetio is a modern software platform that helps thousands of organizations around the world manage a fleet. Transportation technology is a hot market and we’re leading the charge, with raving fans and new customers signing up every day. Your job is to make sure we exceed our customers’ expectations, and that they continue to receive ongoing value from our software platform.\n\nWe take customer service and retention seriously. This is a position we consider essential to the company’s success. Be sure to mention coffee in your application so we know you actually read this.\n\n### KEY RESPONSIBILITIES\n- Grow customer relationships, drive adoption and customer satisfaction\n- Establish a trusted advisor relationship with customers and help them receive continued value from our products\n- Maximize customer/revenue retention by monitoring usage and survey data to identify at-risk customers and proactively reach out to them\n- Lead the Customer Success Team: coach team members, monitor daily operations and remove obstacles\n- Recruit & hire more Customer Success Team members to keep up with business growth\n- Assist the Sales Team in onboarding and training new customers\n- Design upfront training and implementation services for enterprise customers; lead the team to deliver swift and accurate implementations\n- Identify and nurture customer advocates to be used as sales references\n- Help upsell existing customers on new product offerings\n\n### WHAT'S IN IT FOR YOU\n- Work with fascinating customers and prospects from all around the world. So many different types of companies and organizations operate a fleet each day, and Fleetio is a good fit for most of them (it’s a huge market).\n- Be a part of an incredible team of “A” players who go above and beyond to make Fleetio a successful company. We’re a customer-centric team with a great product, excellent support, and countless happy customers.\n- Use the latest tools and techniques to grow a massive audience in a global marketplace (we already have paying customers in about 50 countries).\n- Work from our HQ in Birmingham, AL or wherever you’d like as a part of our strong remote working culture.\n\n### REQUIREMENTS\n- 3+ years of Customer Success (or equivalent) experience in a B2B-focused role with a proven history of increasing customer satisfaction, adoption and retention\n- 2+ years of management experience in a SaaS business\n- Strong analytical approach to customer success -- you love using BI tools and spreadsheets to dig into usage data\n- Excellent written and verbal communication skills -- there is a heavy amount of writing and prospect/customer interaction in this role\n- Incredibly organized and efficient, a great project manager\n- Familiarity working with enterprise customers\n- Passion for exceptional customer service and appreciation for its role in a company’s success\n- You must absolutely love delighting customers\n- Excited by technology and its ability to make you more productive\n- Strong team player but still a self-starter\n- Level up if you know a thing or two about cars and engines\n\n### BENEFITS\n- 100% coverage of health and dental insurance\n- 401(k)\n- Meaningful company equity\n- Book program and professional development budget\n- Mac laptop and whatever tools you need","publish_date":"2016-09-09"},{"feature":"true","link":"jobs/ipsy-care.html","location":"San Mateo, CA","published":"Sep 9","id":8,"title":"ipsy Customer Care Representative","body":"\nAt ipsy, our customers are at the core of everything we do, and we’re committed to providing them with top-notch service. We’re searching for a support representative who is passionate about helping others, who can proactively offer solutions and ideas that will delight our members. This position is responsible for managing sensitive customer interactions, proposing creative solutions, and establishing rapport with our engaged community. You will be scheduled for our evening shift (12-8 PM), and one weekend shift per week.\n\nCOVER LETTER REQUIRED – Please tell us about yourself and why you’re interested in this role.\n\n### You Are:\n- Support driven. You have a passion for problem-solving and enjoy being challenged. Helping others comes naturally to you.\n- Perceptive and empathetic. You proactively anticipate customer needs. You can adapt your tone and approach to fit a diverse range of customer personalities and situations.\n- Honest and authentic. You’re comfortable being yourself and genuinely enjoy connecting with others. You express yourself openly and respectfully, and function well as part of a team.\n- Reliable and accountable. You’re consistent, dependable, and adhere to a set work schedule.\n- You take ownership over the quality of your work and make an effort to improve.\n- Innovative. You're a creative thinker who can offer solutions to the trickiest conundrums. You bring compelling ideas to the table in an effort to catalyze positive change.\n\n### Responsibilities:\n- Respond to customer emails in a professional, friendly, and timely manner to enhance our members’ knowledge of ipsy and create a positive experience for them\n- Manage sensitive issues while maintaining the highest level of professionalism; provide thoughtful, prompt resolutions with empathy and poise\n- Recommend solutions to complex or escalated situations through research and critical thinking\n- Share relevant, strategic insights with our product, marketing, and technology teams regarding overall customer experience and service-related trends\n- Strive to exceed volume and quality goals\n- Help with additional projects as needed\n\n### Qualifications:\n- Bachelor degree or equivalent experience\n- 1-3 years in customer-centric industry\n- Strong computer and typing skills, very comfortable with web-based applications and navigation between tools\n- Exceptional written communication skills with keen attention to detail\n- Entrepreneurial spirit with ability to manage workflow efficiently\n- Willing to work one weekend shift per week\n- Experience providing customer support via social media is a plus","publish_date":"2016-09-09"},{"feature":"true","link":"jobs/ipsy-social.html","location":"San Mateo, CA","published":"Sep 9","id":9,"title":"ipsy Customer Care Representative - Social Media","body":"\nipsy is committed to providing excellent service to our community. We’re seeking someone with a passion for helping others, who can actively suggest initiatives that will delight our membership. This role is responsible for providing customer support through our various social media channels (Facebook, Instagram, Twitter, Pinterest, and YouTube). It will involve managing sensitive customer escalations, researching and proposing creative solutions, and building rapport with our active community.\n\nCOVER LETTER REQUIRED – Please tell us about yourself and why you’re interested in this role.\n\n### You Are:\n- Passionate about providing excellent support. You enjoy tackling a challenge head on and never shy away from an opportunity to learn and grow. You love social media and understand the importance of brand consistency.\n- Empathetic and perceptive. You can identify the tone of a customer and adjust your approach accordingly. You are proactive and always anticipate customer needs.\n- Authentic and honest. You’re not afraid to be yourself, and you have a desire to connect with others in a genuine way. You communicate openly and respectfully with teammates.\n- Reliable and accountable. You can adhere to a consistent work schedule. You accept ownership over the quality of your work, and take initiative to keep improving.\n- Creative. You’re an innovator who can think of solutions to the trickiest conundrums. You bring compelling ideas to the table in an effort to catalyze positive change.\n\n### Responsibilities:\n- Respond to comments made on our social channels in a timely, friendly, and professional manner to educate and create positive connections with our community.\n- Identify sensitive issues and potential escalations, and relay to appropriate teams ensuring that all members are helped in a quick and thorough manner.\n- Maintain the highest level of professionalism while managing sensitive issues. Demonstrate empathy while providing thoughtful and prompt resolutions.\n- Research complex and escalated situations and recommend solutions.\n- Provide thoughtful, strategic insight regarding customer requests and service-related trends to our product, marketing, and technology teams.\n- Strive to exceed volume and quality goals.\n- Help with side projects as needed.\n- You will be responsible for working our midday or evening shift (10 - 6 or 12 - 8 PM), and one weekend shift per week.\n\n\n### Qualifications:\n- Bachelor degree or equivalent experience.\n- 1-3 years in customer-centric industry, preferably with experience providing customer support via social media.\n- Strong computer and typing skills. Particularly high level of comfort in web-based applications and navigation between tools.\n- Exceptional written communication skills with keen attention to detail.\n- Entrepreneurial spirit with ability to manage workload efficiently.\n- Willing to work one weekend shift per week.","publish_date":"2016-09-09"},{"has_chat":"true","link":"jobs/lifechurch.html","location":"Oklahoma City, OK","published":"Aug 30","id":10,"title":"Life.Church YouVersion User Support Team Leader","body":"\nAt Life.Church we believe our jobs are a calling. We are risk-taking, irrationally generous, spiritual contributors who bring our best, laugh hard, and honor God with integrity. We are mutually broken and trying, together, to find restoration in Christ and to help restore our community and the world. Our life and our work are centered around one thing: leading people to become fully devoted followers of Christ. \n \nWith more than 240 million installs of the Bible App and 12 million installs of the Bible App for Kids, the YouVersion team continues to grow and evolve in an effort to appropriately steward the opportunities brought our way. We are looking for a driven and capable leader for user support of the Bible App, the Bible App for Kids, and our website, www.bible.com. Do you have the ability to lead, motivate, and grow an international support team, a passion for critical analysis and problem-solving, and the ability to drive change? If you do, you should definitely keep reading.\n \n### We want someone who will:\n- Develop a large global team consisting of hundreds of international volunteers\n- Supply original ideas and create efficient processes\n- Work autonomously and drive change through influence\n- Keep up with new tools and processes in the world of user support and think critically about how we could apply them\n \n### You want a job that includes:\n- Helping millions of users around the world better engage in the Bible\n- Leading, growing, and inspiring an international team that includes dozens of different cultures and backgrounds\n- Tight deadlines and an agile work environment\n- Constantly fiddling with more Apple and Android devices than you have pockets to hold them\n \n### The perfect fit:\n- Has experience in managing user or customer support teams and in building strong relationships and rapport with a largely remote team\n- Can recite a list of top companies with world-class user support\n- Sports a broad sense of humor and a deep appreciation for the absurd","publish_date":"2016-08-30"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Aug 23","id":11,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2016-08-23"}]