[{"has_chat":"true","link":"jobs/basecamp.html","location":"Anywhere, USA","published":"Mar 29","id":1,"title":"Basecamp Customer Support Advocate","body":"\nWe’re looking for a super smart support team member! Specifically, we're seeking a native English speaker in the US (preferably PST).\n\nYou’ll be responsible for providing tremendous customer service via email and phone for all versions of Basecamp. You’ll also help us answer questions via Twitter, create and edit help documentation, run personalized demos, and maybe some online classes.\n\nDuring training, you'll be expected to be proactive in your process and learn quickly. Once fully up-to-speed (2-3 months), you'll write about 100 emails per day. This is a significant volume, so be sure that you’re ready and able to deal with that kind of daily load -- you'll get all the love and help you need along the way!\n\nWe’re looking for some great writers who love helping our customers, so you should enjoy making complicated situations simple and painless and have a passion for our products. This means being a great problem solver with the ability to process and resolve issues quickly.\n\nIf you want to join Carrie, Chase, Chris, Elizabeth, James, Jim, Joan, Kristin, Merissa, Natalie, Sylvia and Tony in making our customers happy, please apply!\n\n### Please submit a cover letter explaining:\n- Why you want to work in customer support.\n- Why you want to work at Basecamp and not somewhere else.\n- A description of a great customer service/support experience you had recently, and what made it great.\n- A time you taught yourself a new skill to complete a job or project.\n- A guide to making a peanut butter and jelly sandwich. (Seriously.)\n\n### Also, pick three of the questions from customers below and answer them like you would if you worked here:\n- Does the new Basecamp offer time tracking?\n- Is the new Basecamp offered in any other language besides English?\n- I've been a Basecamp user for years and see you have a new version. What's the difference between the versions, and why should I switch?\n- How do I work with clients in the new Basecamp?\n\nWe offer heaps of lovely benefits, a competitive salary, plus a progressive work environment.\n\n### How to apply:\nEmail everything to <a href=\"mailto:jointheteam@basecamp.com\">jointheteam@basecamp.com</a>. Include “Customer Support” and your location in the subject line. If you’re attaching a resume, please send it as a PDF.\n\nNote: This is not a position for designers/programmers who are looking to work their way into another job at Basecamp; we are solely looking for someone interested in and dedicated to supporting our customers. Do not send LinkedIn resume links. If you don't fit the specific criteria, please do not apply.\n\nWe look forward to hearing from you!","publish_date":"2016-03-29"},{"link":"jobs/dealdash.html","location":"Remote","published":"Mar 29","id":2,"title":"Deal Dash Customer Service Specialist","body":"\nDealDash is looking for talented and motivated individuals who are interested in joining a company with startup roots that has now grown into an e-commerce success.\n\nThis is an English language position within our Customer Support team.\nYou will need to demonstrate you're capable of independent work, fresh ideas and the drive to be part of a successful team.\n\nSuccessful applicants will begin with a two-week training period in our head office, following which the opportunity to work remotely is available. This is a 5 day per week position with shifts that may be from Mon-Sun and may include evening work.\n\nThis position is available immediately, so please apply ASAP!","publish_date":"2016-03-29"},{"has_chat":"true","link":"jobs/remind.html","location":"San Francisco, CA","published":"Mar 25","id":3,"title":"Remind Support Enthusiast","body":"\n8,300 students drop out of school every day. We're looking for people to help us change this.\n\n### About Us\nRemind helps educators send quick, simple messages to students and parents on any device. We believe that when communication improves, relationships get stronger. Education gets better. \n\nWe're hiring team members inspired by the potential to transform education, motivated to solve communication challenges in education, and passionate about our vision of connecting every teacher, student, and parent in the world. With more than 35 million users, Remind is one of the fastest-growing companies in education technology. \n\nWe’ve raised $59 million in funding from Kleiner Perkins, Social Capital, and First Round Capital to bring us closer to achieving our goals, and we want you to join us.\n\n### Responsibilities\n- Help teachers succeed by answering incoming support emails quickly and accurately, achieving over 95%+ satisfaction rating.\n- Respond quickly and with empathy to user reports and requests.\n- Rock phone and online Live Chat support to delight teachers.\n- Keep FAQ content, video content, and various learning resources accurate and up-to-date.\n- Improve productivity by automating common answers, identifying issues to the Product and Engineering organizations, and reporting trends to the Support leadership team.\n\n### Requirements\n- You have worked in a support or project management role.\n- You are tech-savvy and have the ability to learn new programs quickly.\n- You are an awesome problem solver and enjoy being efficient and detail-oriented.\n- You are genuinely compassionate and dedicated. You strive to understand a customer’s problems and care that they're taken care of, and you won't stop until they’re happy!\n- Bonus: You have worked in the education field in some capacity.\n\n### Benefits and Perks\n- Competitive salary and equity\n- 100% health coverage for you and your dependents\n- Open vacation policy\n- Parental leave\n- Catered meals and fully stocked kitchen\n- Health and education reimbursement\n- Parking and commuter benefits\n\n","publish_date":"2016-03-25"},{"has_chat":"true","link":"jobs/sched.html","location":"Earth","published":"Mar 22","id":4,"title":"Sched Event Organizer Support","body":"\n### WHAT WE DO:\nSched helps event organizers publish event info and track attendees. We make it easy to create a beautiful event site with a schedule and directory of your speakers, sponsors and attendees. Thousands of conferences, conventions, festivals, and meetings depend on Sched including Comic-Con, Wanderlust, Stanford, Austin Film Festival and even the US Grand Prix.\n\n### WHAT YOU'RE LIKE:\n- Love to help others & empathize with users of all experience levels\n- Have outstanding writing & communication skills\n- Enjoy solving problems & learning new things\n- Reliable, optimistic & super-organized\n- Tech-savvy\n- Experience doing online support\n\n### WHAT YOU'LL BE DOING:\nAs part of the Sched support team, you will be a critical part of creating great events & providing support for customers. Your primary responsibilities include email & live-chat support for our customers, and improving our support articles. You will also work side-by-side with our development team to identify areas of improvement and help determine new Sched features based on customer insights.","publish_date":"2016-03-22"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Mar 21","id":5,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2016-03-21"},{"has_chat":"true","link":"jobs/highrise.html","location":"Remote","published":"Mar 18","id":6,"title":"Join our Support Team at Highrise","body":"\n<div class=\"listing-container\">\n    <div>Highrise is looking for someone to join our customer support team. We need someone who knows how to communicate and help.&nbsp;</div><div class=\"paragraph_break\"><br></div><div>You won't just be replying to customer's emails all day. You'll look for ways to make customers happy, educate them on how to use our product, and help them succeed at their own businesses. You'll have an opportunity to shape the future of Highrise.&nbsp;</div><div class=\"paragraph_break\"><br></div><div>We're after someone who . . .</div><ul><li>Writes in a clear and concise manner&nbsp;</li><li>Enjoys teaching others and explaining technical concepts</li><li>Has patience to listen and grasp what customers are trying to accomplish</li><li>Loves learning and re-learning a product that is changing fast&nbsp;</li><li>Doesn't need any hand-holding and isn't afraid to make decisions&nbsp;</li><li>Has familiarity with small businesses and software products&nbsp;</li></ul><div class=\"paragraph_break\"><br></div><div>Responsibilities include replying to customer emails, writing help documentation and tutorials, sharing feature requests and improvements with the team.&nbsp;</div><div class=\"paragraph_break\"><br></div><div>Experience making or editing videos, writing HTML/CSS, or working with APIs are all pluses too :)&nbsp;</div><div class=\"paragraph_break\"><br></div><div>This is a full-time position. You can work from anywhere. Highrise is headquartered in Chicago, but our entire team works remotely. Work from wherever you are comfortable.</div><div class=\"paragraph_break\"><br></div><div>If this sounds like you, please get in touch and let's get to know each other.&nbsp;</div><div class=\"paragraph_break\"><br></div><div><strong>More about us:</strong></div><div>Highrise is a super simple CRM tool, built by 37signals/Basecamp and launched on March 20, 2007. It's grown to become a multi-million dollar business with a strong, loyal customer base. In August 2014, Highrise left the nest, and was spun-off as its own company - a very welcome change for Highrise users, as our users now have their own dedicated development and support team.</div><div class=\"paragraph_break\"><br></div><div>We have a small team that is furiously improving an already well-used application. A lot of people are going to depend on you for help.&nbsp;</div><div class=\"paragraph_break\"><br></div><div>You can see what our customers say about us (<a href=\"https://highrisehq.com/love/\">https://highrisehq.com/love/</a>) and why we work (<a href=\"https://highrisehq.com/about/\">https://highrisehq.com/about/</a>) on Highrise.&nbsp;</div><div class=\"paragraph_break\"><br></div><div><strong>Our current team:</strong></div><div class=\"paragraph_break\"><br></div><div>Nathan Kontny, CEO&nbsp;</div><div>Software engineer and designer for 15 years. Began an entrepreneurial career with two Y Combinator backed startups: Inkling (<a href=\"http://inklingmarkets.com\">http://inklingmarkets.com</a>) in 2005 and Draft (<a href=\"http://draftin.com\">http://draftin.com</a>) in 2011. Also was an engineer on President Obama's re-election campaign. One of the best ways to get to know Nathan is his writing on Signal V. Noise and Ninjas and Robots.</div><div class=\"paragraph_break\"><br></div><div>Michael Dwan, CTO&nbsp;</div><div>Michael is a Y Combinator alum and the engineer behind creating an awesome photo application called Snapjoy. Snapjoy was quickly acquired by Dropbox, and you’ll see his handiwork all over what Dropbox has done with Carousel and photo storage.</div><div class=\"paragraph_break\"><br></div><div>Lynette Kontny, COO&nbsp;</div><div>You'll see Lynette's work all over Highrise. She makes sure we're all on the same page and getting the right things done quickly.</div><div class=\"paragraph_break\"><br></div><div>Jon Phenow, Software Engineer</div><div>Jon is a big reason Highrise continues to improve at a rapid pace. He juggles multiple projects at a time and makes Highrise more useful every day.&nbsp;</div><div class=\"paragraph_break\"><br></div><div>Grant Blakeman, Software Engineer and Designer</div><div>If you've noticed Highrise is more visually appealing and easy-to use lately, it's because of Grant. He's constantly working to improve the look and feel of Highrise.&nbsp;</div><div class=\"paragraph_break\"><br></div><div>Chris Gallo, Head of Customer Support&nbsp;</div><div>You’ll hear from Chris if you need help with Highrise. Chris knows how to communicate and how to help fast.&nbsp;</div><div class=\"paragraph_break\"><br></div><div><strong>How to Apply&nbsp;</strong></div><div class=\"paragraph_break\"><br></div><div>Please submit a cover letter explaining:</div><ol><li>Why you want to work in customer support.</li><li>Why you want to work at Highrise and not somewhere else.</li><li>A description of a great customer service/support experience you had recently, and what made it great.</li></ol><div class=\"paragraph_break\">\n\n        <p>\n    Email everything to <a href=\"mailto:jointheteam+support@highrisehq.com\">jointheteam+support@highrisehq.com</a>. Include “Customer Support” in the subject line. If you’re attaching a resume, please send it as a PDF. We love people who get creative with their applications.\n    \n        </p>\n    \n    <br></div><div>We look forward to hearing from you.</div><div class=\"paragraph_break\"><br></div>\n\n  </div>","publish_date":"2016-03-18"},{"has_chat":"true","link":"jobs/ray.html","location":"Dumbo, Brooklyn","published":"Mar 18","id":7,"title":"Ray Customer Support Specialist","body":"\nThe Ray Super Remote hit the market in October with the world’s first touchscreen universal remote control. We’re a small team taking on an entire industry with the simplest, most user-friendly device to control the modern home.\n\nWe are in the exciting phase of building our entire customer support experience. We are looking for a Customer Support Specialist to join us at the frontline and be a part of envisioning, shaping and evolving this crucial part of Ray.\n\nThis is a full-time 40hr/week position based in Dumbo, Brooklyn.\n\n### YOUR RESPONSIBILITIES:\n- Be on the front-line building relationships with customers over email, chat and phone.\n- Get to know Ray and all the devices we support, inside-out and upside down. You’ll need to be comfortable troubleshooting both common and rare situations, with tech savvy and not-so-savvy customers alike.\n- Genuinely care about our customers. Their problems are your problems. Find ways to delight meaningfully and redefine what it means to go the extra mile.\n- Reliably resolve a customer’s questions and needs efficiently, completely and accurately. Own it, but don’t be afraid to ask for help.\n- Be a team player and take initiative. Share your learning, build our knowledge base and improve the way we work.\n\n### ABOUT YOU:\n- You are a great communicator with excellent verbal and written English skills: You are concise, clear and focused in your responses while expressing personality in a fun, friendly and professional tone.\n- You are self-driven and motivated to learn about technology: We don’t expect you to arrive talking in IR code sets, but you are expected to dive in and ramp up pretty quickly.\n- You are a resourceful problem solver: This is complicated stuff, you’ll need to dissect a customer’s situation and find nifty solutions.\n- You are upbeat, positive, patient and sensitive to the customer: Their mood, how much handholding they need and the appropriate tone you should take to ease their minds.\n- You love TV, entertainment and the connected home: we are changing the world’s relationship with TV and their homes, you need to love it as much as our customers do.\n- You have previous experience in a customer support role (2 + years). Being proficient with Zendesk is a major plus.\n- Bonus points if you have experience in a startup, consumer electronics and/or interacting with customers on Amazon.\n\n### BENEFITS:\nYou pay us for this once in a lifetime opportunity. J/k.\n\n- Medical, dental and vision insurance\n- Employee stock options\n- Unlimited vacation\n- Company outings & gatherings\n- Snacks & drinks on tap\n\n### ABOUT RAY:\nRay controls thousands of home devices over infrared and wifi technology, including TVs, set-top boxes, streaming boxes, audio devices and more. It’s hooked up to your TV provider to recommend what to watch on TV based on what you like. It’s designed for everyone and heralded as having the simplest, quickest setup known to humankind.\n\n### TO APPLY:\nEmail resume and info to <a href=\"mailto:lorien@ray.co\">lorien@ray.co</a>","publish_date":"2016-03-18"},{"has_chat":"true","feature":"true","link":"jobs/issuu.html","location":"Palo Alto, CA","published":"Mar 15","id":8,"title":"issuu Community Manager","body":"\nissuu is the world's leading digital publishing platform. We're looking for a new member to join our fantastic team. With amazing people, unique ideas and stunning technology, we're changing the future of publishing today. Are you the best at what you do? Come join us.\n\n### About this job\nThe marketing team at issuu is seeking a creative, inspired Community Manager to join us and take responsibility for building strong, positive relationships with the growing number of publishers who rely on issuu every day. You enjoy interacting with people online and in the real world, and you have a knack for engaging others with the ideas and content you create and share. You’ll be part of a growing team that collaborates with awesome colleagues in design, support, product and engineering to deliver the world’s best publishing experience for millions of people. This is a full-time position based in issuu’s Palo Alto office. You will report to the VP of Marketing.\n\n### RESPONSIBILITIES\n- Manage issuu social communities across Facebook, Twitter, Pinterest, LinkedIn, Instagram and others\n- Engage with publishers to foster the development of an active community organized around their concerns, interests and opportunities for growth\n- Identify and manage influencer outreach to drive additional visibility for issuu among publishers\n- Lead the creation and management of content and social media campaigns to highlight issuu’s network and global audience\n- Develop an editorial calendar and content strategy for each social channel we participate in\n\n### QUALIFICATIONS\n- 1-3 years of experience managing online communities\n- Excellent communication skills\n- Strong understanding and prior experience with major social media platforms including Facebook, Twitter and Pinterest\n- Great teammate and collaborator, able to work with a diverse and geographically dispersed team\n- Able to be effective in a startup environment: be proactive, creative and innovative\n\n### BENEFITS\n- Competitive compensation package, commensurate with experience\n- Flexible vacation policy\n- Competitive health, dental and vision packages\n- A sleek Mac and a pretty sweet desk setup\n- Walking distance to the Palo Alto Caltrain station and monthly passes for public transportation or parking\n- Catered lunches and team events","publish_date":"2016-03-15"},{"link":"jobs/web4realty.html","location":"Remote","published":"Mar 15","id":9,"title":"Web4Realty Client Success Manager","body":"\nWe’re looking for a remote Client Success Manager to join our growing team. You will be the first point of contact for our users and help serve as the voice of the company. We’re looking for smart, engaging, and dynamic people who learn quickly and have a passion for technology and helping clients. If you’re looking to kickstart your career by joining one of the fastest-growing web providers in the industry, we want to hear from you!\n\nWhen Web4Realty users have questions, they contact Support and we help them as quickly and awesomely as possible. Client Success Managers handle a wide variety of inquiries including questions about how to improve web traffic, advice on generating leads, helping users manage content on their websites, and troubleshooting application issues. Client Success also works closely with the engineering team to track down bugs and improve our documentation. We’re looking for someone who can do more than just close tickets, but also be a teacher to our clients.\n\nWe strongly support flexible schedules and positive work/life balance so you to take care of the important things in your life.\n\n### You Must Have\n\n- Stellar English and grammar skills.\n- Excellent problem solving skills – you might not know all the answers but you know how to find and communicate the solution.\n- Assist current and potential Web4Realty users in understanding the product, its features and how it can best be used to grow their business.\n- Manage and resolve support requests over the phone or email.\n- Update or create support articles for new features.\n- Work with users to identify, troubleshoot and resolve issues as well as collect feedback.\n- Work side-by-side with our Product Engineering team to improve Web4Realty.\n- Provide a positive, personalized experience to each customer who reaches out to us.\n\n### Requirements\n\n- MOST IMPORTANT—You possess strong written and verbal communication skills.\n- You're a self starter and are driven to conquer projects outside of your core responsibilities.\n- You’re analytically-minded, and are able to prioritize workloads and adjust as situations change.\n- You enjoy helping others and appreciate the challenge of solving technology related problems.\n- You're excited about learning and technology in a rapidly growing environment.\n- You engage well with others and remain calm under pressure.\n\n### Bonus Skills\n\n- Experience using a CRM solution and an understanding of the SaaS marketplace\n- Experience using ticket managing applications such as Zendesk, Freshdesk, etc.\n- Knowledge of basic HTML, SEO, and website management is a major asset.\n\n### Why You Should Join\n\nWorking at Web4Realty is one of the most unique work opportunities you will ever experience. We're committed to transparency, collaboration, experimentation, and always staying classy.\nBecause of this unique perspective, we've established one of the most flexible and well designed work environments around that encourages you to work as you work best. Right now, over 50% of our employees are based outside of our Mississauga headquarters and work according to how they get their best stuff done.\nEnsuring that our team members are healthy, motivated, focused and creative is how Web4Realty stays awesome. In a nutshell, we've built and are growing a place where we truly love working, and we think you will too.","publish_date":"2016-03-15"},{"feature":"true","link":"jobs/github-enterprise.html","location":"Remote","published":"Mar 7","id":10,"title":"GitHub Enterprise Support Engineer","body":"\nMore and more companies are using GitHub Enterprise, so the support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. We're looking for Enterprise Support Engineers, in North America, some European territories, Australia, Japan, and New Zealand to support our GitHub Enterprise product installed and managed in the customer's virtualization environment.\n\nYour main responsibility will be to work with our customers to solve support tickets. Tickets are usually opened by internal system administrators, and can include investigating load or networking issues, debugging application errors, and discussing feature requests. You'll also work with our engineering team to prioritize issues and development, and our documentation team to improve customer-facing resources. You don’t need to be a Git expert, but you do need to have technical experience and a passion for helping people.\n\nThe position reports to an Enterprise Support Manager and works closely with other teams and leaders across the company.\n\nGitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events. \n\n### RESPONSIBILITIES\n- Solve complex customer support tickets often involving Linux servers, source code, and web application issues\n- Effectively communicate technical information to customers and engineering groups at GitHub\n- Work proactively with customers on activities such as coordinating upgrades, communicating upcoming features, and ensuring their installation is running smoothly\n- Identify bugs and improvements in the GitHub Enterprise codebase\n- Manage urgent customer outages during business hours\n\n### QUALIFICATIONS\n- General understanding of how modern web applications work\n- Prior experience providing technical support\n- Excellent problem solving skills\n- Familiarity with some flavor of production-level virtual machine (e.g., VMware ESX, Xen, KVM)\n- Enthusiasm for working directly with customers\n- Stellar English and grammar skills\n\n### BONUS POINTS IF YOU HAVE\n- Worked closely with large complex customer accounts\n- Familiarity with Git and GitHub\n- Experience with phone support\n- Ability to look through and understand code (Ruby / Bash)\n- Previous experience as a System Administrator\n\n### WHY YOU SHOULD JOIN\nWorking at GitHub is, to put it simply, a special slice of the universe. We're committed to transparency, collaboration, experimentation, and always staying classy.\n\nBecause of this unique perspective, we've established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.\n\nEnsuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits* are out of this world.\n\nIn a nutshell, we've built and are growing a place where we truly love working, and we think you will too.\n\nGitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there's anything we can do to make the interview process better for you; we're happy to accommodate.\n\n*_Please note that benefits vary by country, if you have any questions don't hesitate to ask your recruiter!_","publish_date":"2016-03-07"},{"feature":"true","link":"jobs/github.html","location":"Remote","published":"Mar 7","id":11,"title":"GitHub Technical Support","body":"\nThe GitHub Technical Support team is looking for full-time team members in our SF office or worldwide! We are particularly in need of folks in Asia-Pacific and Europe. GitHub users work 24/7, so you'll occasionally need to adjust your work week to help cover a weekend or holiday (don't worry! We strongly support flexible schedules that let you to take care of the important things in your life).\n\nWhen GitHub users have questions, they contact Support and we help them as quickly and awesomely as possible. Technical support handles a wide variety of inquiries including questions about Git and GitHub workflows, GitHub Pages, our API, and our desktop applications. Support also works closely with the engineering team to track down bugs and improve our documentation.\n\nThe most important characteristic of our support team is that we love helping developers. GitHub is a place for people to work better, together. Our job is to help. Support treats users the way we'd want someone to treat our friends.\n\nOur support teammates have excellent writing chops: stellar grammar, charming written personality, and the ability to explain complicated things simply. We measure our success in swiftness, accuracy, and clarity.\n\n### YOU MUST HAVE:\n- Stellar English and grammar skills\n- Excellent problem solving skills – you might not know all the answers but you know how to find and communicate the solution\n- A strong sense of empathy – you are attuned to hear the question behind a question\n- Technical experience and exposure to programming\n- Customer service experience\n- A unique writing style and voice\n\n### BONUS IF YOU:\n- Will love developers and GitHub as much as we do\n- Could effortlessly explain how Git works to a non-developer\n- Have remote customer service experience\n\n### WHO WE ARE\nGitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.\n\nWe have a lot of exciting things to do, and we’re looking for the right people to grow with us!\n\n### WHY YOU SHOULD JOIN\n\nWorking at GitHub is, to put it simply, a special slice of the universe. We're committed to transparency, collaboration, experimentation, and always staying classy.\n\nBecause of this unique perspective, we've established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.\n\nEnsuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits* are out of this world.\n\nIn a nutshell, we've built and are growing a place where we truly love working, and we think you will too.\n\nGitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there's anything we can do to make the interview process better for you; we're happy to accommodate.\n\n*_Please note that benefits vary by country, if you have any questions don't hesitate to ask your recruiter!_","publish_date":"2016-03-07"},{"has_chat":"true","link":"jobs/base.html","location":"Mountain View, CA","published":"Mar 3","id":12,"title":"Base CRM Product Support Specialist","body":"\nWe’re looking for a Product Support Specialist in our Mountain View office. You will be the first point of contact for our users and help serve as the voice of the company. We’re looking for smart, engaging, and dynamic people who learn quickly and have a passion for technology. \n\nIf you’re looking to kickstart your career by joining one of the fastest-growing startups in the Valley, we want to hear from you!\n\n### EXPECTATIONS\n- Assist current and potential Base users in understanding the product, its features and how it can best be used to grow their business.\n- Provide product demonstrations and webinars for prospective and current users to help them understand how to get the most out of Base.\n- Manage and resolve support requests over the phone or email.\n- Update or create support articles for new features.\n- Work with users to identify, troubleshoot and resolve issues as well as collect feedback.\n- Work side-by-side with our Product Engineering team to improve Base.\n- Provide a positive, personalized experience to each customer who reaches out to us.\n\n### REQUIREMENTS\n- MOST IMPORTANT—You possess strong written and verbal communication skills.\n- You're a self starter and are driven to conquer projects outside of your core responsibilities.\n- You’re analytically-minded, and are able to prioritize workloads and adjust as situations change.\n- You enjoy helping others and appreciate the challenge of solving technology related problems.\n- You're excited about learning and technology in a rapidly growing environment.\n- You engage well with others and remain calm under pressure.\n\n### BONUS SKILLS YOU MAY HAVE\n- Experience using Microsoft Excel\n- Experience using a CRM solution and an understanding of the SaaS marketspace\n- Knowledge of various mobile platforms: iOS, Android, and Windows Mobile\n- Familiarity with RESTful API, Chrome Dev Tools, and various web technologies","publish_date":"2016-03-03"},{"has_chat":"true","feature":"true","link":"jobs/formlabs-community.html","location":"Boston, MA","published":"Mar 3","id":13,"title":"Formlabs Community Manager","body":"\nTo reinvent an industry, you have to build the best team. **Join Formlabs** if you want to bring ground-breaking professional 3D printers to the desktop of every designer, engineer, researcher, and artist in the world.\n\nOur primary goal is to give our customers the best tools with an amazing experience. With users of all levels throughout the world, developing our presence online is essential to growing our customers and product. We’re looking for a Community Manager to be the voice of Formlabs users, at events and online.\n\nIf you are ready to take 3D printing users to the next level by celebrating their applications, and teaching them how to do even more, join the Form Team as our Community Manager.\n\n### The job:\nInspire, organize, and scale our community presence through a variety of media\nCultivate powerful connections between users to share best practices and projects\nGet the world excited about 3D printing\n\n### You:\nAre already an expert in CAD and evangelist for 3D printing\nMaintain an active presence thorough forums, social media, and events\nExcited to be the voice and face of Formlabs in online webinars and local meetups\nA creative and patient problem solver who loves to help others be successful\nThoughtful and responsive, with a natural curiosity and sense of humor\nCan quickly develop quality written and visual content to teach tips and concepts\nTranslate feedback from the community into insights for core internal teams\nCan crunch numbers to track feedback and build metrics\nAn independent and driven self-starter, comfortable in a start-up environment\nPossess exceptional written and verbal communication skills\n\n### Bonus skills:\nHands-on fabrication expertise\nPrevious experience in the 3D printing industry\nPersonal interest in design or entrepreneurship","publish_date":"2016-03-03"},{"has_chat":"true","feature":"true","link":"jobs/formlabs.html","location":"Boston, MA","published":"Feb 22","id":14,"title":"Formlabs Customer Support Engineer","body":"\nTo reinvent an industry, you have to build the best team. **Join Formlabs** if you want to bring ground-breaking professional 3D printers to the desktop of every designer, engineer, researcher, and artist in the world.\n\nOur primary goal is to give our customers the best tools with an amazing experience. At Formlabs, that means answering every question, no matter how small, and building amazing support material to empower our users to innovate and create.\n\nIf you love new technology and are a natural problem-solver and a great communicator, we want you on the Form Team as a **Customer Support Engineer**.\n\n### The job:\n- Remotely identify and resolve technical issues with both software and hardware\n- Create excellent support content and continually improve our support systems\n- Keep customers ridiculously happy\n- Print in 3D to your heart’s content\n\n### You:\n- Feel amazing when you can identify the cause of a challenging problem\n- Can teach complex technical issues to any audience\n- A critical thinker, with an ability to quickly diagnose and resolve technical issues\n- Can easily adopt cloud-based business applications (Zendesk, Salesforce)\n- Power through task lists at lightning speed\n- Enjoy dismantling, troubleshooting, and playing with electronics\n- Care about going the extra mile to find or create the best solution\n- Possess exceptional written and verbal communication skills\n\n### Bonus skills:\n- Experience with 3D modeling, printing and digital fabrication\n- Experience providing technical support for hardware products\n- Creating and writing troubleshooting guides\n- Engineering or craft background, building and repairing electrical/mechanical systems\n- Familiarity with ticket or case management systems (Zendesk)","publish_date":"2016-02-22"},{"has_chat":"true","feature":"true","link":"jobs/haikulearning.html","location":"Tucson, AZ","published":"Feb 19","id":15,"title":"Haiku Learning Support Specialist","body":"\n### What is Haiku Learning?\n\nHaiku Learning is about community, and that includes our company’s community of creators, evangelists and visionaries. Right now we’re looking for a talented communicator and process-driven people-person who is passionate about great software, smart teamwork, and doing good in the world. We are a technology company that is passionate about the technology, but even more passionate about making tools that transform learning.\n\nWhy Haiku Learning is one of the best places to work on the planet:\n\n- You get to promote learning spaces that change lives.\n- You get to work with teachers and education technologists - some of the smartest, most amazing people from the leading schools and educational programs in the world.\n- You have flexibility to live your life. We know you have hobbies, interests, and families. We want you to love what you do, but not live what you do.\n\nIf you like people, are passionate about education, and want to help build the learning spaces of tomorrow, we want to hear from you.\n\n### Role Summary\n\nSupport Specialist are in charge of making sure every support request is met with positive energy and attention. Support Specialists should have a good eye for detail and are excellent writers who want to make sure people are taken care of. They are sleuths and investigators: Think Sherlock (with social skills).\n\nAs a First-Line-of-Defense Support Specialists, your primary role is to be responsive to customers via phone and our support ticketing system. You will also be investigating problems customers encounter to see if you can identify bugs and other issues. Support Specialists follow up internally as well as externally to communicate findings and solutions. \n\nThe expectation of the job is that you will be working 40 hours per week. You will be part of our support rotation on some weekends and holidays, and your weekly hours will be flexed to compensate for these duties. Your exact schedule will be determined by you and your supervisor.\n\n### Support Desk \n- Provide general support, lightweight integrations support, and general troubleshooting\n- Respond to support tickets, phone calls, and emails\n- Provide weekend Helpdesk support on a rotating basis\n- Follow up on existing tickets in a timely manner\n- Maintain active dialogue with users on open tickets\n- Report bugs and propose fixes to the Technical Lead or Technical Services Team\n- Understand and follow internal processes for support emergencies\n- Give suggestions for internal support processes and tool improvements\n\n### Product Quality Assurance & Technical Investigation\n- Work with Technical Lead to provide higher-level support for complex issues, including deep investigation, bug replication, and troubleshooting as needed \n- Participate in pre-launch Happy Hours (Quality Assurance Testing)\n- Participate in post-launch QA and customer follow-up process\n- Make tickets for fixes, changes, and enhancements\n- Work with Support Technical Lead to prioritize issues and follow up on critical bugs\n\n### Other Responsibilities\n- Attend weekly departmental meetings\n- Be responsive to our internal teams via chat, video, and email during working hours\n- Help keep Knowledgebase articles and videos accurate, up to date, and cross-referenced\n- Collaborate with Community Care team on general and shared duties\n- Collaborate with Support Team to triage tickets and escalate problems as needed\n- Complete other tasks and projects as requested by Team Manager\n\n### Skills & Proficiences\n- Strong technical skills with the ability to troubleshoot and clearly communicate solutions both orally and in writing\n- Familiarity with Google Apps and ticket tracking applications not required, but is a plus\n\n### Requirements\n- Bachelors degree, or comparable experience in customer support","publish_date":"2016-02-19"}]