[{"link":"jobs/helpscout.html","location":"Remote - PST - Tuesday - Saturday","published":"Aug 1","id":1,"title":"Help Scout Customer Champion","body":"\nSupport is Help Scout's bread and butter. We’re pleased to be searching for our sixth, full-time support team member. Our ideal hire is motivated by what we're doing as a company, and eager to contribute on the front lines.\n\n## About the Role\n* This is a remote position. We’re looking for someone to work Tuesday - Saturday, preferably PST hours.\n* You'll be a product expert in all areas. You'll spend most of your days sending timely, human replies to questions via email, but you’ll also create helpful videos, craft documentation, field phone calls, and offer guided tours.\n* Customer success is a big piece of the pie. You'll work one-on-one with customers, helping them to get the most out of Help Scout. You might wing unplanned Skype calls and live screen-shares, or schedule meetings to talk about unique use cases.\n* We don't hold you to empty policies or procedures. We expect you to always act in the best interest of the customer. You’ll be given plenty of autonomy to simply do what’s right, no questions asked. With great power comes great responsibility.\n* We’re sticklers about the customer experience. We’re always refining and polishing the product to perfection. As someone on the front line, your understanding of the product and our customers is incredibly valuable. You’ll regularly chat with the product team to make sure we’re getting it right.\n\n## About You\n* You are a free spirit who thrives in an environment where you can do great work without a ton of oversight.\n* You’re passionate about support. You’re in it for the long haul, and you’re not looking for the “next best thing”. This isn’t your first rodeo, nor is it a stepping stone. We’re looking for someone with at least one year of support experience.\n* You’re patient and hardy, with an excellent sense of humor. You’re an exceptional listener and educator, and you’re naturally curious with a strong desire to learn.\n* You’re an incredible communicator, fluent in written English. You’re just as comfortable on the phone or in person as you are in an email. Your writing is clear and simple, with a proper dose of empathy.\n* You have rare people skills that allow you to get out in front of problems, and proactively help customers with potential troubles. You’re a natural people-person. You’re the type of person that goes out of their way to make things right, always.\n* You’re have good ole’ fashioned work ethic, day in and day out. You have hustle and take initiative and ownership to see things through to completion. If it needs doing, you do it.\n\n\n### BENEFITS\n* Work anywhere - Work from our office in Boston or anywhere else. For this role we're ideally looking for someone based in the PST timezone, Tuesday - Saturday.\n* Competitive Salary - Based on our salary formula: $63,000 - $83,000. We pay at or above market salary in most cases and evaluate a lot of research to make sure everyone is paid well. The formula we use to calculate all salaries is public to employees and is improved upon regularly.\n* Health and dental insurance - We cover you and your family's health/dental insurance 100%. If you are based in the US, we'll cover you on our Harvard Pilgrim HMO or PPO policies.\n* Long-term/Short-term Disability Insurance & Life Insurance - we cover 100% of the premiums for LT/ST Disability insurance and base Life Insurance. You also have the option to purchase supplementary life insurance through our provider.\n* International Benefit Stipend - If you’re based outside the US, you’ll receive a monthly stipend that goes towards covering medical insurance, long and short-term disability, and accountant costs\n* Flexible vacation - Take time off when you need it, we trust you.\n* Paid parental leave, including adoption - 12 weeks if you have or adopt a baby, 4 weeks if your partner has a baby.\n* 401k with 1% match- 1% Retirement Plan matching for both US and International Employees\n* Personal development stipend - Up to $1,800 per year to improve your craft\n* Great tools - Each employee receives a Mac laptop and 27'' display (or equivalent). We’ll also purchase any of the software or hardware you need.\n* Complete transparency - Everyone has full access to business metrics and financial information about the company.","publish_date":"2016-08-01"},{"feature":"true","link":"jobs/ipsy-care.html","location":"San Mateo, CA","published":"Jul 19","id":2,"title":"ipsy Customer Care Representative","body":"\nAt ipsy, our customers are at the core of everything we do, and we’re committed to providing them with top-notch service. We’re searching for a support representative who is passionate about helping others, who can proactively offer solutions and ideas that will delight our members. This position is responsible for managing sensitive customer interactions, proposing creative solutions, and establishing rapport with our engaged community. You will be scheduled for our evening shift (12-8 PM), and one weekend shift per week.\n\nCOVER LETTER REQUIRED – Please tell us about yourself and why you’re interested in this role.\n\n### You Are:\n- Support driven. You have a passion for problem-solving and enjoy being challenged. Helping others comes naturally to you.\n- Perceptive and empathetic. You proactively anticipate customer needs. You can adapt your tone and approach to fit a diverse range of customer personalities and situations.\n- Honest and authentic. You’re comfortable being yourself and genuinely enjoy connecting with others. You express yourself openly and respectfully, and function well as part of a team.\n- Reliable and accountable. You’re consistent, dependable, and adhere to a set work schedule.\n- You take ownership over the quality of your work and make an effort to improve.\n- Innovative. You're a creative thinker who can offer solutions to the trickiest conundrums. You bring compelling ideas to the table in an effort to catalyze positive change.\n\n### Responsibilities:\n- Respond to customer emails in a professional, friendly, and timely manner to enhance our members’ knowledge of ipsy and create a positive experience for them\n- Manage sensitive issues while maintaining the highest level of professionalism; provide thoughtful, prompt resolutions with empathy and poise\n- Recommend solutions to complex or escalated situations through research and critical thinking\n- Share relevant, strategic insights with our product, marketing, and technology teams regarding overall customer experience and service-related trends\n- Strive to exceed volume and quality goals\n- Help with additional projects as needed\n\n### Qualifications:\n- Bachelor degree or equivalent experience\n- 1-3 years in customer-centric industry\n- Strong computer and typing skills, very comfortable with web-based applications and navigation between tools\n- Exceptional written communication skills with keen attention to detail\n- Entrepreneurial spirit with ability to manage workflow efficiently\n- Willing to work one weekend shift per week\n- Experience providing customer support via social media is a plus","publish_date":"2016-07-19"},{"feature":"true","link":"jobs/ipsy-social.html","location":"San Mateo, CA","published":"Jul 19","id":3,"title":"ipsy Customer Care Representative - Social Media","body":"\nipsy is committed to providing excellent service to our community. We’re seeking someone with a passion for helping others, who can actively suggest initiatives that will delight our membership. This role is responsible for providing customer support through our various social media channels (Facebook, Instagram, Twitter, Pinterest, and YouTube). It will involve managing sensitive customer escalations, researching and proposing creative solutions, and building rapport with our active community.\n\nCOVER LETTER REQUIRED – Please tell us about yourself and why you’re interested in this role.\n\n### You Are:\n- Passionate about providing excellent support. You enjoy tackling a challenge head on and never shy away from an opportunity to learn and grow. You love social media and understand the importance of brand consistency.\n- Empathetic and perceptive. You can identify the tone of a customer and adjust your approach accordingly. You are proactive and always anticipate customer needs.\n- Authentic and honest. You’re not afraid to be yourself, and you have a desire to connect with others in a genuine way. You communicate openly and respectfully with teammates.\n- Reliable and accountable. You can adhere to a consistent work schedule. You accept ownership over the quality of your work, and take initiative to keep improving.\n- Creative. You’re an innovator who can think of solutions to the trickiest conundrums. You bring compelling ideas to the table in an effort to catalyze positive change.\n\n### Responsibilities:\n- Respond to comments made on our social channels in a timely, friendly, and professional manner to educate and create positive connections with our community.\n- Identify sensitive issues and potential escalations, and relay to appropriate teams ensuring that all members are helped in a quick and thorough manner.\n- Maintain the highest level of professionalism while managing sensitive issues. Demonstrate empathy while providing thoughtful and prompt resolutions.\n- Research complex and escalated situations and recommend solutions.\n- Provide thoughtful, strategic insight regarding customer requests and service-related trends to our product, marketing, and technology teams.\n- Strive to exceed volume and quality goals.\n- Help with side projects as needed.\n- You will be responsible for working our midday or evening shift (10 - 6 or 12 - 8 PM), and one weekend shift per week.\n\n\n### Qualifications:\n- Bachelor degree or equivalent experience.\n- 1-3 years in customer-centric industry, preferably with experience providing customer support via social media.\n- Strong computer and typing skills. Particularly high level of comfort in web-based applications and navigation between tools.\n- Exceptional written communication skills with keen attention to detail.\n- Entrepreneurial spirit with ability to manage workload efficiently.\n- Willing to work one weekend shift per week.","publish_date":"2016-07-19"},{"has_chat":"true","link":"jobs/basecamp.html","location":"Remote -- preferably EST USA","published":"Jul 18","id":4,"title":"Basecamp Customer Support Rep","body":"\nWe’re looking for a super smart support team member! Specifically, we're seeking a native English speaker in the US (preferably EST).\n\nYou’ll be responsible for providing tremendous customer service via email and phone for all versions of Basecamp. You’ll also help us answer questions via Twitter, create and edit help documentation, run personalized demos, and maybe some online classes.\n\nDuring training, you'll be expected to be proactive in your process and learn quickly. Once fully up-to-speed (2-3 months), you'll write about 100 emails per day. This is a significant volume, so be sure that you’re ready and able to deal with that kind of daily load -- you'll get all the love and help you need along the way!\n\nWe’re looking for some great writers who love helping our customers, so you should enjoy making complicated situations simple and painless and have a passion for our products. This means being a great problem solver with the ability to process and resolve issues quickly.\n\nIf you want to join Carrie, Chase, Chris, Elizabeth, James, Jayne, Jim, Joan, Kristin, Merissa, Natalie, Sylvia and Tony in making our customers happy, please apply!\n\n**Please submit a cover letter explaining:**\n\n- Why you want to work in customer support.\n- Why you want to work at Basecamp and not somewhere else.\n- A description of a great customer service/support experience you had recently, and what made it great.\n- A time you taught yourself a new skill to complete a job or project.\n- A guide to making a peanut butter and jelly sandwich. (Seriously.)\n\n**Also, pick three of the questions from customers below and answer them like you would if you worked here:**\n\n- Does the new Basecamp offer time tracking?\n- Is the new Basecamp offered in any other language besides English?\n- I've been a Basecamp user for years and see you have a new version. What's the difference between the versions, and why should I switch?\n- How do I work with clients in the new Basecamp?\n\nWe offer heaps of lovely benefits, a competitive salary, plus a progressive work environment.\n\nWe look forward to hearing from you!\n\n**How to apply:**\n\nEmail everything to <a href=\"mailto:jointheteam@basecamp.com\">jointheteam@basecamp.com</a>. Include “Customer Support,\" your location, and \"Support Driven\" in the subject line. If you’re attaching a resume, please send it as a PDF.","publish_date":"2016-07-18"},{"link":"jobs/livestream.html","location":"New York, NY","published":"Jul 14","id":5,"title":"Livestream Live Video Support Specialist","body":"\n<div id=\"content\" class=\"\">\n      <p><strong>What’s this job?</strong></p>\n<p>Your job is to make the world a better place one support ticket at a time. From our not-so-secret lair in Bushwick you’ll help our producers across the US and even around the world. &nbsp;We’re here to make sure their work gets to their audience.</p>\n<p><strong>What will you do here?</strong></p>\n<ul>\n<li>Answer customer questions and concerns regarding Livestream's hardware products, platform services and anything in between.&nbsp;</li>\n<li>Troubleshoot technical issues, drive the product roadmap and help developers diagnose bugs.</li>\n<li>Be the first point of contact for incoming calls, emails, and online chats.</li>\n<li>Write and update customer facing FAQs and other internal documents.</li>\n<li>Proactively look for ways to improve our service and to better serve our customers.</li>\n</ul>\n<p><strong>Who you are:</strong></p>\n<ul>\n<li><strong>A video or internet guru.</strong>&nbsp;</li>\n<ul>\n<li>We help people stream video over the internet - you should be a master of at least one of those things and excited to learn the other.</li>\n</ul>\n<li><strong>Passionate about connecting with and helping people.</strong></li>\n<ul>\n<li>You love listening, talking, and working with people makes you happy.</li>\n<li>You're patient, sympathetic, and understand how to find that sweet balance between customer service and genuine friendliness.</li>\n</ul>\n<li><strong>An exceptional communicator.</strong></li>\n<ul>\n<li>You treat people kindly and can gracefully break down, solve, and explain, even the most complex problems.</li>\n<li>Bonus: You cringe when you see poor grammar in social media posts.</li>\n</ul>\n<li><strong>Curious.</strong></li>\n<ul>\n<li>You master any area you work in and naturally do more than is asked of you.</li>\n<li>You take initiative and ownership to see things through to completion.</li>\n<li>We won’t micro-manage you. We provide you with lots of wiggle room and you must be hungry to learn and grow with the company.</li>\n</ul>\n<li><strong>A team player. </strong></li>\n<ul>\n<li>You get along with others and know how to keep the mood light.&nbsp;<a href=\"http://media0.giphy.com/media/5r5J4JD9miis/giphy.gif\">Your .gif game is on point!</a></li>\n</ul>\n</ul>\n<p><strong>Required for a callback:</strong></p>\n<ul>\n<li>Bachelor's level education or above.</li>\n<li>Demonstrated job stability - at least 1 year in a professional environment.</li>\n<li>At least 6+ months experience working in a customer service or support role.&nbsp;</li>\n<li>Ability to work a flexible schedule that&nbsp;includes required evening&nbsp;and weekend shifts.</li>\n<li>Solid computer skills - you need to know your way around a Google spreadsheet; blindfolded after spinning on a bat 10 times.</li>\n<li>¿Hablas español? No es necesario. ¡Pero sería genial!</li>\n</ul>\n<p><strong>What are the benefits?</strong></p>\n<ul>\n<li>Full Time Position</li>\n<li>Competitive salary</li>\n<li>Comprehensive health, dental, and vision coverage</li>\n<li>401(k) savings</li>\n<li>Paid holidays</li>\n<li>Commuter Discounts</li>\n<li>Annual company outing and regular celebrations</li>\n<li>Stacks of snacks and caffeine</li>\n<li>Working with awesome people</li>\n</ul>\n<p><strong>&nbsp;</strong></p>\n</div>","publish_date":"2016-07-14"},{"has_chat":"true","link":"jobs/capsule.html","location":"UK/Remote","published":"Jul 13","id":6,"title":"Capsule Customer Support","body":"\nSince 2009 we’ve been making it easy for business to take care of their customers and sales opportunities. Capsule is now one of the most popular CRM’s for small business and sales teams.\n\nWe’re expanding our support team and looking for someone who loves helping people out. Troubleshooting and communication will be a big part of your job and you’ll be comfortable using email & twitter to keep our customers happy. You’ll also spend some time working with our development and design teams to share customer feedback and test new features.\n\nWe’re a UK based company with an office in central Manchester. We’re open to remote working if you’re outside of Manchester, but you need to be in the UK for this position. You’ll be joining a small, dedicated & friendly team that cares deeply about the customer experience. We offer a start-up style culture with a competitive salary and benefits.\n\n### What we’re looking for:\n- You have experience helping customers through a previous marketing or support-related position\n- You’re tech savvy with an interest in web and mobile apps\n- You’ll be a great writer with a positive style and enjoy describing solutions simply\n- You’re able to read between the lines when necessary and minimise emails back-and-forth to get to a solution quickly\n- You’re self motivated and confident working independently but you also know your limits and when to seek direction\n- You’re a pro at minimising disruptions whether working remotely or in the office and can get through a high volume of emails each day\n\n### A typical week involves:\n- Helping people get the most out of Capsule by responding to emails and tweets\n- Troubleshooting and detailing issues for our developers to resolve\n- Sharing customer feedback with the design and development team\n- Creating and updating helpful online support guides\n- You’ll also spend some time contributing to scaling and improving our internal support practices\n\n### We offer very competitive salaries and benefits\n- Flexible working hours\n- 25 days paid annual leave in addition to the stat holidays\n- Private medical, dental and optical insurance\n- Pension scheme with generous matched contributions\n- Casual dress environment\n- The best kit for the job (which usually means lots of Apple gear)\n- Monthly eBook allowance with your choice of iPad Mini or Kindle\n- Mobile phone (e.g. Android or iPhone)\n- Conference allowance\n\n### How to apply:\nIf this excites you and your experience and strengths match what we’re looking for <a href=\"mailto:jointheteam@capsulecrm.com\">send us an email</a> introducing yourself.","publish_date":"2016-07-13"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Jul 5","id":7,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2016-07-05"}]