[{"link":"jobs/digitalocean.html","location":"NYC-HQ, Remote","published":"Jan 18","id":1,"title":"Digital Ocean Customer Success Engineer","body":"\n<p><span style=\"font-weight: 400;\">DigitalOcean is a simple cloud hosting built for developers, by developers. We make it easy for users to launch and manage their web infrastructure, and we love doing it. As a Customer Success Engineer at DigitalOcean, you’re responsible for ensuring our top customers have the best experience possible. This is a challenging and rewarding role in which you’ll be supporting our biggest customers to troubleshoot issues, scale applications and grow both our customer’s and DigitalOcean’s business.</span></p>\n<p><span style=\"font-weight: 400;\">Customer Success is an integral part of our company and we’re looking for creative problem-solvers who are eager to help our customers. We’re looking for candidates who are passionate about the technologies we use, and have extensive experience working with open-source and Linux environments. As the voice of the customer you have the opportunity to influence product decisions while helping to build the next great cloud company!</span></p>\n<p><span style=\"font-weight: 400;\">This is a full-time position based at our New York City HQ or working remotely. If you do wish to work remotely, we ask that you are available to come onsite periodically for team building activities.&nbsp;</span></p>\n<h2>What You Will Be Doing:</h2>\n<ul>\n<li>Respond to technical and product questions generated by our customers through tickets, emails, or phone calls</li>\n<li>Troubleshoot Linux (Ubuntu and CentOS), Apache, Nginx, MySQL, Rails/Unicorn, and PHP</li>\n<li>Quickly learn DigitalOcean systems and adapt to rapid changes</li>\n<li>Work both collaboratively and independently within a team setting (we love Slack!)</li>\n<li>Identify and communicate process improvement suggestions</li>\n<li>Incident management and escalations</li>\n<li>Help combat fraud and abuse on the platform</li>\n<li>Collaborate with other teams and departments to improve the customer's experience</li>\n<li><strong><span style=\"font-weight: 400;\">Help architect HA solutions for fast-growing and new customers</span></strong></li>\n</ul>\n<h2>What We'll Expect From You:</h2>\n<ul>\n<li>Strong background with technology and Linux systems</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Passionate about technology and customer support</li>\n<li>Strong identity with our brand and team culture</li>\n<li>Strong analytical skills and pattern recognition</li>\n<li>Prior experience in similar environments in Customer Success, Solutions Architecture type roles is a big plus.</li>\n<li>Strong communication skills, with ability to explain technical concepts in clear and concise terms</li>\n<li>A desire to get the best out of everyone on their team with the ability to balance the demands of multiple constituencies, defining priorities and setting appropriate expectations.</li>\n<li>Startup experience a big plus</li>\n</ul>\n<h2>Extra Credit:</h2>\n<ul>\n<li>Programing/Scripting: Ruby, Python, Go, Bash</li>\n<li>Source Code: GitAutomation: Chef, Puppet</li>\n<li>Virtualization: KVM, Xen</li>\n<li>Open Source: CoreOS, Docker, Vagrant</li>\n<li>Willingness to work in non-traditional business hours (nights and/or weekends)</li>\n</ul>\n<h2>Working at DigitalOcean:</h2>\n<ul>\n<li>Competitive compensation including a 401k with up to 4% employer match</li>\n<li>Stock options</li>\n<li>DigitalOcean&nbsp;offers competitive health, dental, and vision benefits for both employees and their dependents</li>\n<li>Corporate Seamless account to keep your hunger at bay</li>\n<li>Monthly commuter expense (for local workers) and gym membership allowance</li>\n<li>Monthly Internet expense for remote workers</li>\n<li>Great office space located in the heart of SoHo</li>\n</ul>\n<p class=\"p1\"><span class=\"s1\">We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</span></p>"},{"link":"jobs/fleetio.html","location":"Birmingham, AL / Remote","published":"Jan 13","id":2,"title":"Fleetio Customer Experience Rep","body":"\n<p>As a Customer Experience Rep for <a href=\"https://www.fleetio.com/\">Fleetio</a>, your job is to support our customers and enable their success. This is a demanding but rewarding role that requires a broad skill set. You’ll be directly responsible for keeping Fleetio’s&nbsp;customers happy and productive. You will also work with the product teams to test new features and provide feedback based on customer conversations.</p>\n<p>Companies around the world rely on Fleetio to manage their fleet operations. Your job is to ensure that Fleetio’s customers have the best customer service experience possible.</p>\n<p>We take customer service seriously. This is a position we consider essential to the company’s success. Be sure to mention coffee in your cover letter so we know you actually read this.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Handle inbound customer requests via email and phone (90% email, 10% phone)</li>\n<li>Quickly resolve customer inquiries with helpful, personalized responses</li>\n<li>Identify, reproduce and document bugs for the product teams</li>\n<li>Assist the product teams by testing new features and bug fixes</li>\n<li>Spot trends in customer issues and communicate to product teams</li>\n<li>Write documentation and contribute content to our <a href=\"http://help.fleetio.com/\">Help Center</a></li>\n<li>Create screencasts (video tutorials) for specific features and functionality</li>\n<li>Monitor and report on support metrics and KPIs and suggest improvements</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Ability to work 8am – 5pm, CT, Monday through Friday</li>\n<li>Genuine empathy for customers, and desire to make them feel happy and understood</li>\n<li>Passion for exceptional customer service and appreciation for its role in a company’s success</li>\n<li>Excellent writing and communication skills</li>\n<li>Resourceful and determined, yet not afraid to ask for help</li>\n<li>Natural troubleshooting skills</li>\n<li>Serious attention to detail</li>\n<li>Excited by technology and its ability to make you more productive</li>\n<li>Prior experience doing email-centric customer support for a web application is highly desirable</li>\n<li>College degree or equivalent professional experience preferred</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>100% coverage of health and dental insurance</li>\n<li>401(k)</li>\n<li>Competitive salary and meaningful equity</li>\n<li>Open PTO policy</li>\n<li>Mac laptop and whatever tools you need</li>\n</ul>"},{"link":"jobs/peekpro.html","location":"Salt Lake City, UT","published":"Jan 15","id":3,"title":"Peek Partner Support Representative","body":"\nPeek is looking for a passionate and driven Partner Support Representative to help our activity operator partners grow their businesses through Peek’s “Peek Pro” SaaS reservation and business management platform. The ideal candidate adapts well to a fast-paced environment, provides a high degree of service and responsiveness to our existing and potential partners, and demonstrates flexibility and a calm demeanor as company needs and priorities evolve. This is a full-time position.\n\n### Responsibilities:\n- Provide product and technical support to our operator partners \n- Gather data and feedback from partners, make observations about their needs, and influence product and process development at a rapidly growing start-up \n- Represent the voice of our partners internally as we make critical decisions about developingthe features and usability of our products  \n- Collaborate with different Peek functional teams such as Sales, Production and Product/Engineering to ensure partners are successful on our platform \n\n### Requirements:\n- BA/BS degree\n- Willing to work one or both weekend (Sat or Sun) days\n- Natural enthusiasm for helping people solve problems \n- Spanish fluency strongly preferred\n- 1-2 years of experience in account management, customer service, technical support or client relations\n- Experience with SalesForce and/or Desk preferred \n- Tech and web-savvy critical \n- Patient and able to teach new software to non-tech savvy operator partners \n- A self-starter eager to exceed objectives and take on more responsibility \n- Excellent written, oral and interpersonal communication skills \n- Able to work in a dynamic, face paced environment without skipping a beat \n- Process-oriented, enjoys coordinating work between multiple parties and ensuring everyone contributes effectively and gets what they need \n- Demonstrates common sense and able to troubleshoot and make sound decisions when faced with emergencies \n- Must be punctual and reliable \n- A passion for travel! "},{"link":"jobs/supercell.html","location":"Helsinki, Finland","published":"Jan 11","id":4,"title":"Supercell Player Support Specialist","body":"\n<p>Want to work in one of the most disruptive Customer Support organizations on the planet? Then maybe it’s time for you to get ready for the north and join us here in our HQ in Helsinki, Finland.</p>\n<p>We are looking for a Player Support Specialist to reinforce our multicultural team. The person we are looking for is a gamer with a strong background in customer support and a unicorn-like personality who wants to push the boundaries of support for mobile games and beyond.</p>\n<p>You are self-driven and hands-on? You can take decisions on a day-to-day basis independently? You don’t mind getting your hands dirty and address our players on individual level? Great, we have a team structure with minimal hierarchy and no red tape where the only limits to what’s achievable are set by your imagination. If you want to make a difference for millions of players around the globe every single day, this might be the right place for you.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Become an expert at Supercell games and our internal tools</li>\n<li>Be a point-of-contact for escalations, content questions and ad-hoc decisions and requests for our local outsourcing partners and our other offices</li>\n<li>Use data to support the development of processes and policies</li>\n<li>Support the internal live game liaisons with their day-to-day requests</li>\n<li>Apply your knowledge to current and new Player Support projects</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Excellent verbal and written English skills</li>\n<li>Previous experience (2–3 years) in a customer support role</li>\n<li>Team player with strong problem solving and conflict management skills</li>\n<li>Empathic and culturally aware</li>\n<li>Passion for video games and mobile applications</li>\n<li>Ability to travel frequently (other Supercell offices and partners)</li>\n</ul>\n<h3>Nice to Haves</h3>\n<ul>\n<li>Fluent in French, Italian, German, Spanish, Portuguese, Japanese, Chinese, Korean, Turkish, Arabic, Dutch, Russian, Finnish or Klingon</li>\n<li>Passion for one or multiple Supercell games Experience working in multicultural environments</li>\n</ul>\n<h3>Supercell Offers</h3>\n<ul>\n<li>A first-row view into one of the most successful game companies in the world</li>\n<li>Opportunity to work with a team of gaming veterans, top talent, and passionate gamers</li>\n<li>Easy-going, enthusiastic, open and at the same time a very results-driven culture</li>\n<li>Competitive compensation</li>\n<li>Smartphone, tablet, laptop/workstation of your own choice</li>\n<li>Industry leading benefits</li>\n<li>Amazing co-workers</li>\n</ul>"},{"link":"jobs/zapier.html","location":"Anywhere you want","published":"Jan 15","id":5,"title":"Zapier Customer Champion","body":"\n<p>Hi there!</p>\n<p>We're looking for someone who loves helping people. If you love interacting with people on a daily basis to help them learn how to optimize their work then read on&hellip;</p>\n<h2>About You</h2>\n<p>You're empathetic to users and can easily put yourself in their shoes. You realize that not everyone has the same skill set and that smart people sometimes make mistakes. You make customers feel empowered after interacting with support and not stupid because of a small mistake.</p>\n<p>You obsess over the details. Maybe you have a one emoticon and one exclamation point rule of thumb for every email. Maybe it's only two sentences per paragraph. Either way, you make sure each word and each punctuation mark makes the customer delighted to work with you.</p>\n<p>You love solving problems. Every customer is different, many times radically so. You relish being able to meet their specific need, and also solving their problems that may have gone unsaid.</p>\n<p>You love to write. Almost everything at Zapier is done via written communication (both with customers and between teammates).</p>\n<p>You're persistent. Support at Zapier is much different than at many software companies. It's not the same questions over and over again, and often involves researching technical nuances of the apps we support. You love the opportunity to solve new problems every day and won't give up when you don't know the answer right away.</p>\n<p>You love doing things efficiently. At Zapier, the work you do will have a disproportionate impact on the business. We believe in systems and processes that let us scale our impact to be larger than ourselves.</p>\n<p>You love to set your own course. At Zapier, we have quick team meetings each week and one-on-one meetings every month and then we go make things happen. You get to make things happen without someone saying so.</p>\n<h2>Things You Might Do</h2>\n<p>Zapier is a startup, so you'll likely get your hands dirty in a little bit of everything. That said, here are some things you'll get to lead:</p>\n<ul>\n<li>Help customers via email or chat to ensure they have the best experience possible (teammates tend to send 60+ emails every day), troubleshooting their problems and answering their questions.</li>\n<li>Write documentation to help users help themselves (all the documentation on our help site is written and maintained by the support team: https://zapier.com/help/)</li>\n<li>Work with the product team to build tools that will speed up and increase the quality of support at the same time</li>\n<li>Experiment: this is a startup so everything can change</li>\n</ul>\n<h2>About Zapier</h2>\n<p>For the past three years, Zapier has been helping people across the world automate the boring and tedious parts of their job. We do that by helping everyone connect the web applications they already use.</p>\n<p>We believe that there are jobs that a computer is best at doing and that there are jobs that a human is best at doing. We want to empower businesses everywhere to create processes and systems that let computers do what they are best at doing and let humans do what they are best at doing.</p>\n<p>We believe that with the right tools, you can have 10X the impact with less work.</p>\n<p>We believe in small teams. Small teams are fast and nimble. Small teams mean less bureaucracy and less management and more getting things done. </p>\n<h2>The Whole Package</h2>\n<p>Location: Anywhere you want.</p>\n<p>If you want to work remote, that's cool. If you want to work near others, that's cool too. The current support team is in Washington, Virginia, Florida, Connecticut, Wisconsin, Texas, Australia, and Spain.</p>\n<p>Compensation:</p>\n<ul>\n<li>Based on experience</li>\n<li>Great healthcare + dental + vision coverage</li>\n<li>401k retirement plan with 4% company match</li>\n<li>Profit sharing</li>\n<li>2-3 annual company retreats to awesome places</li>\n</ul>\n<p>Pick your own equipment. We'll set you up with whatever laptop + monitor combo you want plus any software you need. </p>\n<p>Unlimited vacation policy (plus we insist you take at least 2 weeks off each year - this isn't a vague policy where unlimited vacation means no vacation). </p>\n<p>Work with awesome companies around the world. We partner with the best software companies in the world and you'll constantly get to <a href=\"https://zapier.com/zapbook\">interact with people from these great companies</a>.</p>\n<p>Set your own destiny.</p>\n<h2>How to Apply</h2>\n<p>Applying is simple.</p>\n<ul>\n<li>Send an email to supportjobs@zapier.com</li>\n<li>Tell us about yourself</li>\n<li>Tell us why you want to work at Zapier vs. somewhere else.</li>\n</ul>\n<p>Then answer these 6 questions:</p>\n<ol>\n<li>What should our goal be when replying to users?</li>\n<li>A user requests an integration with a service that we don't support yet. How would you word your response?</li>\n<li>Set up a zap that takes new Gmail emails from a specific sender and adds them to a Google Sheets spreadsheet.  Send us the link to the zap and a share link for the spreadsheet.</li>\n<li>Send us a link to an app's API docs that you think are well done, and explain why you think they are good.</li>\n<li>Look at <a href=\"https://gist.github.com/WadeFoster/0bd294efe54f8fb8a1e7\">this list</a> and pick the 5 things that most excite you. Also pick the 5 things that least excite you. Don't pick by your opinion of importance, this is mostly to see interest/experience. Please put this answer somewhere like <a href=\"https://gist.github.com\">Gists</a> or <a href=\"http://pastebin.com\">Pastebin</a> and include a link in your email.</li>\n<li>How did you hear about Zapier?</li>\n</ol>\n<p><em>All teammates at Zapier also agree to a <a href=\"https://zapier.com/jobs/zapier-code-of-conduct/\">code of conduct</a> that keeps Zapier a safe, welcoming and inclusive environment.</em></p>"}]