[{"link":"jobs/fcr.html","location":"Great Falls, Montana","published":"May 18","id":1,"title":"FCR Site Director","body":"\n### What you will receive:\n- Great work atmosphere\n- Fast-paced, dynamic, fun\n- Supportive leadership\n- Financially strong and growing company\n- Opportunities for growth and advancement\n- A company that truly cares about its Employees and Clients\n\n### What we are looking for:\n- Call Center Operations Experience & Expertise\n- Strong Leadership Skills: Able to bring out the best in people\n- Client Focused\n- Effective Director\n- Ability to think on your feet and move fast\n\n### Reports directly to the VP of Operations:\n- Maintains constant communication of floor needs, wants, concerns and plans to all stakeholders.\n- Works with Program Managers to assure client needs and company needs are in balance. Negotiates differences with the client to assure satisfaction for both stakeholders.\n- Is on call and available during all hours to address client and operational needs – is the primary point of contact for all emergency situations.\n- Attends weekly meetings to discuss current trends, quality, upcoming events, project planning, and current project status.\n- Proactively communicates new ideas and wins to the client and to all levels within the organization.\n- Directs important client milestones/needs with the leadership team to assure timely compliance.\n- Consistently tracks project KPIs and identifies key drivers affecting the project – implements action items based on key drivers. Reports findings and action items to the client.\n- Tracks both internal and external quality scores – identifies quality trends and suggests action items to the Director of Call Center Services.\n- Creates and presents presentations on project status, planning, wins, and challenges.\n- Is responsible for managing a team of leads/supervisors.\n- Holds weekly One-on-One meetings to discuss team performance and career goals.\n- Trains and mentors to ensure success in the Program Manager position.\n- Provides coaching and feedback on performance.\n- Reviews all employee documentation to ensure consistency.\n- Is responsible for hiring and terminations.\n- Oversees and manages new hire training.\n- Works with the VP Operations to consistently manage project profitability.\n- Organizes consistent client visits to the center.\n- Manages regular visits to the client’s location.\n\n### Required Experience:\n- Competent in providing effective leadership to a large team\n- Capable to train and mentor individuals and/or a group\n- Skill at interacting at a high level with clients and internal leadership\n- Ability to manage and provide feedback to all types of individuals\n- Adaptable to an ever-changing environment\n- Faculty to create training documents\n- Robust verbal and written communication\n- Resilient organizational skills\n- Strong analytical skills\n- Proficient in multi-tasking\n- Ability to follow direction without close supervision\n- Flexibility with scheduling\n- Practiced with Microsoft Office (Word, Excel, PowerPoint, Outlook)\n- Ability to pass a background check\n- At minimum 3 to 5 years of call center management experience\n- Managing up to 200 agents preferred","publish_date":"2017-05-18"},{"link":"jobs/follow-up-boss.html","location":"Remote","published":"May 11","id":2,"title":"Follow Up Boss Customer Support Champion","body":"\nIf you have a passion for making your customers happy, you really should check us out! We are a truly customer-centric company serious about doing everything we can for our clients. You’re not going to find red tape or a lot of pointless meetings - everyone from the co-founders to the dev team prioritizes the customer experience above all else. Our customers love us, and we love them.\n\nFollow Up Boss is changing the way small businesses manage their customers and leads through a simple, powerful SaaS product which focuses on features that people need most, not pointless bloat. We are a small, profitable, 6-year-old company with a global team (mostly in the USA).\n\nCheck out our client reviews at https://www.facebook.com/followupboss/reviews\n\nWe’re looking for a Customer Support Champion to join our team to cover support 8 - 5pm PST Mon - Fri.\n\n### Your responsibilities will include: \n- Answering incoming phone calls from customers to offer support\n- Answering support tickets to help customers and free trials (we use Help Scout)\n- On-boarding and setting up new accounts and winning them over from the get-go.\n- Monitoring accounts to ensure that our customers are thrilled, and looking out for (and addressing) warning signs of churn.\n- Advocating customers’ requests and needs across the entire company (we use Basecamp)\n- Educating about newly released features and functionality.\n- Contributing to our knowledge-base (help.followupboss.com)\n- Owning the relationship with key accounts, conducting regular check-ins, and creating and nurturing a rapport as their trusted advisor.\n\n### Your qualifications should include:\n- Prior experience in a customer-facing role (Support, Success, Account Management, or Sales).\n- Superb written and verbal skills (with a professional yet fun demeanor).\n- Understanding! The ability to determine Root Cause / Six Sigma / 5 Why’s - whatever you want to call it, you have a great analytical prowess with determining what people really need (not just what they think they need) and where the real root of a problem lies.\n- Patience! Many of our customers are not super-comfortable with technology.\n- Based in the USA, quiet home office with fast internet.\n- And above all, Empathy! - you must really enjoy people and care about helping them be successful.\n\n### Perks:\n- Competitive salary\n- Trips to conferences and company meet-ups.\n- Take time off when you need it (we expect you take at least 4 weeks off per year)\n- Your choice of new laptop\n- Health and Dental Insurance\n- Other monthly perks like Starbucks, WholeFoods, Uber, Movie Tickets, and Dashlocker","publish_date":"2017-05-11"},{"link":"jobs/omni.html","location":"Seattle, WA","published":"May 4","id":3,"title":"The Omni Group Phone Support Human","body":"\nThe Omni Group is growing our band of Support Humans (also known as our Tech Support team). Our search is for coworkers who are great at cheerfully helping customers with our macOS and iOS products on the phone, as well as via email, Twitter, and on our forums. Support Humans work together as a team and with customers to answer questions, solve problems, and (whenever possible) have surprisingly pleasant conversations about software.\n\nWe look for hires with positivity, great phone skills, and who are good at thinking through problems on a computer they can’t actually see. We don’t rely on binders of troubleshooting scripts; your imagination will be one of your most important tools.\n\n### Job Activities\nWhen customers call with questions about our Mac & iOS apps, you’re their first contact. Know the answer? Great! If not, gather information and we’ll help you find it. (You should enjoy learning about technology; even if you know a lot, you’re going to learn more here.)\n\nWhen it comes to inventing great software, we believe being friendly is at least as important as being smart. If you need help with a problem, you’ll have plenty of people to ask - and they’ll be happy to talk about it. When we disagree, we do it respectfully. No one furthers themselves by tearing you down.\n\n### Compensation and Benefits\nOur amazing customers love our apps and push them to their limits. If earning gratitude by helping them brings you happiness, you’ll enjoy this job. We depend on Support Humans when crafting our products; they speak for and represent our customers’ needs.\n\nWe offer a base salary in the mid-$40k/year range, a 401k with matching, incredible insurance for you and your family, and the potential for profit sharing. We are an equal opportunity employer. We know our industry has a diversity problem; we’re trying to be part of the solution.\n\nWe also offer lots of other great benefits, which you can read about elsewhere on our website. Please see the full job posting and instructions for applying at https://www.omnigroup.com/jobs/.\n\n### To Apply\nTo apply, send email to <a href=\"mailto:resumes@omnigroup.com>resumes@omnigroup.com</a>; include the exact phrase “Phone Support Human” in the subject line. Include a copy of your résumé in text, HTML, RTF or PDF form. Please note: if you submit a Word document, you will not be considered for the position. No phone calls or visits to the office, please. Every applicant that sends a resume before May 15th will receive a set of sample support questions to work on; applicants will have until May 22nd to submit responses. Those answers are by far the most important factor we’ll use when selecting applicants to invite in for interviews.","publish_date":"2017-05-04"},{"link":"jobs/skyverge.html","location":"Anywhere","published":"May 3","id":4,"title":"SkyVerge Customer Support Specialist","body":"\nHiya. We’re SkyVerge and we love eCommerce. Our products help merchants manage and grow their online stores, all the way from boutique corner shop to Fortune 500 retailers. We’re looking for two Customer Support Specialists to join our fully-distributed team and help support our entire suite of products.\n\n### The Role\nYou’ll be the first point of contact for our customers, helping them with problems, and answering questions. As part of a small team, you'll likely get your hands dirty with a little bit of everything.\n\nHere are some things you may do on a given day:\n\n- Assist customers by troubleshooting technical problems and escalating to the engineering team as needed\n- Answer pre-sales questions, billing & account changes, and other feedback from customers\n- Monitor social media and forums where customers may have questions or issues with our products and get them the help they need\n- Help with customer onboarding by installing and modifying code on customers’ stores\n- Write technical documentation and other content so customer’s can help themselves\n- Help our engineering & product teams to identify areas where we can improve the customer experience\n- Document and optimize our support process to improve customer satisfaction\n\nWith over 70 products across the three eCommerce platforms (Shopify, WooCommerce, Easy Digital Downloads) that we support, there's plenty to learn. You’ll be expected to own the support queue for a set of products for a week before rotating to another set. We’re aiming for you to have broad knowledge (mile-wide, inch-deep) and work closely with the product & engineering team to tackle more technical or in-depth questions that go beyond your knowledge.\n\n### You\nYou have that unique combination of technical aptitude and empathy for the user. You’re comfortable with code but prefer to be customer-facing. You’re self-driven with a sense of urgency and draw satisfaction from going above and beyond to provide solutions. You’re an excellent communicator and have the ability to thrive in a distributed environment. Perhaps most importantly, you have a willingness to learn.\n\nTo succeed in this position, you will have:\n\n- solid understanding of HTML / CSS\n- Working knowledge of JavaScript\n- Native-level fluency in English (Are you fluent in other languages? Tell us! We love being able to support customers in their native language.)\n- Outstanding written communication and interpersonal skills\n- Boundless curiosity for our products and our customers\n- Ability to thrive in a remote environment (along with a reliable internet connection)\n\nIt’s helpful if you have:\n\n- Experience with PHP / Ruby (or other programming languages)\n- Experience with WordPress\n- Experience with Shopify / WooCommerce (or other eCommerce platforms)\n- Experience supporting SaaS products\n- Experience supporting downloadable software (especially in the LAMP stack)\n\nOur team is fully-remote and we communicate primarily through Slack, GitHub, and weekly stand-ups on Monday via Zoom (a few short meetings on Monday) — we believe the best work happens when given lots of uninterrupted time that’s free of distractions.\n\nAs a remote team, we believe that regular meet-ups are invaluable for getting to know each other better, so you should be available for 1-2 company-paid team trips per year. Curious about these trips? Check out our recap of our last team retreat (SkyTrip) to get an idea of what they’re like.\n\nThis is a full-time, salaried position, but hours are flexible. We know your work will speak for itself with thoughtful replies to customers, wiki edits, and published documentation.\n\n### Process\nQualified candidates will get an email with a few questions to answer via email. Following that, you’ll have a few 30 minute phone chats with different people on our team to learn more about you and answer any questions you have about the position and company.\n\nIf this goes well, we’ll invite you to join our team and start your 30-day Bootcamp. This is a trial period where you’ll work full-time as a contractor, or part-time on nights/weekends if you already have a full-time position. This gives you an opportunity to make sure you enjoy the work and the team, and it gives us an opportunity to evaluate your work. We’ll have regular chats each week to share feedback and make sure we’re on the same page. At the end of the 30 days, you’ll be offered a permanent position 🙂\n\n### Benefits\n\nHere are some benefits we're excited to offer to our team members:\n\n- Competitive salary\n- Annual incentive for meeting team and company goals\n- 25 days of paid time-off, in addition to 2 company holidays (SkyVerge Day in March, Founders Day in June 😀)\n- Medical, Dental, and Vision insurance for US and Canadian residents and their families (reimbursements for comparable care for non-US/Canadian residents)\n- 401k/RRSP Retirement plan with 4% company match for US/Canadian residents (contributions to comparable plans for non-US/Canadian residents)\n- Work from anywhere that has a reliable internet connection\n- The tools (hardware/software) you need to be productive\n- Allowance for professional growth (books, courses, conferences)\n- Home office or co-working allowance\n- A Kindle to help you keep learning\n\nWe support workplace diversity and do not discriminate on any protected class. We believe when we work together as a team of different views, experiences, and ideas, we can build amazing things.","publish_date":"2017-05-03"},{"link":"jobs/raven-tools.html","location":"Nashville, TN","published":"Apr 25","id":5,"title":"Raven Tools Customer Success Advocate","body":"\n\n\nRaven's Customer Success team isn't just the primary point of contact for Raven Tools customers — we're their voice to the rest of the company. As a Customer Success Advocate, you will play a critical role in our customers' overall experience of using Raven. When they have questions, bug reports, feature requests or general feedback, you're on the frontline to lend a hand. But, more than that, you're empowered to think strategically and work creatively in your day-to-day work. Whether that's recording how-to videos, writing blog posts and documentation, or perfecting the art of the animated GIF, you'll have the latitude to make improvements wherever you see opportunities.\n\nSuccess in this role is heavily dependent on:\n\nRelationships: the ability to build strong relationships centered on empathy for others and a strong sense of customer service. Putting yourself in the customer's shoes, you think ahead to answer their next question before it's asked.\n\nStrategic problem solving: working smart, not hard, to improve our customer's experience of using Raven and contacting our team, as well as to improve our own internal procedures.\n\nA growth mindset: you may not be an expert now, but you're excited to learn and broaden your skills on the job. You have the self-awareness to ask for help and feedback. The ideal candidate for this job role sees themselves as a lifelong learner.\n\n### Responsibilities\n- Communicate one-on-one with Raven customers through Zendesk, answering their questions and troubleshooting issues\n- Collaborate with our development team on resolving bugs in the software\n- Create content to improve our customers' experience: technical documentation, blog posts, videos, and more\n- Act as the voice of our customers for product decisions and development\n\n### Requirements\n- Must live in or around Nashville, Tennessee.\n- Strong writing skills and an impeccable attention to detail\n- Bachelor's degree or equivalent\n- Familiarity with Raven Tools is a huge bonus, but not required\n\n### Benefits\n- Competitive salary\n- Generous paid vacation\n- Full medical and dental coverage\n- Opportunities for professional development\n\n### About Raven\nRaven is a software company dedicated to making the lives of digital marketers easier and more efficient. We provide two products: a website analysis tool called Site Auditor and the all-in-one marketing reporting platform Raven Tools. Raven runs more than 30,000 reports per month, pulling together data from Google, Bing, Facebook, Twitter, and more than two dozen other data sources into a single, easy to customize package. Raven is proudly based out of Nashville, Tennessee on historic Cannery Row.\n\n### To Apply \nPlease send your resume and cover letter to <a href=\"mailto:lance@raventools.com\">lance@raventools.com.</a>","publish_date":"2017-04-25"},{"feature":"true","link":"jobs/issuu.html","location":"Palo Alto, CA","published":"Apr 24","id":6,"title":"Issuu Head of Customer Success","body":"\nissuu is the world's fastest-growing digital publishing platform. We are looking for a new leader to join our fantastic team and take our support function to the next level. With great people, unique ideas and stunning technology, we're changing the future of publishing today. Are you the best at what you do? Join us!\n\n### Support at issuu\nissuu’s customer support team helps our customers get the most out of issuu. We help bridge the gap between what the customer situation is and how the product is able to help them. It’s the job of the customer support team to help our customers achieve their goals using issuu. It’s support’s job to help issuu to continue to be the best digital publishing platform in the world by ensuring that the customers’ stories are at the forefront of our work.\n\nThe customer support team feeds into our core objectives by helping to create customer loyalty and community. We ensure that the customer is getting the most out of the product and the publishers are on the right price plan.\n\n### About the Job\n\nAs the leader of the team, you need to be a passionate customer advocate and a great storyteller. Our support team is customer-driven and data-informed, so you need to be equally comfortable with numbers and words.\n\nThis job is for a doer. You’re expected to be able to set up processes and select tools, to formulate, document, implement and communicate policies, to establish metrics and build dashboards, to identify opportunities and execute on them. You’ve done it before and you’re excited for the opportunity to build and lead the support for a broad consumer and business base.\n\nYou also know that support is a team effort, so training and mentorship are integral to this role. You'll be expected to get your hands dirty and to lead by example by managing customer inquiries and writing help articles, but you will also be leveling up our support teams as an amplifier.\n\nYour work will not be limited to your direct team: issuu support works intimately with our marketing, sales, engineering, product, and business intelligence teams on a daily basis. You will serve as a voice and representative of the customer.\n\nThe office is conveniently located next to the Palo Alto Caltrain station. We provide catered lunches, regular outings and monthly passes for public transit. Our support team is located in Palo Alto and Copenhagen, so you’ll need to be able to travel from time to time.\n\n### Responsibilities\n\nLead the support efforts at issuu. This work consists of:\n\n- Handling support tickets.\n- Developing support procedures.\n- Defining and performing processes.\n- Writing and reviewing help center articles.\n\nWork with our VP of product to manage the US and European support teams. This work consists of:\n\n- Mentoring and growing the individuals on your team.\n- Ensuring quality control.\n- Conducting status reviews.\n- Continuing and improving support quality, per our organization KPIs.\n- Contribute to and help build the future of issuu support. This will involve:\n- Working with our org to create new processes to scale support quality.\n- Working with our product team to shape premium support packages.\n- Working within your team and the product and engineering teams to improve our internal tools.\n- Interface with other teams throughout issuu, including our marketing, sales, product, and engineering groups.\n\n### Minimum Qualifications\n- You should have experience in training support team members, and the ability to connect with all types of learning and working styles.\n- You're a self starter. You're willing to dive into projects and get things done, but in a way that doesn't alienate your team.\n- You have 3 or more years in a support environment for a technical company with 1 or more years in a management capacity. Or 3 years in a product management role dealing with customers.\n- You’re highly organized. Your team can count on you across timezones.\n- You have excellent English written language skills.\n- You have the diplomacy required to interface with every team in issuu.\n- You have a proven track record of highly-professional, yet highly-personalized customer service and interaction.\n- You have opinions on the state of customer support in our industry, and you have ideas on how to raise the bar.\n\n### Preferred Qualifications\n- Experience working with geographically dispersed teams.\n- Experience in sales or sales support.\n- Experience in a startup environment.\n- Experience scaling teams.\n\n### What We Offer\n- You’ll be a part of issuu – an amazing place with room for parents, foodies, geeks, odd birds and the occasional normal person\n- Informal, inclusive and very flexible workplace\n- Competitive compensation package\n- Flat hierarchy – every opinion matters regardless of team and position\n- A sleek Mac and a pretty sweet desk setup\n- Great offices in Copenhagen, Palo Alto and Berlin\n\n### About issuu\nissuu connects the world’s publishers to an audience of active consumers, on a global scale. Every day millions of people find, read and share billions of pieces of content they find meaningful, from every device. Millions of magazine, newspaper and catalog creators are empowered to distribute, measure and monetize their work through the issuu platform <a href=\"www.issuu.com\">issuu.com</a>.\n\nIf you are interested in a sneak peek of who we are as issuuees, have a look at our <a href=\"https://issuu.com/issuu/docs/issuubrandbook\">brandbook</a>.","publish_date":"2017-04-24"}]