[{"link":"jobs/getacopywriter.html","location":"Remote","published":"Apr 21","id":1,"title":"Get A Copywriter Part-Time Account Manager","body":"\nWe at getacopywriter.com are looking for a part-time Account Manager to join our remote team. This is a long-term opportunity with room for professional growth.\n\nThe job includes the following:\n- Communication with inbound leads\n- Work on existing accounts\n\nSuccessful candidate must meet the following criteria:\n- Be a Native English speaker\n- Have experience in Account Executive, Account Manager or Sales roles\n- Have a passion to educate and sell to B2B prospects\n- Understand importance of content in online marketing\n- Have ability to work 10 to 20 hours a week and be available for daily check-ins\n\nTo apply, please include the following:\n- Your resume\n- A cover letter outlining your wins in Account Executive, Account Manager or Sales roles\n\nGet A Copywriter is a one-stop shop to engage talented content writers. With offices in Delaware and Europe, our remote team is successfully supporting blue-chip clients across three continents. Learn more about us at <a href=\"http://getacopywriter.com/\">getacopywriter.com</a>.","publish_date":"2016-04-21"},{"link":"jobs/market76.html","location":"New York, NY","published":"Apr 20","id":2,"title":"Market76 Client Success Specialist","body":"\nAs a Client Success Specialist, you'll be the face and voice of the company for our clients. You're a natural people-person and are energized when you can make the difference between customers being disheartened or delighted. You're an excellent communicator and have a knack for organization and attention to detail.\nAt the end of the day, you know what it takes to make customers happy and keep the trains running on time.\nThis role is critical to ensuring we provide an excellent service to all of our clients and will be relied on by every other team, be that as a liaison for Engineering or backup for Sales.\n\n### RESPONSIBILITIES\n- Provide excellent customer service to customers through phone, email, and chat.\n- Field questions from users, troubleshoot their issues, and provide them with concise solutions.\n- Effectively communicate with the Engineering team to fix issues that arise and suggest improvements to our overall customer experience.\n\n### REQUIREMENTS\n- Excellent communication skills\n- Ability to think on your feet and quickly troubleshoot problems\n- Ability to communicate potentially complicated issues to people in terms they'll understand.\n- Strong proficiency with Microsoft Office / Google Apps.\n- Great organizational skills and attention to detail\n- (Bonus) Proficiency with CRM/service systems like Salesforce, Jira, Zendesk, etc.)\n- (Bonus) Experience writing SQL queries\n\n### BENEFITS\n- Competitive pay\n- Equity in the business\n- Office snacks and team outings\n- Medical, Dental, Life, Disability Insurance","publish_date":"2016-04-20"},{"link":"jobs/zapier.html","location":"Anywhere - Fully Remote Team","published":"Apr 15","id":3,"title":"Zapier Support Engineer","body":"\nHi there!\n\nWe're looking for someone who loves helping people and solving tricky technical challenges for them to join us as our first dedicated support engineer - [everyone does support at Zapier in some way](https://zapier.com/learn/ultimate-guide-to-customer-support/everyone-on-support/). If you love interacting with people on a daily basis to help them learn how to optimize their work then read on…\n\n### About You\nYou’re technical, code every day, and love the possibilities programming and APIs provide, but you’re maybe not as excited about the prospect of debugging complex billing code or fixing an edge case in connection handling in some MySQL client. Instead - you’d rather spend each day helping users make their workflow more reliable and useful.\n\nYou're empathetic to users and can easily put yourself in their shoes. You realize that not everyone has the same skill set and that smart people sometimes make mistakes. You make customers feel empowered after interacting with support and not shamed because of a small mistake.\n\nYou're empathetic to your fellow teammates. You know sometimes bugs are shipped and or edge cases popup that weren't accounted for. You can use your engineering skills to track these issues down and fix them or triage them to other members of the engineering team.\n\nYou’ve worked with many APIs and know how they commonly fail. You know the little tricks you can employ to get misbehaving APIs back on track. You write simple code that handles failure cases in ways that delight users. You love Python and Javascript and have a favorite HTTP client library in each.\n\nYou obsess over the details. Maybe you have a one emoticon and one exclamation point rule of thumb for every email. Maybe it's only two sentences per paragraph. Either way, you make sure each word and each punctuation mark makes the customer delighted to work with you.\n\nYou love solving problems. Every customer is different, many times radically so. You relish being able to meet their specific need, and also solving their problems that may have gone unsaid.\n\nYou love to write. Almost everything at Zapier is done via written communication (both with customers and between teammates).\n\nYou're persistent. Support at Zapier is much different than at many software companies. It's not the same questions over and over again, and often involves researching technical nuances of the apps we support. You love the opportunity to solve new problems every day and won't give up when you don't know the answer right away.\n\nYou love doing things efficiently. You use tools like Text Expander and Alfred or you build your own tools to make you and your teammates’ jobs easier and faster. We believe in systems and processes that let us scale our impact to be larger than ourselves.\n\nYou love to set your own course. At Zapier, we have quick team meetings each week and one-on-one meetings every month and then we go make things happen. You get to make things happen without someone saying so.\n\n### Things You Might Do\nZapier is a startup, so you'll likely get your hands dirty in a little bit of everything. That said, here are some things you'll get to lead:\n\n- Help customers via email to ensure they have the best experience possible, troubleshooting their problems and answering their questions\n- Help partners identify problems between their APIs and the Zapier core application and work towards speedy resolutions for users\n- Identify and fix bugs that are affecting users trying to use Zapier\n- Write documentation to help users help themselves. All the documentation on our help site is written and maintained by the support team: https://zapier.com/help/ and https://zapier.com/developer/\n- Work alongside the product and engineering team to build tools that will speed up and increase the quality of support\n- Experiment: this is a startup so everything can change\n\n### The Whole Package\nLocation: Anywhere you want.\n\nIf you want to work remote, that's cool. If you want to work near others, that's cool too. The current support team is in Washington, California, Virginia, Florida, Connecticut, Wisconsin, Indiana, Texas, Indiana, Australia, England, and Spain.\n\nCompensation:\n\n- Based on experience\n- Great healthcare + dental + vision coverage\n- 401k retirement plan with 4% company match\n- Profit sharing\n- 2-3 annual company retreats to awesome places\n- 14 weeks paid leave for new parents\n- Pick your own equipment. We'll set you up with whatever laptop + monitor combo you want plus any software you need.\n\nUnlimited vacation policy (plus we insist you take at least 2 weeks off each year - this isn't a vague policy where unlimited vacation means no vacation).\n\nWork with awesome companies around the world. We partner with the best software companies in the world and you'll constantly get to [interact with people from these great companies](https://zapier.com/zapbook).\n\nSet your own destiny.\n\n### How to Apply\nApplying is simple.\n\n- Send an email to engsupportjobs@zapier.com\n- Tell us about yourself\n- Tell us why you want to work at Zapier vs. somewhere else.\n\nThen answer these 6 questions:\n\n1. A user hits an edge case where we’re not parsing their RSS feed correctly. We can't fix it because fixing it would adversely affect most other users. Write an email reply to that user.\n2. Tell us about the most difficult API/library/software bug you've tackled. We love real life stories.\n3. Send us a link to an app's API docs that you think are well done, and explain why you think they are good.\n4. Send us a link or an attachment to some documentation you wrote and maintained.\n5. Include links to your portfolio, Github profile or provide us with 500+ LOC. We're hoping to see some code you wrote in the past.\n6.How did you hear about Zapier?\n\n<i>All teammates at Zapier also agree to a [code of conduct](https://zapier.com/jobs/zapier-code-of-conduct/) that keeps Zapier a safe, welcoming and inclusive environment.</i>","publish_date":"2016-04-15"},{"has_chat":"true","link":"jobs/7geese.html","location":"Vancouver, BC, Canada","published":"Apr 14","id":4,"title":"7Geese Customer Support Specialist","body":"\nSupport and engagement at 7Geese means delighting with creative and memorable experiences that provide outcome based solutions. We believe that finding and seeking help shouldn't be a chore. Do you think so too?\n\nStart Date: ASAP\n\nMinimum Requirements: 1 year customer support experience, preferably at a tech company\n\nThese four key considerations guide what we look for in support hires.\n\nYou invite scrutiny and welcome positivity. Not every interaction is going to involve a yes, but you believe you can still delight and help. Honesty and empathy are your biggest soft-skills.\n\nYou avoid negativity and have integrity. You believe feedback of all kinds helps people improve how solutions are delivered. There's insightful opportunities in every interaction.\n\nYou can demonstrate that you don't play favourites. No one interaction is more important than the next, regardless how grandiose the problem. No question is stupid, but rather provides valuable insight.\n\nYou create structures for learning. Just being responsive and one-time solutions aren't all that. You value helping others learn how to be self-sufficient as well.\n\n### HERE AT 7GEESE, SUPPORT MEANS YOU...\n- Are a rockstar at self-prioritizing your work and communicating those priorities to the many people who will need you to help them.\n- Find just the right word. You have a natural ability to change your mannerisms to match the tone and expression of who you’re helping, while still maintaining your personality and the 7Geese brand.\n- Have experience in support content writing or writing, or just being great with words. There’s nothing worse than the floccinaucinihilipilification of complicated words.\n- Are excellent at navigating/learning tech products. Technology doesn’t intimidate you.\n- Thrive off learning new things, continuously. You want to progress in your role and take on more responsibility, more opportunities.\n- Have the ability to work independently, communicating across multiple time zones. (Don’t worry, you won’t have to work at 1am).\n- Are comfortable with debugging and quality testing. You won’t be coding, but you’re comfortable working with developers, working in products like Github and Huboard to stay informed with what’s going on with product development.\n- Ensure our customers receive phenomenal support. You know that every bit of work you do makes a real difference in making a customer successful.\n- Inspire confidence in the team internally, and more importantly, in our customers. By setting direction, displaying integrity, and moving towards team goals, you’ll leave customers delighted and setup for success.\n- Lead by example by providing delightful conversation-centric customer support.\n- Work with team members to implement process improvements, customer workflow improvements, and be a kick-ass support team.\n\n### BREAKDOWN OF HOW YOUR TIME WILL BE SPENT:\n- 50% Reactive support via Intercom (incoming support questions, e-mails, phone calls, and potential visits). You know the product inside and out; other teams come to fact-check things with you like \"Can a person with this permission do this?\"\n- 25% Writing and maintaining content for our learning center and knowledge base. If there's nothing new to update, you're researching new best practices and creating new resources to add.\n- 10% Bug tracking and quality testing. As things get reported, you stay in the know and act as liaison between development/product and the customer.\n- 10% Pro-active engagement (re-engagement emails, developing engagement campaigns to help champion our customers through ideal customer journeys).\n- 5% Reporting for monthly and quarterly meetings. Tracking KPIs, suggesting other metrics to track based on our goals, summarizing things like top 3 reasons for tickets in a given time period with suggested solutions.\n\n### YOUR EXPERIENCE!\n- You have a minimum of 1 year customer support experience.\n- You have demonstrated superhero like qualities in your current situation and are ready to soar into a new opportunity and take on a large project of your own\n- Know about the tech industry and what goes into making a team work well collaboratively\n- Can demonstrate how you excel in our 3 core value areas: excellent, positivity, and growth\n- Are communication driven with experience explaining complex problems in easy ways\n- Have experience delivering solutions to others that help them move forward\n- Bonus: ability to do product screencasts and basic photo/video editing skills to create content for support center","publish_date":"2016-04-14"},{"link":"jobs/datanyze.html","location":"San Mateo, California","published":"Apr 14","id":5,"title":"Datanyze Customer Support Representative","body":"\nYour compass has always lead you to the location where \"problems need solutions\"\n\n### About You\n\nYou are a patient and caring person who wants to help our customers get the most out of Datanyze's solution.\n\n#### Responsibilities\n- Man our customer support web application from 8am to 5pm\n- Help customers with their requests\n- Work closely with our Customer Success team\n- Respond to customer emails within minutes\n- Understand customers' needs and help them discover how our product can meet those needs\n\n### Must-haves\n- Humble and friendly personality\n- Amazing organizational skills\n- Ability to understand our business applications\n- Presenting yourself with professionalism, friendliness and a willingness to assist\n- Favorite book: 'Delivering Happiness'\n\n### Nice-to-haves\n- Customer service experience\n- Startup experience\n- Education: completely irrelevant -- we only use degrees to measure the temperature\n\n### Requirements\n- Willing to work in San Mateo regularly","publish_date":"2016-04-14"},{"has_chat":"true","feature":"true","link":"jobs/formlabs.html","location":"Boston, MA","published":"Apr 14","id":6,"title":"Formlabs Customer Support Engineer","body":"\nTo reinvent an industry, you have to build the best team. **Join Formlabs** if you want to bring ground-breaking professional 3D printers to the desktop of every designer, engineer, researcher, and artist in the world.\n\nOur primary goal is to give our customers the best tools with an amazing experience. At Formlabs, that means answering every question, no matter how small, and building amazing support material to empower our users to innovate and create.\n\nIf you love new technology and are a natural problem-solver and a great communicator, we want you on the Form Team as a **Customer Support Engineer**.\n\n### The job:\n- Remotely support users in learning the ins and outs of 3D printing\n- Keep customers ridiculously happy\n- Print in 3D to your heart’s content\n\n### You:\n- Can easily adopt cloud-based business applications\n- Power through task lists at lightning speed\n- Can navigate resources to provide answers, even before questions arise\n- A critical thinker, with an ability to quickly diagnose and resolve technical issues\n- Love going the extra mile to deliver the highest quality care\n- Possess exceptional email and phone communication skills\n- Are a creator: enjoy crafting, forming, making, fabricating, and playing with new tools\n\n### Bonus skills:\n- Experience providing technical support for hardware products\n- Familiarity with ticket or case management systems (Zendesk)\n- Experience with 3D modeling, printing and digital fabrication","publish_date":"2016-04-14"},{"link":"jobs/seatgeek.html","location":"Portland, OR","published":"Apr 14","id":7,"title":"SeatGeek CX Event Expert","body":"\nDo you love helping people?  Are you smart, humorous, and creative?  Are communication and working under pressure two of your best skills?   If you answered “yes” to all of the above, keep reading!\n\nAs a member of our Event Expert team, you’ll be the voice of SeatGeek. You’ll interact with customers through phone calls, emails, live chat and social media to resolve their issues and stay in the know about SeatGeek’s latest features.  We are passionate about providing ridiculously good customer service, and our Event Expert folks are some of the best and brightest in the industry.\n\nWe are looking for Event Experts who can commit to shifts from 11-7pm or 12-8pm PST. We may require some weekend work as well. Currently we are looking to expand our team in the Portland, OR area.\n\n### Who you are and what you have:\nYou have a bachelor's degree.\nYou are genuinely interesting, personable and intelligent. Current members of SeatGeek team include a former beekeeper, opera singer, gourmet hot dog vendor and an Olympic-hopeful fencer\nYou love live events and understand that purchasing tickets to see your favorite band is not the same as buying a stapler.  In other words, you can empathize with SeatGeek customers.\nPrior experience working in CX. A tech startup is a major plus.\nYou aren’t intimidated by numbers and understand the value of using data to make intelligent decisions.\nYou are a people person and are known to carry on a conversation with anyone.\nYou are passionate about technology and user experience.\n\n### What you’ll do:\nBe the first point of contact for customer questions through phone, email, live chat, and social media (even on the weekends!)\nUse metrics and consumer insight to help make SeatGeek better\nConsistently go above and beyond for our customers (think generous refunds and unexpected gifts, just because!)\n\n### Perks\nCompetitive salary in a well-funded early stage company\n$120/mo to spend on live events tickets\nA superb benefits package that supports health/dental/vision\nSpotify memberships and a discounted gym membership\nThree weeks of paid vacation per year","publish_date":"2016-04-14"},{"feature":"true","link":"jobs/castle.html","location":"Detroit or Remote","published":"Apr 13","id":8,"title":"Castle Account Manager","body":"\nYour mission will be to care for our owners, tenants, and properties—the core of Castle’s business.\n\nOwners trust us with their properties. Tenants trust us to meet their needs. As an Account Manager, you will nurture the trust of both parties. Specific duties include customer onboarding, marketing properties, moving tenants in (and out), collecting rent, and fielding maintenance requests. You’ll also help supervise a team of Customer Service Representatives.\n\nSince Castle is still so young, you should also expect to critically evaluate our processes and makes suggestions for improvement. We believe there is always room to improve, and we need your help making our processes the best they can be.\n\nWe have a remote-first culture, so we won't require you to move to Detroit. If you want to move here, or you already live here, you'll be working out of our headquarters.\n\n### You should be:\nDetail- and process-oriented\nA top-flight verbal and written communicator\nDriven to make everything better\nA good cop at heart, but a bad cop if need be\n\n### You’ll get:\n$40k/year\n0.1% equity\n\nInterested? Tell us why you want to join the team at <a href=\"mailto:fillintheblank@entercastle.com\">fillintheblank@entercastle.com</a>. Résumé not necessary.","publish_date":"2016-04-13"},{"link":"jobs/segment.html","location":"San Francisco, CA","published":"Apr 6","id":9,"title":"Segment Customer Experience Advocate","body":"\n### About You\nYou are passionate about creating an amazing experience for customers. You might have experience in sales, marketing, support, services, or teaching. Any role where you contributed to creating an amazing experience for others using a combination of one-to-one and one-to-many interactions. Segment is a super technical product, so you should be excited to learn about the product; a proven track record of going deep on a complicated topic is a big plus. If you have experience in our industry (SaaS, data, analytics, digital marketing) that’s an even bigger plus!\n\n### About the Role\nThis role is all about getting to know our non-technical customers and leading projects to drastically improve their experience. You’ll handle one-to-one email interactions like helping customers understand what Segment is, getting them comfortable with our site, and working through best practices. Providing amazing support is important, but to be a top performer in this role you’ll spend most of your time on projects that empower customers to work through issues on their own. Projects you’ll lead might include: recording walkthrough videos, writing help guides, hosting virtual demos for groups of new customers, anything goes! You’ll be in charge of prioritizing new projects based on interactions with customers and what you think will create the best overall customer experience.\n\nAs part of the Customer Experience team you’ll work closely with our technical support team since they’ll be your main escalation point when customers get to the point of implementing Segment. You’ll also work with our marketing team on most of your one-to-many projects like creating videos and content.\n\n### Responsibilities:\n- Answer non-technical support questions via email (understanding Segment, best practices, pricing, billing, etc.)\n- Escalate technical issues to tech support or engineering and qualified leads to sales\n- Consolidate customer feedback and issues with the product, messaging, and pricing to share across all teams in the company\n- Create content that enables customers to get setup with Segment without emailing support\n- Prioritize and lead projects that help customers understand the value of Segment\n- Be an advocate for amazing customer experience by working with other teams at Segment (product, engineering, design, marketing, growth, sales, technical support)\n\n### Requirements:\n- Proven history of going above and beyond for customers\n- Interested in Segment and our industry\n- Extremely people-centric and empathetic\n- You have a knack for planning and creating helpful content\n- Strong desire to meet goals, both personal and as part a team\n- Must be located in the San Francisco Bay area or willing to re-locate\n\nYou’ll be joining a team that loves making life easier for people. We care deeply about our customers and partners, and we judge ourselves on how well we serve them. If you enjoy working with smart people and helping build a company that cares about quality and culture, you’ve found the right place.","publish_date":"2016-04-06"},{"has_chat":"true","link":"jobs/basecamp.html","location":"Remote. Central Europe (CET/CEST or GMT preferably)","published":"Apr 5","id":10,"title":"Basecamp Customer Support Advocate","body":"\nWe’re looking for a super smart support team member! Specifically, we're seeking a native English speaker in Europe (preferably CET/CEST or GMT) for Saturday through Wednesday shifts.\n\nYou’ll be responsible for providing tremendous customer service via email and phone for all versions of Basecamp. You’ll also help us answer questions via Twitter, create and edit help documentation, run personalized demos, and maybe some online classes.\n\nDuring training, you'll be expected to be proactive in your process and learn quickly. Once fully up-to-speed (2-3 months), you'll write about 100 emails per day. This is a significant volume, so be sure that you’re ready and able to deal with that kind of daily load -- you'll get all the love and help you need along the way!\n\nWe’re looking for some great writers who love helping our customers, so you should enjoy making complicated situations simple and painless and have a passion for our products. This means being a great problem solver with the ability to process and resolve issues quickly.\n\nIf you want to join Carrie, Chase, Chris, Elizabeth, James, Jim, Joan, Kristin, Merissa, Natalie, Sylvia and Tony in making our customers happy, please apply!\n\n### Please submit a cover letter explaining:\n- Why you want to work in customer support.\n- Why you want to work at Basecamp and not somewhere else.\n- A description of a great customer service/support experience you had recently, and what made it great.\n- A time you taught yourself a new skill to complete a job or project.\n- A guide to making a peanut butter and jelly sandwich. (Seriously.)\n\n### Also, pick three of the questions from customers below and answer them like you would if you worked here:\n- Does the new Basecamp offer time tracking?\n- Is the new Basecamp offered in any other language besides English?\n- I've been a Basecamp user for years and see you have a new version. What's the difference between the versions, and why should I switch?\n- How do I work with clients in the new Basecamp?\n\nWe offer heaps of lovely benefits, a competitive salary, plus a progressive work environment.\n\n### How to apply:\nEmail everything to <a href=\"mailto:jointheteam@basecamp.com\">jointheteam@basecamp.com</a>. Include “Customer Support” and your location in the subject line. If you’re attaching a resume, please send it as a PDF.\n\nNote: This is not a position for designers/programmers who are looking to work their way into another job at Basecamp; we are solely looking for someone interested in and dedicated to supporting our customers. Do not send LinkedIn resume links. If you don't fit the specific criteria, please do not apply.\n\nWe look forward to hearing from you!","publish_date":"2016-04-05"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Mar 21","id":11,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2016-03-21"},{"has_chat":"true","feature":"true","link":"jobs/issuu.html","location":"Palo Alto, CA","published":"Mar 15","id":12,"title":"issuu Community Manager","body":"\nissuu is the world's leading digital publishing platform. We're looking for a new member to join our fantastic team. With amazing people, unique ideas and stunning technology, we're changing the future of publishing today. Are you the best at what you do? Come join us.\n\n### About this job\nThe marketing team at issuu is seeking a creative, inspired Community Manager to join us and take responsibility for building strong, positive relationships with the growing number of publishers who rely on issuu every day. You enjoy interacting with people online and in the real world, and you have a knack for engaging others with the ideas and content you create and share. You’ll be part of a growing team that collaborates with awesome colleagues in design, support, product and engineering to deliver the world’s best publishing experience for millions of people. This is a full-time position based in issuu’s Palo Alto office. You will report to the VP of Marketing.\n\n### RESPONSIBILITIES\n- Manage issuu social communities across Facebook, Twitter, Pinterest, LinkedIn, Instagram and others\n- Engage with publishers to foster the development of an active community organized around their concerns, interests and opportunities for growth\n- Identify and manage influencer outreach to drive additional visibility for issuu among publishers\n- Lead the creation and management of content and social media campaigns to highlight issuu’s network and global audience\n- Develop an editorial calendar and content strategy for each social channel we participate in\n\n### QUALIFICATIONS\n- 1-3 years of experience managing online communities\n- Excellent communication skills\n- Strong understanding and prior experience with major social media platforms including Facebook, Twitter and Pinterest\n- Great teammate and collaborator, able to work with a diverse and geographically dispersed team\n- Able to be effective in a startup environment: be proactive, creative and innovative\n\n### BENEFITS\n- Competitive compensation package, commensurate with experience\n- Flexible vacation policy\n- Competitive health, dental and vision packages\n- A sleek Mac and a pretty sweet desk setup\n- Walking distance to the Palo Alto Caltrain station and monthly passes for public transportation or parking\n- Catered lunches and team events","publish_date":"2016-03-15"},{"feature":"true","link":"jobs/github-enterprise.html","location":"Remote","published":"Mar 7","id":13,"title":"GitHub Enterprise Support Engineer","body":"\nMore and more companies are using GitHub Enterprise, so the support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. We're looking for Enterprise Support Engineers, in North America, some European territories, Australia, Japan, and New Zealand to support our GitHub Enterprise product installed and managed in the customer's virtualization environment.\n\nYour main responsibility will be to work with our customers to solve support tickets. Tickets are usually opened by internal system administrators, and can include investigating load or networking issues, debugging application errors, and discussing feature requests. You'll also work with our engineering team to prioritize issues and development, and our documentation team to improve customer-facing resources. You don’t need to be a Git expert, but you do need to have technical experience and a passion for helping people.\n\nThe position reports to an Enterprise Support Manager and works closely with other teams and leaders across the company.\n\nGitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events. \n\n### RESPONSIBILITIES\n- Solve complex customer support tickets often involving Linux servers, source code, and web application issues\n- Effectively communicate technical information to customers and engineering groups at GitHub\n- Work proactively with customers on activities such as coordinating upgrades, communicating upcoming features, and ensuring their installation is running smoothly\n- Identify bugs and improvements in the GitHub Enterprise codebase\n- Manage urgent customer outages during business hours\n\n### QUALIFICATIONS\n- General understanding of how modern web applications work\n- Prior experience providing technical support\n- Excellent problem solving skills\n- Familiarity with some flavor of production-level virtual machine (e.g., VMware ESX, Xen, KVM)\n- Enthusiasm for working directly with customers\n- Stellar English and grammar skills\n\n### BONUS POINTS IF YOU HAVE\n- Worked closely with large complex customer accounts\n- Familiarity with Git and GitHub\n- Experience with phone support\n- Ability to look through and understand code (Ruby / Bash)\n- Previous experience as a System Administrator\n\n### WHY YOU SHOULD JOIN\nWorking at GitHub is, to put it simply, a special slice of the universe. We're committed to transparency, collaboration, experimentation, and always staying classy.\n\nBecause of this unique perspective, we've established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.\n\nEnsuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits* are out of this world.\n\nIn a nutshell, we've built and are growing a place where we truly love working, and we think you will too.\n\nGitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there's anything we can do to make the interview process better for you; we're happy to accommodate.\n\n*_Please note that benefits vary by country, if you have any questions don't hesitate to ask your recruiter!_","publish_date":"2016-03-07"},{"feature":"true","link":"jobs/github.html","location":"Remote","published":"Mar 7","id":14,"title":"GitHub Technical Support","body":"\nThe GitHub Technical Support team is looking for full-time team members in our SF office or worldwide! We are particularly in need of folks in Asia-Pacific and Europe. GitHub users work 24/7, so you'll occasionally need to adjust your work week to help cover a weekend or holiday (don't worry! We strongly support flexible schedules that let you to take care of the important things in your life).\n\nWhen GitHub users have questions, they contact Support and we help them as quickly and awesomely as possible. Technical support handles a wide variety of inquiries including questions about Git and GitHub workflows, GitHub Pages, our API, and our desktop applications. Support also works closely with the engineering team to track down bugs and improve our documentation.\n\nThe most important characteristic of our support team is that we love helping developers. GitHub is a place for people to work better, together. Our job is to help. Support treats users the way we'd want someone to treat our friends.\n\nOur support teammates have excellent writing chops: stellar grammar, charming written personality, and the ability to explain complicated things simply. We measure our success in swiftness, accuracy, and clarity.\n\n### YOU MUST HAVE:\n- Stellar English and grammar skills\n- Excellent problem solving skills – you might not know all the answers but you know how to find and communicate the solution\n- A strong sense of empathy – you are attuned to hear the question behind a question\n- Technical experience and exposure to programming\n- Customer service experience\n- A unique writing style and voice\n\n### BONUS IF YOU:\n- Will love developers and GitHub as much as we do\n- Could effortlessly explain how Git works to a non-developer\n- Have remote customer service experience\n\n### WHO WE ARE\nGitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.\n\nWe have a lot of exciting things to do, and we’re looking for the right people to grow with us!\n\n### WHY YOU SHOULD JOIN\n\nWorking at GitHub is, to put it simply, a special slice of the universe. We're committed to transparency, collaboration, experimentation, and always staying classy.\n\nBecause of this unique perspective, we've established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.\n\nEnsuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits* are out of this world.\n\nIn a nutshell, we've built and are growing a place where we truly love working, and we think you will too.\n\nGitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there's anything we can do to make the interview process better for you; we're happy to accommodate.\n\n*_Please note that benefits vary by country, if you have any questions don't hesitate to ask your recruiter!_","publish_date":"2016-03-07"}]