[{"link":"jobs/github-specialist.html","location":"APAC, EU, US","published":"Jul 1","id":1,"title":"GitHub Dotcom ToS Support Specialist","body":"\nThe GitHub Terms of Service Support team is looking for full-time team members in our SF office or worldwide! GitHub users work 24/7, so you'll occasionally need to adjust your work week to help cover a weekend or holiday (don't worry! We strongly support flexible schedules that let you to take care of the important things in your life).\n\nWhen GitHub users have questions, they email support. We help people as quickly and awesomely as possible. Our Terms of Service team supports users with issues related to site policy, including DMCA takedowns, trademarks, spam and abuse, and privacy. This requires a logical brain, good intuition and problem solving skills, plus the ability to objectively apply GitHub's values to a variety of socially and emotionally sensitive topics. We work closely with GitHub's Legal team, so an interest in law is also an asset.\n\nThe most important characteristic of our support team is that we love helping developers. The Terms of Service Support team specifically helps people understand and follow the policies that make GitHub a place for people to work better, together.\n\nOur support teammates have excellent writing chops: stellar grammar, charming written personality, and the ability to explain complicated things simply. We measure our success in swiftness, accuracy, and clarity.\n\n### YOU MUST HAVE:\n- Stellar English and grammar skills\n- Excellent problem solving skills – you might not know all the answers but you know how to find and communicate the solution\n- A strong sense of empathy and the ability to advocate for others\n- A unique writing style and voice\n\n### BONUS IF YOU HAVE:\n- Prior customer support experience\n- Experience in law, policy-related, or regulatory fields\n- Experience working remotely","publish_date":"2016-07-01"},{"link":"jobs/github.html","location":"North America (Remote)","published":"Jul 1","id":2,"title":"GitHub Developer Platform Content Writer","body":"\nWe're looking for a writer to help create developer content for the GitHub Developer Documentation site.\n\nThis writer will report to the Documentation Team Manager and work cooperatively with the Documentation and Platform teams to document APIs and create guides to showcase the power of the GitHub platform products and tools, tailored to developers at different stages in their careers.\n\nIf you're a patient, compassionate writer who loves crafting innovative, useful reference documentation and usage samples to help developers build software, we really want to hear from you!\n\nThis person will be part of our global Support organization, writing content for users around the world. At this time, we're looking for candidates located in the US or Canada, with legal work authorization in one of those countries.\n\n### RESPONSIBILITIES:\n- Collaborate with the Documentation and Platform teams on planning, developing, and maintaining developer content for the GitHub Platform\n- Cooperatively review and edit drafts of developer content with other writers and developers on those teams\n- Communicate with Support, Product, and Engineering teams about the user feedback, product changes, and technical product information that inform our documentation\n\n### QUALIFICATIONS:\n- Working knowledge of HTTP and web requests\n- Familiarity with a higher-level programming language, such as Ruby, Python, or JavaScript\n- Ability to create high-quality, innovative content for software developers\n- Strong developer advocate, especially for those new to a platform\n- Ability to compassionately give and receive editorial critique\n- Excellent communication skills, especially when working with a distributed team (The Documentation team is currently entirely distributed)\n- Strong ability to plan, prioritize, and carry out complex writing projects with high attention to detail along the way\n- Located in the US or Canada, with legal work authorization in one of those countries","publish_date":"2016-07-01"},{"link":"jobs/replicated.html","location":"Los Angeles, California","published":"Jul 1","id":3,"title":"Replicated Support Engineer","body":"\nThe Support Engineer will work directly with our customers (including some of the best developer tools in the world) to ensure that their end customers are successful in deploying their application via Replicated.\n\nYou’ll need to know your way around common distributions of Linux, be comfortable in the command line and maybe write a few lines of bash.\n\nIn this role you’ll:\n- Help customers install and maintain their Replicated installations.\n- Build knowledge base of common mistakes\n- Work to improve the product and prevent issues.","publish_date":"2016-07-01"},{"link":"jobs/ultralinq.html","location":"London, UK","published":"Jul 1","id":4,"title":"UltraLinq Healthcare Solutions Implementation Specialist","body":"\nImplementation Specialists are responsible for the on-boarding process for prospects and new clients. Implementation Specialists must work with the on-boarding client to assess product needs, manage technical operations and roadblocks, and appropriately train the user base. Implementation Specialists must also participate in customer support and troubleshooting when necessary.\n\n### Job Responsibilities\n- Manage the on-boarding process for new clients.\n- Accurate logging, dispatching and resolution of 1st and 2nd level support requests.\n- Tracking of client feature requests.\n- User training for all client personnel who require access to the product.\n- After-hours support as required.\n\n### Job Skills\n- Familiarity with the project management lifecycle.\n- Ability to work independently with strong time management skills.\n- Excellent written communication skills; including above average grammar and spelling ability.\n- Understanding of the principles and process of troubleshooting.\n- Ability to communicate clearly, calmly and in an articulate manner over the phone.\n- Advanced competency regarding Microsoft Windows, web browsers, and a special focus on network and firewall configuration.\n- Strong understanding of networking principles (TCP, DNS, DHCP, etc.) and networking hardware setup.\n- Advanced knowledge of the UltraLinq and UpLinq applications.\n- Knowledge of medical workflows or familiarity with medical imaging devices, strongly preferred.\n- A pleasant demeanor and patient attitude.\n\n### Other Stuff:\n- Ideal candidate is local to London\n- Implementation Specialists are required to sit for extended periods of time.\n- Client Services Representatives must utilize a computer with a mouse for extended periods of time.\n- Travel: Approximately 25%","publish_date":"2016-07-01"},{"link":"jobs/klaviyo.html","location":"Boston, London, and Sydney","published":"Jun 27","id":5,"title":"Klaviyo Support Engineer","body":"\nEmail will no longer suck. Klaviyo is using technology to reinvent email marketing from the ground up! For far too long email marketing has been pretty selfish. Companies blast everyone with the same email, not because they think that’s what customers want, but because they don’t have a choice.\n \nKlaviyo fundamentally changes the game. Our software ties together everything companies know about their customers, processes massive quantities of data in real-time, and uses it to drive a platform that’s part CRM, part analytics engine and 100% an email platform that drives results.\n \nTechnology has come a long way in the last 15 years, but email hasn’t really changed. We’re here to fix that.\n\n### Success at Klaviyo \nSuccess is a super critical function that sits at the intersection of product, sales and marketing. The Success team is at the core of our business! \n\n### You Will\n- Respond to customer inquiries \n- Communicate technical concepts effectively to both technical and non-technical audiences \n- Serve as the Klaviyo Product Expert \n- Contribute to the knowledge base of the Klaviyo Customer Success Team \n- Collaborate with Engineering, Sales and Product to improve customer experience \n\n### You Have\n- 3+ years in a technical support role \n- In depth working knowledge of JavaScript, HTML, CSS \n- Proficiency with APIs","publish_date":"2016-06-27"},{"has_chat":"true","link":"jobs/fastly.html","location":"London, United Kingdom","published":"Jun 15","id":6,"title":"Fastly Customer Support Engineer","body":"\nFastly is a flexible, transparent content delivery network that accelerates and scales websites, mobile applications, and APIs. We do this by moving content physically closer to a company’s end users. If you’re tweeting, pinning, shopping on Wayfair or ModCloth, reading the news on Fast Company or The Guardian, browsing pictures on Imgur, or coding with GitHub, Fastly is improving your user experience.\n\nThe global CDN market is estimated to grow from $3.71 billion in 2014 to $12.16 billion in 2019. With an exciting product roadmap and a fast-growing international team, Fastly is redefining what’s possible online.\n\nWe’re building a better Internet. Come join us. \n\n### CUSTOMER SUPPORT ENGINEER \n\nFastly’s goal of creating the best set of tools for people who scale the internet is rooted in great support. It's a core value, and something that shapes our culture. Fastly is looking for passionate support engineers to continue our high standard of support, as well scale and improve our support systems as we grow.\n\nThe ideal candidate should be a master of written voice, and have the technical curiosity and experience necessary to understand Fastly’s product from end to end. They’ll be working with our marketing, engineering, and sales teams on behalf of our customer base, so a passion for customer advocacy is essential. Also, no two support tickets at Fastly are alike, so support engineers will be dealing with a wide range of complex and rewarding problems on a daily basis.\n### RESPONSIBILITIES\n* Assist with customer CDN configurations over email and chat\n* Communicate customer needs and requirements with the engineering, product and sales teams\n* Contribute to our customer facing documentation when necessary\n* Contribute to the processes and policies that scale our support organization as we grow\n\n### REQUIREMENTS\n* Strong verbal and written communication skills\n* Familiarity with a *nix environment\n* Familiarity with one or more programming languages\n* Ability to debug connections using cURL, traceroute, telnet and other network diagnostic tools\n* Prior CDN, support, or sysadmin experience a plus","publish_date":"2016-06-15"},{"link":"jobs/protrainings.html","location":"Grand Rapids, MI or Remote","published":"Jun 15","id":7,"title":"ProTrainings Customer Happiness Hero","body":"\n### You...\n- Are good at seeing things from other people’s point of view\n- Strive to take care of others like you would take care of your own family\n- Love to build relationships with customers\n- Want to take customer care to the next level\n- Emulate other companies that provide amazing service: Disney, Chick-Fil-A, Nordstrom, Ritz-Carlton, Trader Joe’s, and Zappos are some great examples\n- See the value in having a rabid, loyal customer base\n- Embrace change\n- Push for excellence\n\n### Who we are\nWe’ve been certifying people in CPR, first aid, and bloodborne pathogens since 2003. Not only that -- we’ve been increasing in size, training more people, adding more trainings, and getting bigger and stronger every year since.\n\nWe are a collaborative, growing team that creates and supports the world’s best training. Our online health and safety courses help save lives every day (literally -- we have heard countless stories from our customers who have saved the lives of loved ones after using our training).\n\nWe work out of an awesome, open building in Grand Rapids, Michigan.\n\n### What we believe\nProviding life-saving training is a noble pursuit that is worth getting up every morning to create.\n\nWe believe that every team member is crucial and makes a difference, which is why we hire highly-motivated, hard-working, well-rounded people who pursue excellence in everything they do. That’s also why we’re very selective and particular about hiring great people, especially in this position, as you will be the face of our company to many of our customers.\n\nWe think that surprising and delighting our customers at every turn makes life-long, loyal supporters who rave about you to their friends; not to mention, it helps make the world a better place to live!\n\nWe believe that training should be FREE, because nobody should have to take out their wallet to learn how to save a life. In fact, we believe this so strongly, we created a StudentCPR program that trains thousands of high school students every single year.\n\nWe believe that you can work really hard and still have a ton of fun. You can play ping pong to blow off steam, chat with customers from our ceiling suspended hammock chair, and play games with co-workers at the office at night. Work and fun are not mutually exclusive -- having a good work-life balance is critical to loving your job and doing great work.\n\nWe love innovation. We don’t like to do things like everyone else. A great example is our Single Use Manikin Option (SUMO). For the first time in the history of CPR training, people are able to complete their entire certification without leaving home.\n\n### What you’ll be doing\n- Delighting our customers by forming real relationships with them (through phone, email, and chat), including sending out postcards and follow-up emails to show our appreciation\n- Forming meaningful relationships with company administrators (Nike, Bed Bath & Beyond, Goodwill, and Jazzercise are just a few companies that use us) while assisting them with setup, onboarding, and follow-up\n- Providing insightful advice and friendly support to ProTrainings customers in need\n- Quickly diagnosing problems on the spot, determining and explaining situations with patience and empathy so our customers can get trained and get back to work\n- Taking ownership of every customer interaction -- we empower you to make decisions and care for customers in creative ways -- no robots here\n- Collaborating with other departments to WOW our customers\n- Learning and growing professionally by taking time every week to read articles or books from our bookshelf to better yourself\n- Working 12pm - 8pm or 9am - 5pm (EST) with the possibility of alternating shift coverage\n- We are open to remote workers who have a great work ethic, are self-motivated, and do great work without direct supervision\n\n### Desired experience\nYou have worked in a customer-relations role in the past, whether that was as a receptionist, a call center rep, nursing assistant, barista, bank teller, anything in retail, or any other position in which you helped and delighted customers.\n\n### Basic skills we’re looking for\n- Strong writing skills\n- Strong people skills\n- A good speaking voice\n- Ability to maintain composure and customer focus while troubleshooting and solving technical issues\n- Comfortable with technology\n- Fast typer\n- Comfortable on phone, email, and chat\n- Fast learner\n- Attention to detail\n- Bonus if you are able to speak Spanish (at least at a high school level) and interested in learning more\n\n### Benefits you’ll love\n- Health / dental insurance\n- Paid time off\n- 401k with company match\n- Fun culture / atmosphere\n- A career that makes a difference (train people to save lives, hear heroic stories, and receive awesome testimonials from really grateful customers)\n- High level of autonomy and creativity while helping and delighting customers\n- Extensive, continuous training (you won’t be thrown in blind)\n- Professional development library (request a book or resource, and you’ll have it within 2 weeks)\n- CPR / first aid training & certification\n\n### Ready to help save lives?\nIf you’re still reading this, we would love to learn more about you. Shoot an email to careers at protrainings dot com and include the following:\n\n- A fun, catchy subject line\n- Your top 3 strengths\n- A time that you went above and beyond to help someone (preferably in a work setting, but a personal interaction is fine)\n- Why you want to work at ProTrainings\n- Your résumé","publish_date":"2016-06-15"},{"feature":"true","link":"jobs/code-climate.html","location":"New York, NY","published":"Jun 6","id":8,"title":"Code Climate Customer Success Manager","body":"\nCode Climate is the world's largest static analysis platform, helping over 50,000 developers improve the health of their codebases. We work hard to provide clear, timely and actionable insights derived from source code. We recently launched the Code Climate Platform, the first open, extensible platform for all types of static analysis.\n\nCode Climate is available on our hosted platform for free for open source projects, and offers paid subscriptions to analyze private source code either on our hosted platform or Code Climate Enterprise, our behind the firewall product. Our customers include Fortune 500s, public and private companies, large and small, with a range of technical sophistication and exposure to static analysis.\n\nAs a Customer Success Manager you’ll work with customers to help them achieve their software goals, primarily (but not necessarily exclusively) using Code Climate. You’ll also work closely with our engineering and customer service teams as a voice for these customers within the company.\n\nAs a key part of the external face of Code Climate, we're looking for someone who is invested in the success of our customers, and represents our values well by putting customers first and executing rigorously.\n\n## Examples of problems you'll be solving:\n* Becoming an active and positive collaborator in the customer’s mission to better improve their code and software development processes by learning about their unique goals, successes and challenges.\n* Navigating organizations to determine who are the influencers and decision makers.\n* Training clients and promoting wider and deeper Code Climate adoption within their organizations.\n* Educating customers with unique software development processes and environments about the best way to use Code Climate.\n* Concierge onboarding for customers with large teams of developers to ensure smooth integration of Code Climate into their organization\n* Integrating Code Climate into an organization’s existing IT environment -- including source code management, code review tools, and collaboration tools like Trello and Slack.\n* Diagnosing issues affecting customers and collaborating with the product engineering team to identify solutions (and creatively suggesting workarounds, when necessary).\n\n## You're awesome because:\n* You elicit glowing testimonials from customers.\n* You communicate clearly, concisely and honestly. Customers trust you.\n* You empathize with issues customers face and are compelled to solve them.\n* You continually advocate internally on behalf of customers, and can name from memory the problems that our biggest customers face.\n* You're never afraid to strike up a conversation with someone new, online or in person.\n* You’re comfortable having discussions with both technical and non-technical stakeholders.\n* You're able to navigate complex organizations.\n* You're technologically curious and always learning.\n\n## Working at Code Climate\n* Join a small team of around fifteen full-time people who love what they do.\n* Competitive compensation and meaningful stock options.\n* Flexible and generous paid time off including an open vacation policy and maternity/paternity leave.\n* Health, dental and vision insurance. We pay 100% of the premium and 50% of the premium for dependents.\n* Company retreats twice a year. So far we've gone to Bali and San Diego.\n* Opportunities to continue your professional development, including attending tech conferences.\n* Dog-friendly office stocked with snacks, drinks and cold-brew iced coffee.","publish_date":"2016-06-06"},{"feature":"true","link":"jobs/activecampaign.html","location":"Australia","published":"Jun 3","id":9,"title":"ActiveCampaign Platform Specialist - Australia","body":"\nActiveCampaign is a platform focused on email, marketing automation, and sales for small businesses.\n\n### WHAT YOUR DAY COULD CONSIST OF:\n- Assisting users via email, live chat, and phone\n- Consulting with clients to help them utilize our platform to achieve their unique goals\n- Conducting live demos of our platform with screensharing.\n- Keeping on top of the latest news in regards to email marketing, deliverability, and small business marketing in general.\n\n### WHAT IS NEEDED:\n- Past experience with sales and customer service — specifically with SAAS solutions\n- Past experience with email marketing, marketing automation, and/or marketing in general\n- The ability to efficiently respond to a significant number of emails, chats, & phone calls per day (once you are up to speed you should be handling over 100 requests a day)\n- A self-motivated and driven attitude where you will work towards achieving new goals\n- Excellent communication skills & the ability to relate to others\n- Input matters, your work has a high impact, and everyone is working together.\n- Being able to take a general idea and add your own insight and tweaks to it.","publish_date":"2016-06-03"},{"feature":"true","link":"jobs/expensify-coach.html","location":"London","published":"Jun 2","id":10,"title":"Expensify UK Success Coach","body":"\n### Your Mission, Should You Choose to Accept:\n\nExpensify prides itself on solving real-world problems with a team of top-notch product experts. We are reinventing the way people look at expense reports by automating not just the expense report, but the entire business trip. Joining our team means you are helping us fight the good fight against expense reports that suck!\n\n### About The Job\nAs a Success Coach, you will be focused on making sure that our customers are successful in using Expensify to solve the problems they face. You’ll do this by applying a deep understanding of our customers, their processes, our product and the systems with which we integrate. You’ll also gather feedback on how we can evolve Expensify to meet our customer’s needs in the future, and apply your product knowledge to map out these improvements for engineering. When product changes happen, you’ll lead the charge via documentation, blog posts, emails, calls and in-person visits with our customers.\n\nJoining our team means you will be working in our fast-paced environment and you are fearless of our next big challenge. Even though we work hard at Expensify, we make sure our employees are happy. Our most-discussed perk is our offshore, where we spend a month abroad working as a team from a remote location. Last year we went to Cambodia and Thailand. Where do you want to go next?\n\n### About You\nYou’re an entrepreneur who enjoys thinking through challenging problems, working across functional groups and articulating yourself in both technical and non-technical settings. You’re poised and confident when talking to customers and can always find the time to work with your colleagues to get any issue resolved.\n\nFor the best possible fit, we are looking for someone who:\n\n- Has excellent communication skills. One moment you may be having a technical discussion with an engineer about the product implications of a new feature, the next moment need to communicate how we are going to sell this feature with a member of the sales team, before quickly moving on to working directly with a non-technical customer to fix a problem. The ideal candidate will be able to clearly articulate themselves in all scenarios.\n- Is passionate about building, maintaining and making our software better. It’s what we do as a company.\n- Can manage time and prioritize efficiently. Things move quickly in this environment and it’s crucial that you are able to react to new information and re-prioritize accordingly.\n- Is comfortable learning from peers in an informal fashion. After all, we're all learning things as we go. We also love anyone who's able to effectively train colleagues as we grow the team.\n- Is well-versed in saying “no”. We often have to say no to ensure that our product stays simple and user-friendly. Saying no and having a compelling argument as to why requires in-depth product knowledge and knowledge of the problem that the customer is trying to solve and is critical to success in this role.\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n1. Describe a memorable experience - whether at work or in your personal life - working with a client/customer. What issue did they face, and and how you were able to address their concerns? If you weren't successful addressing their concerns, why not?\n\n2. If you were tasked with analyzing customer behavior and recommending product-driven solutions, how would you approach that problem?\n\n3. Describe a scenario where you interacted with an irate person. How were you able to turn them around (assuming you were able to)?\n\n4. What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n\n5. How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.","publish_date":"2016-06-02"},{"feature":"true","link":"jobs/expensify.html","location":"London","published":"Jun 2","id":11,"title":"Expensify UK Customer Success","body":"\n### Your Mission, Should You Choose to Accept:\nExpensify prides itself in solving a real world problem with a team of top notch product experts. We are reinventing the way people look at expense reports by automating not just the expense report, but the entire business trip. Joining our team means you are helping us fight the good fight against expense reports that suck!\n\nWe are expanding into the UK market and it's very early stage for our London based team. Help shape the team that will launch our global domination of expense reports and maintain a standard of excellence around the world.\n\n### About The Job\nAs a member of the Customer Success Team, you will be focused on making our user base successful Expensify users, through a deep understanding of our product and its many applications.\n\nJoining our team means you will be working in our fast paced environment and you are fearless of our next big challenge. Even though we work hard at Expensify, we make sure our employees are happy. Our most discussed perk is our offshore where we spend a month abroad working from a remote location as a team. This year we went to Cambodia and Thailand. Where do you want to go next?\n\n### About You\nYou’re an entrepreneurial extrovert who loves developing relationships with others and helping them solve complex problems with the ease of a trapeze artist! You’ll be talking to users through email, chat, and when needed on the phone, assisting with the onboarding process for potential customers, and working with with existing customers to make sure they are getting the most out of Expensify. The sky’s the limit for you, and this position can also be a jumping off point into other teams within the organization.\n\nFor the best possible fit, we are looking for someone who:\n\n- Can communicate to all levels within a company in a professional manner\n- Is a team player with great interpersonal skills\n- Wants to contribute to the growth of this team for the future\n- Can provide excellent verbal and written communication with clients\n- Bonus: Some general understanding of the accounting process, Not required!\n\n### Next Steps\nLike what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:\n\n1. What was your first customer support position?  What did you support, and what was your personal take on the product and how best to support it?\n\n2. If you were given free reign to choose the optimal set of customer support tools, what would they be and how would they optimize your customer success approach? (Feel free to list actual sales tools you’ve used, or fictitious ones. You’ve got free reign).\n\n3. Describe the angriest customer you have had to support, and how were you able to turn them around? (Assuming you were able to!)\n\n4. Pretend you had a month to do whatever you wanted. What would you do? And would this be sufficient time to accomplish the goals you set out to achieve?\n\n5. What do you want to do with your life, and how is Expensify a step toward those long-term goals?\n\n6. How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.","publish_date":"2016-06-02"}]