[{"link":"jobs/recharge.html","location":"Remote","published":"Aug 19","id":1,"title":"ReCharge Technical Customer Support","body":"\nReCharge is a fast moving small team making ecommerce payments easy for everyone. We currently empower thousands of online stores to sell their products on a recurring basis. We’re experiencing incredible growth – from our start 18 months ago we have bootstrapped our way to processing millions of dollars a week.\n\nWe are looking for a Customer Success Engineer who is resourceful; using troubleshooting and analytical skills to serve our customers via email, chat and occasional phone calls. You are self driven, with a knack for digging deep into problems. You have a sense of urgency and draw satisfaction from going above and beyond to provide solutions. You'll help to find convergence in what customers need so we build the highest value product. We get a lot of applicants, so we encourage you to do something that stands out and help us know why your the perfect fit for ReCharge. \n\n### Job Description:\n- Combining technical expertise with customer service to resolve questions and issues.\n- Able to communicate clearly in writing for both technical and non-technical people\n- Document and build new tools to improve support flows.\n- Identify patterns - recommend improvements, and filter our unimportant issues. \n- Authoring Success documentation for our customer facing Help Center. \n- Assist with successful on-boarding of new customers\n\n### REQUIREMENTS\n- Schedule Sunday - Thursday\n- Covering US hours (9am PST - 5 pm PST)\n- Knowledge of HTML, CSS, Javascript (Knowledge of other programming languages a plus) \n- 2+ Years experience in a similar role at another SaaS company\n- Excellent organizational and communication skills. \n- Detail oriented, to prove this make sure to add to job application headline \"I am detailed oriented\".\n- Excellent customer service skills with a polite, patient, caring, calm and professional demeanor.\n- Language requirements, English fluency (written and spoken)\n- Background in the software industry.\n\n### BENEFITS\n- Competitive salaries\n- Apple equipment\n- Paid time off\n- Medical, dental, & vision insurance\n- Much more...","publish_date":"2016-08-19"},{"link":"jobs/paperless-post.html","location":"Remote (within New York Sate)","published":"Aug 12","id":2,"title":"Paperless Post Remote Customer Support Associate (New York Based)","body":"\nPaperless Post is seeking a compassionate customer support associate that will help our users have the best experience possible on our platform on a daily basis. Because we never read answers out of a manual, you’ll spend your days providing the kind of personalized responses that make customers feel like they’re talking to a real live human being—because, well, they are!\n\nAfter completing a two-week training session in our New York City office, remote support team members work 40 hours a week in 6-8 hour shifts, including some weekends and holidays, from home. We’re aiming for 24/7 support as much as possible, so your ability to work odd hours is a plus.\n\n**To apply, send us your resume and a cover letter that answers the following questions:**\n- Please provide your general availability for each day of the week. Is it steady or does it change frequently? How flexible is your schedule?\n- What do you think is the most important responsibility you have as a customer support rep?\n- Explain a scenario when you had to tell a customer “no” or had to correct their mistake.\n- Explain a scenario when you made a mistake. What did learn from the experience? How was it resolved? How did you feel about the feedback you received (from your customer, teammates, or manager)?\n- What’s your favorite gif?\n\n### What you'll do here\n- Troubleshoot and respond to customer questions and issues over the phone, via email, and on live chat.\n- Work closely with fellow support reps to identify and track major issues and trends to improve the user experience.\n- Stay familiar with our site and its offerings to best serve user questions.\n- Work flexible hours, including weekends and holidays.\n\n### What you bring to the table\n- _MUST be a permanent resident in New York_\n- 2+ years experience in customer support with a track record of both working independently and collaborating with a team.\n- A reliable Internet connection and a quiet environment to work in.\n- Ability to thrive in fast-paced, high-volume environment. We get a lot of inquires and we work through them quickly; our reps are energized, not discouraged, by the pace.\n- Fantastic written and verbal communication skills and superb interpersonal skills.\n- Experience working with a team to analyze issues, learn from them, and create short-term solutions and long-term improvements.\n- An endless curiosity for our site and product and users.\n- Experience with Adobe Photoshop a big plus.\n- Familiarity with online platforms a plus.\n- Fluency in multiple languages a plus.","publish_date":"2016-08-12"},{"link":"jobs/theranest.html","location":"Telecommute-Birmingham, AL","published":"Aug 12","id":3,"title":"TheraNest Customer Happiness and Billing Specialist","body":"\nThe Customer Happiness and Billing specialist is responsible for assisting in on-boarding, educating, and supporting our customers from pre-trial inquiries all the way to subscription and beyond. You will also be responsible for helping and guiding our customers with everything insurance and claims billing related. This position requires you to be able to work from 8 am to 5 pm US Pacific Time.\n\nThe position will require responding to anywhere from 80 to 100 emails a day and 20 to 25 calls. Often, you will be required to remotely help a customer by sharing screens and walking them through the application. The goal is to solve any problems the user has as it relates to using the software and setting up their accounts to submit claims smoothly.\n\nYou also act as the customers’ liaison with the product team to pass on unique use cases and challenges you see customers experiencing, and how we can help resolve them. You will also use your interactions with customers to help the marketing and sales team in explaining the problems TheraNest helps solve and the key questions and concerns you hear from customers.","publish_date":"2016-08-12"},{"link":"jobs/masabi.html","location":"Boston","published":"Aug 9","id":4,"title":"Masabi Customer Support Engineer","body":"\nMasabi provides mobile ticketing solutions to transit agencies around the world and is transforming the way that people ride public and private transportation.  Our JustRide platform is a SaaS platform that is leading the evolution of mobile ticketing and the customer experience with smart-city connectivity worldwide.  \n\nIn this role, you will bring your experience in front-line technical support to leading agencies in London, New York, Boston, Los Angeles and Las Vegas as well as numerous other metropolitan cities around the globe.\n\nAs front-line technical support you must display and test your technical experience and problem solving skills each day handing incoming support and incident management questions.  The profile of mobile ticketing to commuters and riders worldwide is a real-time experience and our agencies expect high levels of product knowledge, astute customer handling, attention to detail and perseverance.  In return, you will work in a high-paced environment, testing and growing your understanding of mobile applications each day, working side by side with engineering and development teams, and actings as front – line ambassadors for the Masabi Services team.\n\nThe Technical Support Engineer will play an integral role in the success of the Masabi’s Services team by maintaining high levels of customer satisfaction with our mobile ticketing platform. If you are applying you should have a track record working directly with customers while answering technical questions and resolving complex customer issues both technical, user experience and, preferably, experience in a mobile application system or transportation company.\n\n### Responsibilities will include:\n- Acting as the front-line contact for inbound requests submitted by phone, email and instant messaging\n- Responding to requests for assistance in a timely manner; gather technical troubleshooting data to facilitate issue resolution, and assisting product managers and developers in identifying potential resolutions\n- Coordinating customer calls and progress reports.  Create incident management reports and monitors metrics against agreed performance timelines.\n- Managing the resolution of technical and non-technical issues in a professional, courteous manner\n- Troubleshooting a broad range of technical issues on hardware, application, and OS levels\n- Assisting in customer configuration and setups for special ticketing events and programs\n- Be part of an initial launch team for testing and quality assurance; perform basic setup and configuration management and liaise with internal delivery teams.\n- Performing training services via web-conferencing and in-person\n- Creating knowledge and technical reference materials based upon inbound, real-world scenarios; maintain incident management solution reference materials and online tutorials\n- Developing and maintaining a full understanding of all Masabi’s product capabilities and user scenarios where our products are deployed\n- Participating in on-call rotation as required during critical launch and go-live periods\n\n### Skills required \n- Experience in enterprise software support in a client-facing role\n- Comfortable with end-user applications and familiarity with smart-phone devices\n- Basic knowledge of relational databases (SQL Server, Oracle, MySQL)\n- Basic knowledge of web services/web technology (HTML, CSS, XML, JSON)\n- Ability to work independently and collaboratively as needed\n- Excellent investigative and debugging skills\n- Excellent problem solving skills, verbal and written communication skills, ability to work under strict deadlines and interact with customers of varying experience levels\n- Demonstrated ability to research and resolve problems using a variety of tools\n- BA/BS degree or equivalent technical certifications\n\n### How to Apply\nAPPLICATIONS FROM RECRUITERS WILL BE REJECTED\n\nPlease send a copy of your CV and a brief cover note (see below) with the subject: “I am applying for: “Customer Technical Support Engineer” to <a href=\"tech-jobs@masabi.com\">tech-jobs@masabi.com</a>.","publish_date":"2016-08-09"},{"link":"jobs/digitalocean.html","location":"New York City Metro Area","published":"Aug 8","id":5,"title":"Digital Ocean Trust & Safety Manager","body":"\nReporting to the Director of Customer Support, the Trust & Safety Manager at DigitalOcean will lead a team of 11 specialists who ensure our customers have a positive experience on our platform while reducing the impact of bad actions. To excel in this role you should be passionate about people, process and product as you will be guiding all three. This is a great opportunity for an experienced, performance-oriented manager looking for a great new leadership opportunity. You’ll have the chance to portray thought leadership for what Trust & Safety as a practice is at DigitalOcean.\n\nYou will owns all aspects of creating and maintaining processes to continue developing a premier team that effectively handles abuse, law enforcement requests and customer verification. You should also bring a high level of domain experience to the organization. These skills include customer communications, creating internal policies/external policies, and ultimately helping to keep our network safe and abuse free. Finally, this person should also possess excellent interpersonal, communication and management skills. As a leader in our organization, you will have the ability to influence both product and policy decisions with internal teams. This is a full-time position based in our New York City office.\n\n### What You'll Be Doing:\n- Performs 1-on-1 meetings with direct reports as needed and on a regular basis to help motivate and manage their performance\n- Create process guidelines to handle customer verification, inbound abuse and network abuse, law enforcement requests, and outside information sharing\n- Lead a 24/7 team to ensure compliance with processes (you don’t have to work 24/7 though!)\n- Develop relationships with product, security and legal to enhance team productivity and performance\n- Introduces new methods to our processes and oversees their implementation and effectiveness\n- Collaborate with shift managers to ensure continuity in building a strong management team\n- Establish a recruiting plan to attract, hire, onboard, develop, excite and manage high performing team members\n- Develop, measure, and develop team KPIs such as: rate of abuse, RBL listings, FBL volume, etc.\n- Own the communication with the product team to improve the team’s tools\n- Reduces overall costs of handling abuse\n- Own relationships with key outside parties such as law enforcement, ensuring overall compliance with legal procedures\n\n### What We'll Expect From You:\n- Exhibits and lives the servant leadership style and has prior experience as a manager.\n- Understands fraud and abuse within a cloud infrastructure environment and has experience effectively combating it.\n- Creates a climate in which people want to do their best; can motivate many kinds of direct reports and team or project members, empowering others.\n- Is dedicated to meeting the expectations required of internal and external customers.\n- Gets first hand customer information and uses it for improvements in service.\n- Establishes and maintains effective relationships with customer and internal team members, gaining their trust and respect.\n- Spends his/her time and the time of others on what’s essential to success.\n- Can quickly sense what will help or hinder accomplishing a goal, eliminating roadblocks and creating focus.\n- Has the ability to get their hands dirty with customer facing tasks while displaying the capacity to delegate as needed.\n- Is personally committed and actively works to improve self through on the job and outside learning.\n- Is able to write clearly and effectively in reviewing direct reports, responding to customer inquires and follow-ups.\n- Expresses the capacity to manage a distributed team, across multiple timezones and shifts. \n- Displays empathy to both internal and external customer requests.\n- Showcases the ability to encourage and facilitate mentoring and knowledge sharing within the Support team\n- Strongly identify with our brand and team culture\n- Prior experience in similar environments\n\n### Minimum Qualifications:\n- Bachelor's degree in relevant field and/or at least 4-5+ years of related experience\n- Technical expertise with Linux and other OpenSource technologies is ESSENTIAL; this person will be an integral and hands-on member of the team at large\n- Experience as a technical or support lead/supervisor/manager, ideally in a similar IaaS, service provider or cloud computing environment\n- Direct experience with managing, coaching, and mentoring team members\n- Exceptional verbal and written communications skills\n- Strong analytical skills and pattern recognition\n- Exceptional attention to detail and follow-up\n- Experience with staffing, interviewing and team building\n\n### Working at DigitalOcean:\n- DigitalOcean offers competitive health, dental, and vision benefits for both employees and their dependents\n- Competitive compensation including a 401k with up to 4% employer match\n- Flexible vacation time\n- Stock options\n- Daily catered lunch as well as a corporate Seamless account to keep your hunger at bay\n- Monthly commuter expense and gym membership allowance\n- Great office space located in the heart of SoHo\n\n<i>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</i>","publish_date":"2016-08-08"},{"has_chat":"true","link":"jobs/helpscout.html","location":"Remote - PST - Tuesday - Saturday","published":"Aug 1","id":6,"title":"Help Scout Customer Champion","body":"\nSupport is Help Scout's bread and butter. We’re pleased to be searching for our sixth, full-time support team member. Our ideal hire is motivated by what we're doing as a company, and eager to contribute on the front lines.\n\n## About the Role\n* This is a remote position. We’re looking for someone to work Tuesday - Saturday, preferably PST hours.\n* You'll be a product expert in all areas. You'll spend most of your days sending timely, human replies to questions via email, but you’ll also create helpful videos, craft documentation, field phone calls, and offer guided tours.\n* Customer success is a big piece of the pie. You'll work one-on-one with customers, helping them to get the most out of Help Scout. You might wing unplanned Skype calls and live screen-shares, or schedule meetings to talk about unique use cases.\n* We don't hold you to empty policies or procedures. We expect you to always act in the best interest of the customer. You’ll be given plenty of autonomy to simply do what’s right, no questions asked. With great power comes great responsibility.\n* We’re sticklers about the customer experience. We’re always refining and polishing the product to perfection. As someone on the front line, your understanding of the product and our customers is incredibly valuable. You’ll regularly chat with the product team to make sure we’re getting it right.\n\n## About You\n* You are a free spirit who thrives in an environment where you can do great work without a ton of oversight.\n* You’re passionate about support. You’re in it for the long haul, and you’re not looking for the “next best thing”. This isn’t your first rodeo, nor is it a stepping stone. We’re looking for someone with at least one year of support experience.\n* You’re patient and hardy, with an excellent sense of humor. You’re an exceptional listener and educator, and you’re naturally curious with a strong desire to learn.\n* You’re an incredible communicator, fluent in written English. You’re just as comfortable on the phone or in person as you are in an email. Your writing is clear and simple, with a proper dose of empathy.\n* You have rare people skills that allow you to get out in front of problems, and proactively help customers with potential troubles. You’re a natural people-person. You’re the type of person that goes out of their way to make things right, always.\n* You have good ole’ fashioned work ethic, day in and day out. You have hustle and take initiative and ownership to see things through to completion. If it needs doing, you do it.\n\n\n### Benefits\n* Work anywhere - Work from our office in Boston or anywhere else. For this role we're ideally looking for someone based in the PST timezone, Tuesday - Saturday.\n* Competitive Salary - Based on our salary formula: $63,000 - $83,000. We pay at or above market salary in most cases and evaluate a lot of research to make sure everyone is paid well. The formula we use to calculate all salaries is public to employees and is improved upon regularly.\n* Health and dental insurance - We cover you and your family's health/dental insurance 100%. If you are based in the US, we'll cover you on our Harvard Pilgrim HMO or PPO policies.\n* Long-term/Short-term Disability Insurance & Life Insurance - we cover 100% of the premiums for LT/ST Disability insurance and base Life Insurance. You also have the option to purchase supplementary life insurance through our provider.\n* International Benefit Stipend - If you’re based outside the US, you’ll receive a monthly stipend that goes towards covering medical insurance, long and short-term disability, and accountant costs\n* Flexible vacation - Take time off when you need it, we trust you.\n* Paid parental leave, including adoption - 12 weeks if you have or adopt a baby, 4 weeks if your partner has a baby.\n* 401k with 1% match- 1% Retirement Plan matching for both US and International Employees\n* Personal development stipend - Up to $1,800 per year to improve your craft\n* Great tools - Each employee receives a Mac laptop and 27'' display (or equivalent). We’ll also purchase any of the software or hardware you need.\n* Complete transparency - Everyone has full access to business metrics and financial information about the company.","publish_date":"2016-08-01"},{"feature":"true","link":"jobs/ipsy-care.html","location":"San Mateo, CA","published":"Jul 19","id":7,"title":"ipsy Customer Care Representative","body":"\nAt ipsy, our customers are at the core of everything we do, and we’re committed to providing them with top-notch service. We’re searching for a support representative who is passionate about helping others, who can proactively offer solutions and ideas that will delight our members. This position is responsible for managing sensitive customer interactions, proposing creative solutions, and establishing rapport with our engaged community. You will be scheduled for our evening shift (12-8 PM), and one weekend shift per week.\n\nCOVER LETTER REQUIRED – Please tell us about yourself and why you’re interested in this role.\n\n### You Are:\n- Support driven. You have a passion for problem-solving and enjoy being challenged. Helping others comes naturally to you.\n- Perceptive and empathetic. You proactively anticipate customer needs. You can adapt your tone and approach to fit a diverse range of customer personalities and situations.\n- Honest and authentic. You’re comfortable being yourself and genuinely enjoy connecting with others. You express yourself openly and respectfully, and function well as part of a team.\n- Reliable and accountable. You’re consistent, dependable, and adhere to a set work schedule.\n- You take ownership over the quality of your work and make an effort to improve.\n- Innovative. You're a creative thinker who can offer solutions to the trickiest conundrums. You bring compelling ideas to the table in an effort to catalyze positive change.\n\n### Responsibilities:\n- Respond to customer emails in a professional, friendly, and timely manner to enhance our members’ knowledge of ipsy and create a positive experience for them\n- Manage sensitive issues while maintaining the highest level of professionalism; provide thoughtful, prompt resolutions with empathy and poise\n- Recommend solutions to complex or escalated situations through research and critical thinking\n- Share relevant, strategic insights with our product, marketing, and technology teams regarding overall customer experience and service-related trends\n- Strive to exceed volume and quality goals\n- Help with additional projects as needed\n\n### Qualifications:\n- Bachelor degree or equivalent experience\n- 1-3 years in customer-centric industry\n- Strong computer and typing skills, very comfortable with web-based applications and navigation between tools\n- Exceptional written communication skills with keen attention to detail\n- Entrepreneurial spirit with ability to manage workflow efficiently\n- Willing to work one weekend shift per week\n- Experience providing customer support via social media is a plus","publish_date":"2016-07-19"},{"feature":"true","link":"jobs/ipsy-social.html","location":"San Mateo, CA","published":"Jul 19","id":8,"title":"ipsy Customer Care Representative - Social Media","body":"\nipsy is committed to providing excellent service to our community. We’re seeking someone with a passion for helping others, who can actively suggest initiatives that will delight our membership. This role is responsible for providing customer support through our various social media channels (Facebook, Instagram, Twitter, Pinterest, and YouTube). It will involve managing sensitive customer escalations, researching and proposing creative solutions, and building rapport with our active community.\n\nCOVER LETTER REQUIRED – Please tell us about yourself and why you’re interested in this role.\n\n### You Are:\n- Passionate about providing excellent support. You enjoy tackling a challenge head on and never shy away from an opportunity to learn and grow. You love social media and understand the importance of brand consistency.\n- Empathetic and perceptive. You can identify the tone of a customer and adjust your approach accordingly. You are proactive and always anticipate customer needs.\n- Authentic and honest. You’re not afraid to be yourself, and you have a desire to connect with others in a genuine way. You communicate openly and respectfully with teammates.\n- Reliable and accountable. You can adhere to a consistent work schedule. You accept ownership over the quality of your work, and take initiative to keep improving.\n- Creative. You’re an innovator who can think of solutions to the trickiest conundrums. You bring compelling ideas to the table in an effort to catalyze positive change.\n\n### Responsibilities:\n- Respond to comments made on our social channels in a timely, friendly, and professional manner to educate and create positive connections with our community.\n- Identify sensitive issues and potential escalations, and relay to appropriate teams ensuring that all members are helped in a quick and thorough manner.\n- Maintain the highest level of professionalism while managing sensitive issues. Demonstrate empathy while providing thoughtful and prompt resolutions.\n- Research complex and escalated situations and recommend solutions.\n- Provide thoughtful, strategic insight regarding customer requests and service-related trends to our product, marketing, and technology teams.\n- Strive to exceed volume and quality goals.\n- Help with side projects as needed.\n- You will be responsible for working our midday or evening shift (10 - 6 or 12 - 8 PM), and one weekend shift per week.\n\n\n### Qualifications:\n- Bachelor degree or equivalent experience.\n- 1-3 years in customer-centric industry, preferably with experience providing customer support via social media.\n- Strong computer and typing skills. Particularly high level of comfort in web-based applications and navigation between tools.\n- Exceptional written communication skills with keen attention to detail.\n- Entrepreneurial spirit with ability to manage workload efficiently.\n- Willing to work one weekend shift per week.","publish_date":"2016-07-19"},{"has_chat":"true","link":"jobs/basecamp.html","location":"Remote -- preferably EST USA","published":"Jul 18","id":9,"title":"Basecamp Customer Support Rep","body":"\nWe’re looking for a super smart support team member! Specifically, we're seeking a native English speaker in the US (preferably EST).\n\nYou’ll be responsible for providing tremendous customer service via email and phone for all versions of Basecamp. You’ll also help us answer questions via Twitter, create and edit help documentation, run personalized demos, and maybe some online classes.\n\nDuring training, you'll be expected to be proactive in your process and learn quickly. Once fully up-to-speed (2-3 months), you'll write about 100 emails per day. This is a significant volume, so be sure that you’re ready and able to deal with that kind of daily load -- you'll get all the love and help you need along the way!\n\nWe’re looking for some great writers who love helping our customers, so you should enjoy making complicated situations simple and painless and have a passion for our products. This means being a great problem solver with the ability to process and resolve issues quickly.\n\nIf you want to join Carrie, Chase, Chris, Elizabeth, James, Jayne, Jim, Joan, Kristin, Merissa, Natalie, Sylvia and Tony in making our customers happy, please apply!\n\n**Please submit a cover letter explaining:**\n\n- Why you want to work in customer support.\n- Why you want to work at Basecamp and not somewhere else.\n- A description of a great customer service/support experience you had recently, and what made it great.\n- A time you taught yourself a new skill to complete a job or project.\n- A guide to making a peanut butter and jelly sandwich. (Seriously.)\n\n**Also, pick three of the questions from customers below and answer them like you would if you worked here:**\n\n- Does the new Basecamp offer time tracking?\n- Is the new Basecamp offered in any other language besides English?\n- I've been a Basecamp user for years and see you have a new version. What's the difference between the versions, and why should I switch?\n- How do I work with clients in the new Basecamp?\n\nWe offer heaps of lovely benefits, a competitive salary, plus a progressive work environment.\n\nWe look forward to hearing from you!\n\n**How to apply:**\n\nEmail everything to <a href=\"mailto:jointheteam@basecamp.com\">jointheteam@basecamp.com</a>. Include “Customer Support,\" your location, and \"Support Driven\" in the subject line. If you’re attaching a resume, please send it as a PDF.","publish_date":"2016-07-18"},{"link":"jobs/livestream.html","location":"New York, NY","published":"Jul 14","id":10,"title":"Livestream Live Video Support Specialist","body":"\n<div id=\"content\" class=\"\">\n      <p><strong>What’s this job?</strong></p>\n<p>Your job is to make the world a better place one support ticket at a time. From our not-so-secret lair in Bushwick you’ll help our producers across the US and even around the world. &nbsp;We’re here to make sure their work gets to their audience.</p>\n<p><strong>What will you do here?</strong></p>\n<ul>\n<li>Answer customer questions and concerns regarding Livestream's hardware products, platform services and anything in between.&nbsp;</li>\n<li>Troubleshoot technical issues, drive the product roadmap and help developers diagnose bugs.</li>\n<li>Be the first point of contact for incoming calls, emails, and online chats.</li>\n<li>Write and update customer facing FAQs and other internal documents.</li>\n<li>Proactively look for ways to improve our service and to better serve our customers.</li>\n</ul>\n<p><strong>Who you are:</strong></p>\n<ul>\n<li><strong>A video or internet guru.</strong>&nbsp;</li>\n<ul>\n<li>We help people stream video over the internet - you should be a master of at least one of those things and excited to learn the other.</li>\n</ul>\n<li><strong>Passionate about connecting with and helping people.</strong></li>\n<ul>\n<li>You love listening, talking, and working with people makes you happy.</li>\n<li>You're patient, sympathetic, and understand how to find that sweet balance between customer service and genuine friendliness.</li>\n</ul>\n<li><strong>An exceptional communicator.</strong></li>\n<ul>\n<li>You treat people kindly and can gracefully break down, solve, and explain, even the most complex problems.</li>\n<li>Bonus: You cringe when you see poor grammar in social media posts.</li>\n</ul>\n<li><strong>Curious.</strong></li>\n<ul>\n<li>You master any area you work in and naturally do more than is asked of you.</li>\n<li>You take initiative and ownership to see things through to completion.</li>\n<li>We won’t micro-manage you. We provide you with lots of wiggle room and you must be hungry to learn and grow with the company.</li>\n</ul>\n<li><strong>A team player. </strong></li>\n<ul>\n<li>You get along with others and know how to keep the mood light.&nbsp;<a href=\"http://media0.giphy.com/media/5r5J4JD9miis/giphy.gif\">Your .gif game is on point!</a></li>\n</ul>\n</ul>\n<p><strong>Required for a callback:</strong></p>\n<ul>\n<li>Bachelor's level education or above.</li>\n<li>Demonstrated job stability - at least 1 year in a professional environment.</li>\n<li>At least 6+ months experience working in a customer service or support role.&nbsp;</li>\n<li>Ability to work a flexible schedule that&nbsp;includes required evening&nbsp;and weekend shifts.</li>\n<li>Solid computer skills - you need to know your way around a Google spreadsheet; blindfolded after spinning on a bat 10 times.</li>\n<li>¿Hablas español? No es necesario. ¡Pero sería genial!</li>\n</ul>\n<p><strong>What are the benefits?</strong></p>\n<ul>\n<li>Full Time Position</li>\n<li>Competitive salary</li>\n<li>Comprehensive health, dental, and vision coverage</li>\n<li>401(k) savings</li>\n<li>Paid holidays</li>\n<li>Commuter Discounts</li>\n<li>Annual company outing and regular celebrations</li>\n<li>Stacks of snacks and caffeine</li>\n<li>Working with awesome people</li>\n</ul>\n<p><strong>&nbsp;</strong></p>\n</div>","publish_date":"2016-07-14"},{"has_chat":"true","link":"jobs/capsule.html","location":"UK/Remote","published":"Jul 13","id":11,"title":"Capsule Customer Support","body":"\nSince 2009 we’ve been making it easy for business to take care of their customers and sales opportunities. Capsule is now one of the most popular CRM’s for small business and sales teams.\n\nWe’re expanding our support team and looking for someone who loves helping people out. Troubleshooting and communication will be a big part of your job and you’ll be comfortable using email & twitter to keep our customers happy. You’ll also spend some time working with our development and design teams to share customer feedback and test new features.\n\nWe’re a UK based company with an office in central Manchester. We’re open to remote working if you’re outside of Manchester, but you need to be in the UK for this position. You’ll be joining a small, dedicated & friendly team that cares deeply about the customer experience. We offer a start-up style culture with a competitive salary and benefits.\n\n### What we’re looking for:\n- You have experience helping customers through a previous marketing or support-related position\n- You’re tech savvy with an interest in web and mobile apps\n- You’ll be a great writer with a positive style and enjoy describing solutions simply\n- You’re able to read between the lines when necessary and minimise emails back-and-forth to get to a solution quickly\n- You’re self motivated and confident working independently but you also know your limits and when to seek direction\n- You’re a pro at minimising disruptions whether working remotely or in the office and can get through a high volume of emails each day\n\n### A typical week involves:\n- Helping people get the most out of Capsule by responding to emails and tweets\n- Troubleshooting and detailing issues for our developers to resolve\n- Sharing customer feedback with the design and development team\n- Creating and updating helpful online support guides\n- You’ll also spend some time contributing to scaling and improving our internal support practices\n\n### We offer very competitive salaries and benefits\n- Flexible working hours\n- 25 days paid annual leave in addition to the stat holidays\n- Private medical, dental and optical insurance\n- Pension scheme with generous matched contributions\n- Casual dress environment\n- The best kit for the job (which usually means lots of Apple gear)\n- Monthly eBook allowance with your choice of iPad Mini or Kindle\n- Mobile phone (e.g. Android or iPhone)\n- Conference allowance\n\n### How to apply:\nIf this excites you and your experience and strengths match what we’re looking for <a href=\"mailto:jointheteam@capsulecrm.com\">send us an email</a> introducing yourself.","publish_date":"2016-07-13"},{"has_chat":"true","feature":"true","link":"jobs/automattic.html","location":"Remote","published":"Jul 5","id":12,"title":"Automattic Happiness Engineer","body":"\nAs a Happiness Engineer, helping people is your passion. Maybe you’ve developed your own support philosophy by reading books like Delivering Happiness or Exceptional Service, Exceptional Profit. Perhaps you’re a contributor in an online support community such as the <a href=\"http://wordpress.com/\">WordPress.com</a> forums or <a href=\"http://wordpress.com/\">WordPress.org</a> forums.\n\nTransforming publishing on the web is no small task. Our goal is to build relationships based on trust which result in happy, passionate, loyal customers and colleagues. We do this through listening to their needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.\n\n##In general, a typical day involves:\n\n* Helping people use Automattic’s products, including <a href=\"http://wordpress.com/\">WordPress.com</a>, WooCommerce, Jetpack, Gravatar, and more\n* Troubleshooting, investigating, and creating detailed bug reports\n* Crafting and editing helpful support documentation\n* Being an active member of a team that provides around the clock support to our users via live chat, forums, and email\n* Building a community of support by sharing knowledge and insight amongst team members\n\n##Being a Happiness Engineer requires:\n\n* Patience, grace, and a sense of humor\n* Excellent writing and communication skills\n* Working knowledge of WordPress, HTML, and CSS\n* A knack for taking technical language and making it understandable\n* A passion for solving tough problems and proposing elegant solutions\n\nHappiness Engineers must be fluent and eloquent in written English. If you know additional languages, be sure to tell us!\n\nThe <a href=\"http://wordpress.com/\">WordPress.com</a> and <a href=\"http://wordpress.com/\">WordPress.org</a> forums are fantastic places to gain the experience required for this position. If you are already active there, let us know! Send a link to your forum profile and we’ll check it out.","publish_date":"2016-07-05"}]